{"code":"P0814","description":"Transmission Range Display Circuit","info":["This diagnostic trouble code (DTC) is a generic powertrain code and applies to many OBD-II vehicles (1996-newer). That may include but is not limited to vehicles from Mercedes-Benz, Jaguar, Range Rover, Ford, Volvo, Sprinter, etc. Although generic, the exact repair steps may vary depending on year, make, model and powertrain configuration.","\n ","If your vehicle has stored a code P0814, it means that the powertrain control module (PCM) has detected a malfunction in the transmission range display circuit. This type of code is limited to vehicles with automatic transmissions.","The transmission control module (TCM) may be a stand alone module or part of the PCM. The transmission range display sensor is often integrated into the neutral safety switch. The transmission range display sensor is actuated by the shift shaft and provides a voltage signal to the PCM and the instrument panel control module (IPCM) which reflects the specific gear that has been selected. Various engine and transmission outputs are monitored by the PCM to determine whether the transmission range display sensor is in the appropriate position. Additionally, the PCM monitors transmission range sensor circuit voltage to ensure that is within established parameters.","If the PCM detects that the vehicle is moving in a fashion which is not conducive to the gear selection input by the transmission range display sensor or if circuit voltage is not within allowable parameters, a code P0814 may be stored and a malfunction indicator lamp (MIL) illuminated. Multiple ignition cycles (with a failure) may be required for MIL illumination."],"symptoms":["Shift indicator (on dash or console) is inoperative\nShift indicator reflects incorrect gear\nNo start or engine will start with transmission in gear\nNo symptoms may be exhibited"],"causes":["Defective transmission range display sensor\nShorted or open circuits in transmission range display sensor circuit\nBroken or defective shift indicator\nFaulty PCM or a programming error"]}