{"code":"P0811","description":"Excessive Clutch Slippage","info":["This diagnostic trouble code (DTC) is a generic powertrain code and applies to many OBD-II vehicles (1996-newer). That may include but is not limited to vehicles from Audi, Volkswagen, Volvo, BMW, etc. Although generic, the exact repair steps may vary depending on year, make, model and powertrain configuration.","\n ","If your vehicle has stored a code P0811, it means that the powertrain control module (PCM) has received a data input signal from the input and output speed sensors which indicates that the clutch is slipping excessively.","The transmission control module (TCM) may be a stand alone unit but is most commonly integrated into a single housing with the engine control module (ECM). This is called the PCM.","The PCM utilizes input signals from multiple engine and transmission sensors to calculate the maximum allowable degree of transmission (clutch) slippage. Clutch disc and pressure plate wear, as well as mechanical failure, may lead to excessive clutch slippage. The PCM uses voltage input signals from the transmission input speed sensor and transmission output speed sensor to determine if the clutch is functioning within the parameters for maximum allowable slippage.","As with many other transmission malfunctions, a clutch slippage code may be caused by electrical or mechanical failure. Often when the friction material on the clutch disc is worn down below a certain level, the clutch begins to slip. This condition is usually accompanied by the distinctive odor of burnt friction material.","If the PCM detects a degree of transmission (clutch) slippage that exceeds maximum allowable parameters, a code P0811 may be stored and a malfunction indicator lamp (MIL) illuminated. Multiple ignition cycles (with a failure) may be required for MIL illumination."],"symptoms":["Transmission slippage\nHarsh gear engagement\nClutch engagement occurs near the top\nStrong odor of burnt friction material"],"causes":["Worn clutch disc and/or pressure plate\nDefective input or output speed sensor\nShorted wiring for input speed/output speed sensors\nFaulty PCM or a programming error"]}