{"code":"P0810","description":"Clutch Position Control Error","info":["This diagnostic trouble code (DTC) is a generic powertrain code and applies to many OBD-II vehicles (1996-newer). That may include but is not limited to vehicles from Volvo, Toyota, Ford, Honda, Jeep, etc. Although generic, the exact repair steps may vary depending on year, make, model and powertrain configuration.","\n ","If your vehicle has stored a code P0810, it means that the powertrain control module (PCM) has detected a malfunction in the clutch position control system. This code is applicable to vehicles with manual transmissions only.","The clutch position sensor provides a secondary safety feature to prevent the engine from being started while the transmission is in gear. It is typically a two-position switch that is open with the clutch pedal in the up position and closed when it is depressed. Clutch position sensors are usually located under the driver’s side dash on the clutch pedal pivot arm bracket.","The transmission control module (TCM) may be stand alone unit but is most commonly integrated into a single housing with the engine control module (ECM). This is what is referred to as the PCM. The PCM calculates input data from the transmission input speed sensor, output speed sensor, and vehicle speed sensor/s to determine the desired position of the clutch pedal position sensor.","If the PCM detects a malfunction in the clutch position control circuit or detects that the clutch pedal is not in the correct position for current conditions, a code P0810 will be stored and a malfunction indicator lamp (MIL) illuminated. Multiple ignition cycles (with a failure) may be required for MIL illumination."],"symptoms":["Starter will not engage flywheel to crank engine\nEngine starts with transmission in gear\nNo symptoms may be exhibited"],"causes":["Defective clutch position sensor\nOpen or shorted clutch position sensor control wiring or connectors\nBad TCM, PCM, or controller programming error"]}