{"code":"P0896","description":"Shift Time Too Long","info":["This diagnostic trouble code (DTC) is a generic powertrain code and applies to many OBD-II vehicles (1996-newer). That may include but is not limited to vehicles from Volvo, Mercedes Benz, Ford, Dodge, BMW, Land Rover, Citroen, Peugeot, etc. Although generic, the exact repair steps may vary depending on year, make, model and powertrain configuration.","\n ","If your vehicle has stored a code P0896, it means that the powertrain control module (PCM) has received a data input signal from the input and output speed sensors which indicates that the interval to shift between gears is excessive.","The transmission control module (TCM) may be a stand alone unit but is most commonly integrated into a single housing with the engine control module (ECM). This is called the PCM.","The PCM utilizes input signals from multiple engine and transmission sensors to calculate automatic transmission shift strategy. A high pressure pump (inside the transmission) forces fluid through the valve body and into the sprag assembly; in addition to lubricating and cooling the transmission. The high pressure fluid allows the clutches to separate from the sprag momentarily so that the gear ratio may be changed smoothly. One or more electronic pressure control (EPC) solenoids help to regulate fluid pressure. Electronic pressure (EP) sensors provide the PCM with pertinent data regarding fluid pressure at various points in the transmission. Electronic shift solenoids are used to interrupt the flow of high pressure fluid so that the transmission shifts gears when commanded. The PCM uses voltage input signals from the transmission input speed sensor and transmission output speed sensor to determine if the transmission is shifting efficiently.","As with many other automatic transmission malfunctions, a transmission shift time code may be caused by electrical or mechanical failure. If the PCM detects that shift time is excessive, a code P0896 may be stored and a malfunction indicator lamp (MIL) illuminated."],"symptoms":["Excessive transmission fluid pressure\nDelayed and/or harsh gear engagement\nErratic transmission shift patterns\nUnusual whining noise from transmission"],"causes":["Defective high pressure pump in the transmission\nCatastrophic internal (mechanical) transmission failure\nShorted wiring for EPC solenoid or EP sensors\nBad EPC solenoid or EP sensor\nFaulty PCM or a programming error"]}