{"code":"P0893","description":"Multiple Gears Engaged","info":["This diagnostic trouble code (DTC) is a generic powertrain code and applies to many OBD-II vehicles (1996-newer). That may include but is not limited to vehicles from Mercedes Benz, Toyota, Kia, Mitsubishi, Jeep, Chevrolet, Dodge, etc. Although generic, the exact repair steps may vary depending on year, make, model and powertrain configuration.","\n ","If your vehicle has stored a code P0893, it means that the powertrain control module (PCM) has received a data input signal which indicates multiple gears in the automatic transmission have been engaged simultaneously.","The transmission control module (TCM) may be a stand alone unit but is most commonly integrated into a single housing with the engine control module (ECM). This is called the PCM.","The PCM utilizes input signals from multiple engine and transmission sensors to calculate automatic transmission shift strategy. Electronic shift solenoids are used to interrupt the flow of high pressure fluid so that the transmission may shift gears. If multiple solenoids are activated simultaneously, multiple gears will be engaged and the desired gear ratio will be impossible to achieve.","As with many other automatic transmission malfunctions, multiple gear engagement may also be caused by mechanical failure. Often when the friction material on one or more clutch discs is compromised, the hot material effectively 'welds' multiple sprags together and creates a multiple gear engagement condition. This condition is accompanied by the distinctive odor of burnt friction material in the fluid.","If the PCM detects that multiple gears of the automatic transmission are engaged simultaneously, a code P0893 may be stored and a malfunction indicator lamp (MIL) illuminated."],"symptoms":["Transmission slippage\nDelayed and/or harsh gear engagement\nErratic transmission shift patterns\nStrong odor of burnt friction material in transmission fluid"],"causes":["Catastrophic internal (mechanical) transmission failure\nShorted wiring for shift solenoids\nDefective shift solenoid/s\nFaulty PCM or a programming error"]}