{"code":"P0894","description":"Transmission Component Slipping","info":["This diagnostic trouble code (DTC) is a generic powertrain code and applies to many OBD-II vehicles (1996-newer). That may include but is not limited to vehicles from Chevrolet, GMC, Mazda, Mercedes Benz, Toyota, Lexus, etc. Although generic, the exact repair steps may vary depending on year, make, model and powertrain configuration.","\n ","If your vehicle has stored a code P0894, it means that the powertrain control module (PCM) has received a data input signal from the input and output speed sensors which indicates that an internal transmission component is slipping.","The transmission control module (TCM) may be a stand alone unit but is most commonly integrated into a single housing with the engine control module (ECM). This is called the PCM.","The PCM utilizes input signals from multiple engine and transmission sensors to calculate automatic transmission shift strategy. Electronic shift solenoids are used to interrupt the flow of high pressure fluid so that the transmission may shift gears. The PCM uses voltage input signals from the transmission input speed sensor and transmission output speed sensor to determine if the transmission is functioning efficiently and without slippage.","As with many other automatic transmission malfunctions, a transmission slippage code may be caused by electrical or mechanical failure. Often when the friction material on one or more clutch discs is compromised, the transmission is not able to realize the desired gear ratio due to slippage. This condition is usually accompanied by the distinctive odor of burnt friction material in the fluid.","If the PCM detects a degree of transmission slippage that exceeds maximum allowable parameters, a code P0894 may be stored and a malfunction indicator lamp (MIL) illuminated."],"symptoms":["Transmission slippage\nDelayed and/or harsh gear engagement\nErratic transmission shift patterns\nStrong odor of burnt friction material in transmission fluid"],"causes":["Catastrophic internal (mechanical) transmission failure\nDefective input or output speed sensor\nShorted wiring for input speed/output speed sensors\nFaulty PCM or a programming error"]}