{"code":"P0903","description":"Clutch Actuator Circuit High","info":["This is a generic powertrain diagnostic trouble code (DTC) and applies to many OBD-II vehicles (1996-newer). That may include but is not limited to vehicles from Toyota, Smart, Ford, Mazda, Hyundai, Mercedes, etc. Although generic, the exact repair steps may vary depending on year, make, model and powertrain configuration.","\n ","OBD-II trouble code P0903 and related codes P0900, P0901, and P0903 are associated with the clutch actuator electrical circuit. This circuit is monitored by the Engine Control Module (ECM), the Power Control Module (PCM) or the Transmission Control Module (TCM) based on the specific vehicle.","The purpose of the clutch actuator circuit is to engage and disengage the clutch or clutches on a semi-automatic transmission. Based on the specific vehicle and the configuration, several sensors and associated components are required to accomplish this task. Some configurations incorporate two hydraulic clutches, one for even gears and another for odd gears. The number of gears may range from 6 to 9 on newer vehicles. Basically, this design facilitates gear changes that are smooth and seamless operating in the same manner as a fully automatic transmission.","When the ECM, PCM or TCM detects a high voltage or resistance condition in the clutch actuator circuit, code P0903 will be set and the check engine light or the transmission warning lamp will be illuminated.","A clutch actuator:\n"],"symptoms":["Motor may not crank over\nEngine may stall while driving\nTransmission may be placed into a limp mode\nTransmission may be stuck in one gear\nTransmission warning lamp illuminated\nCheck engine light illuminated"],"causes":["Defective clutch actuator\nDefective sensor or solenoid\nFaulty or damaged wiring\nLoose or defective control module ground strap\nCorroded, damaged or loose connector\nDefective fuse or fuse-able link (If applicable)\nClutch master cylinder malfunction\nDefective ECM, PCM or TCM"]}