{"code":"P2413","description":"Exhaust Gas Recirculation System Performance","info":["This diagnostic trouble code (DTC) is a generic powertrain code, which means that it applies to all 1996-newer vehicles (Ford, Dodge, GMC, Chevrolet, Mercedes, VW, etc.). Although generic, the specific repair steps may vary depending on make/model.","The presence of a stored P2413 code means that the powertrain control module (PCM) has detected a malfunction in the exhaust gas recirculation (EGR) system.","\n ","The EGR system, used in ODB-II equipped vehicles, is designed to help reduce nitrogen oxide emissions in engine exhaust. It consists of an electronically controlled EGR valve that is opened via a voltage signal from the PCM. When it is opened, a portion of spent engine exhaust gases are allowed to reenter the engine’s induction system where excessive NOx vapors are burned as fuel.","There are two basic types of EGR systems used in modern automobiles and light trucks. They are linear and vacuum diaphragm. Either type is designed with multiple openings that intersect in a single chamber. One of the openings is fitted with a plunger that seals it tightly when not commanded to open. The valve is positioned so that, when the plunger is opened, exhaust can flow through the EGR chamber and enter the intake passage/s. This is usually accomplished with either an EGR exhaust tube or with an extended intake passage. The linear EGR is opened using one or more electronically controlled solenoid/s that are controlled by the PCM. When the PCM recognizes a certain engine load, vehicle speed, engine RPM, and engine temperature (depending upon vehicle manufacturer), the EGR valve is opened to a desired degree.","The vacuum diaphragm type valve can be a bit more complex, as it uses an electronically controlled solenoid to divert intake vacuum to the EGR valve. The solenoid is typically supplied with intake vacuum on one (of two) ports. When the solenoid is commanded open by the PCM, vacuum is allowed to flow through and reach the EGR valve; opening the valve to the desired degree.","When the EGR valve is commanded open, the PCM monitors EGR system performance using several varying methods. Some manufacturers equip their vehicles with a dedicated EGR sensor. The most common type of EGR sensor is the Delta Process Feedback EGR (DPFE) sensor. When the EGR valve is opened, exhaust gases flow into the sensor via high temp silicon hoses. Other automakers use changes in manifold air pressure (MAP) and manifold air temperature (MAT) to monitor EGR performance.","When the PCM commands the EGR valve to be opened, if it does not see the desired degree of change in the EGR sensor or MAP/MAT sensor, a code P2413 will be stored and a malfunction indicator lamp may be illuminated.\n"],"symptoms":["Diminished fuel efficiency\nThe presence of other related EGR codes\nA stored code\nAn illuminated malfunction indicator lamp"],"causes":["Possible causes for this engine code include:","A defective EGR sensor\nFaulty MAP/MAT sensor\nBad EGR valve\nExhaust leaks\nCracked or collapsed vacuum lines\nOpen or shorted EGR control or EGR sensor circuits"]}