{"code":"P2426","description":"Exhaust Gas Recirculation Cooling Valve Control Circuit Low","info":["This diagnostic trouble code (DTC) is a generic powertrain code and applies to many OBD-II vehicles (1996-newer). That may include but is not limited to vehicles from VW, Nissan, Audi, Ford, etc. Although generic, the exact repair steps may vary depending on year, make, model and powertrain configuration.","\n ","A stored code P2426, means that the powertrain control module (PCM) has detected an insufficient degree of voltage on the exhaust gas recirculation (EGR) cooling valve control circuit. EGR cooling systems are only used in diesel engine applications.","The EGR system is designed to deliver a portion of inert exhaust gases back to the engine induction system where it is substituted for oxygen rich clean air. Substituting the spent exhaust gases for oxygen rich air causes a reduction in nitrogen oxide (NOx) particles. Regulated by federal mandate, NOx is a contributing part of ozone depleting exhaust emissions.","EGR cooling systems are used to reduce the temperature of EGR gases before they enter the engine air induction system. The EGR cooling system functions like a radiator or heater core. Engine coolant is sealed inside of a finned area which is positioned so that EGR gases may flow across it. A cooling fan is sometimes used as well. The electronically controlled EGR cooling valve regulates the flow of engine coolant to the EGR cooler under certain conditions.","The PCM uses input signals from the engine coolant temperature (ECT) sensor and the EGR cooler temperature sensor/s to determine when and to what degree the EGR cooling valve is opened or closed at any given time. The PCM monitors EGR cooling valve control system voltage whenever the key is turned on.","ECT and EGR cooler temperature sensors provide the PCM with variations in EGR cooler and engine coolant temperature. The PCM compares these input signals to calculate whether or not the EGR cooling system is functioning as intended. EGR temperature sensors are typically located near the EGR valve and ECT sensors are usually positioned in a cylinder head water jacket or intake manifold water jacket.","If the EGR cooling valve control system voltage is too low, below the normal range of programmed parameters, or if the input signals from the EGR temperature sensor/s are not similar to that of the ECT sensor, a P2426 will be stored and a malfunction indicator lamp may be illuminated.","The EGR valve is one part of the EGR system:\n"],"symptoms":["No symptoms (except code storage)\nIncreased cylinder temperature\nDiminished fuel efficiency\nExhaust temperature sensor codes\nEngine temperature sensor codes"],"causes":["Open or shorted EGR cooling valve control wiring or connectors\nLow engine coolant\nDefective EGR temperature sensor/s\nClogged EGR cooler\nEngine overheating\nFaulty EGR cooling fan"]}