{"code":"P2434","description":"Secondary Air Injection System Air Flow/Pressure Sensor Circuit Intermittent/Erratic Bank 1","info":["This is a generic powertrain diagnostic trouble code (DTC) and applies to many OBD-II vehicles (1996-newer). That may include but is not limited to vehicles from Buick, Chevrolet, Cadillac, Lexus, Toyota, BMW, Subaru, etc. Although generic, the exact repair steps may vary depending on year, make, model and powertrain configuration.","\n ","OBD-II trouble code P2434 and related codes P2430, P2431, P2432, and P2433 are associated with the secondary air injection system air flow/pressure sensor circuit bank 1.","The purpose of the secondary air injection system air flow/pressure sensor circuit bank 1 is to reduce the amount of hydrocarbon exhaust emissions during engine start-up when the weather conditions are cold. The Power Control Module (PCM) activates the air pump to supply pressurized fresh air to accelerate the catalyst operation reducing the level of harmful exhaust gas. This process also allows the engine to reach the normal operating temperature faster. The air system pressure sensor is used to monitor pressure at the air control solenoid valve inlet to open and close the valve at predetermined temperatures and pressures based on the manufacturers' recommendations.","When the PCM detects voltage or resistance that is intermittent or erratic within the secondary air injection system air flow/pressure sensor circuit bank 1, code P2434 will be set and the check engine light may be illuminated.","If your engine has more than one bank of cylinders, bank 1 is the bank of cylinders that contains cylinder #1.","Secondary air injection components:\n"],"symptoms":["Engine may stall at idle\nEngine may not start\nSecondary air injection system making noise\nPoor engine performance\nCheck engine light illuminated"],"causes":["Defective secondary air injection pump\nFaulty one-way check valve\nDefective air control solenoid valve\nDefective air pressure sensor\nFaulty or damaged wiring\nCorroded, damaged or loose connector\nDefective PCM"]}