{"code":"P245A","description":"Exhaust Gas Recirculation Cooler Bypass Control Circuit /Open","info":["This is a generic powertrain diagnostic trouble code (DTC) and applies to many OBD-II vehicles (1996-newer). That may include but is not limited to vehicles from Ford, Dodge, Ram, Jeep, Chevrolet, Volkswagen, Mercedes, etc. Although generic, the exact repair steps may vary depending on year, make, model and powertrain configuration.","\n ","OBD-II trouble code P245A and related codes P245B, P245C, and P245D are associated with the Exhaust Gas Recirculation (EGR) cooler bypass control circuit.","The purpose of the EGR cooler bypass control circuit is to open and close the EGR bypass valve under predetermined conditions to prevent the EGR cooler from being overloaded known as fouling that effects the performance and efficiency of a diesel engine. The Engine Control Module (ECM) monitors the operation of this circuit by receiving voltage references from the EGR temperature switch and other associated components to operate the EGR cooler bypass valve returning the exhaust gases to the intake for combustion in most configurations. The location of the EGR bypass valve, EGR cooler, temperature switch and associated components are vehicle specific and vary tremendously determined by the manufacture.","When the ECM detects improper voltage or resistance within the exhaust gas recirculation cooler bypass control circuit, code P245A will be set and the check engine light, service engine soon light or both may be illuminated.","An ECG cooler bypass valve:\n"],"symptoms":["Engine may fail emissions test\nIgnition ping or knock on acceleration\nIncreased fuel consumption\nPoor engine performance\nService engine soon light illuminated\nCheck engine light illuminated"],"causes":["Defective EGR cooler bypass valve\nClogged or damaged EGR cooler\nTemperature switch malfunction\nExcessive carbon buildup\nFaulty or damaged wiring\nCorroded, damaged or loose connector\nDefective ECM"]}