{"code":"P245E","description":"Diesel Particulate Filter Pressure Sensor B Circuit","info":["This diagnostic trouble code (DTC) is a generic powertrain code, which means that it applies to all 1996-newer vehicles (Ford, Dodge, GMC, Chevrolet, Mercedes, VW, etc.). Although generic, the specific repair steps may vary depending on make/model.","If your vehicle is exhibiting a service engine soon indicator, accompanied by a code P245E, the powertrain control module (PCM) has detected a malfunction in the electrical circuit of the diesel particulate filter (DPF) pressure sensor that has been given the designation B. Obviously, this code should be presented only in vehicles that are powered by a diesel engine.","\n ","The DPF is designed to remove ninety-percent of carbon particles (soot) from diesel engine exhaust. Soot is most commonly associated with the black smoke that billows from the exhaust when a diesel engine is under heavy acceleration. The DPF is contained in a steel inline exhaust housing that resembles a muffler or catalytic converter. It is positioned ahead of the catalytic converter and/or the NOx trap. While large soot particles are trapped in the DPF element, small particles and other (exhaust gas) compounds are allowed to pass through. The DPF utilizes a wide variety of elemental compounds to trap soot and still allow engine exhaust to pass through. They include paper, metal fibers, ceramic fibers, silicone wall fibers, and cordierite wall fibers.","Cordierite is a type of ceramic based filtration and the most common type of fiber used in DPF applications. It is relatively inexpensive and possesses excellent filtration characteristics. Unfortunately Cordierite has issues with melting down at high temperatures, making it susceptible to malfunctions when used in passive DPF systems.","The heart of any DPF is the filtration element. As engine exhaust passes through the element, large particles of soot are trapped between the fibers. As soot is accumulated, exhaust pressure increases accordingly. After an adequate amount of soot is accumulated (and exhaust pressure has reached a programmed degree), the filtration element must be regenerated in order to allow spent exhaust gases to continue flowing through the DPF.","Active DPF systems are regenerated automatically. In other words, the PCM is programmed to inject chemicals (including but not limited to diesel fuel and diesel exhaust fluid) into the exhaust at programmed intervals. This action causes an increase in exhaust temperature and burns trapped soot particles; releasing them as ions of nitrogen and oxygen.","A similar process is used in passive DPF systems but requires input from the owner and (in some instances) a qualified repair facility. Once the regeneration procedure has been initiated, it may take hours to complete. Other passive regeneration systems require that the DPF be removed from the vehicle and serviced using a specialized machine that completes the process and disposes of soot particles appropriately. When soot particles are removed sufficiently, the DPF is considered regenerated and exhaust pressure should react accordingly.","In most cases, the DPF pressure sensor is mounted in the engine compartment, away from the DPF. It monitors exhaust back pressure before it enters the DPF. This is accomplished using (one or more) silicon hoses that are connected to the DPF (near the inlet) and the DPF pressure sensor.","When the PCM detects an exhaust pressure condition that doesn't coincide with manufacturer’s specifications, or an electrical input signal from the DPF pressure sensor B that exceeds programmed limitations, a code P245E will be stored and a service engine soon lamp illuminated.\n"],"symptoms":["Excessive black smoke from the exhaust\nDiminished engine performance\nHigher engine temperatures\nHigher transmission temperatures"],"causes":["Potential causes for this code to set are:","The diesel exhaust fluid reservoir is empty\nIncorrect diesel exhaust fluid\nDefective DPF pressure sensor\nClogged DPF pressure sensor tubes/hoses\nOpen or shorted circuit/s in the DPF pressure sensor B circuit\nInefficient DPF regeneration\nInoperative active DPF regeneration system"]}