{"code":"P2457","description":"Exhaust Gas Recirculation Cooling System Performance","info":["This diagnostic trouble code (DTC) is a generic powertrain code, which means that it applies to all 1996-newer vehicles (Ford, Dodge, GMC, Chevrolet, Mercedes, VW, etc.). Although generic, the specific repair steps may vary depending on make/model.","Should your OBD-II equipped vehicle exhibit a P2457, it means that the powertrain control module (PCM) has detected a possible malfunction in the exhaust gas recirculation (EGR) cooling system. This may be a mechanical issue or an electrical malfunction.","\n ","The EGR system is responsible for delivering a portion of spent exhaust gases back to the intake manifold so that it can be burned a second time. This process is necessary in order to reduce the number of nitrogen oxide (NOx) particles that are released into the atmosphere. NOx is a contributing component of ozone depleting exhaust emissions.","The need for EGR cooling systems is limited (to my knowledge) to diesel engine equipped vehicles. Engine coolant is used to reduce the temperature of engine exhaust gases before they are drawn into the EGR valve. An EGR temperature sensor provides the PCM with variations in exhaust gas temperature near the EGR valve. The PCM compares input signals from the EGR temperature sensor and an auxiliary exhaust temperature sensor to determine if the EGR cooling system is operating efficiently.","The EGR cooler typically resembles a small radiator (or heater core) with fins on the outside, a coolant inlet and outlet, as well as one or more exhaust pipe/s or tube/s through the center. Air flows across the fins to reduce the temperature of both the coolant (flowing around the outer diameter of the cooler) and the exhaust (flowing through the center of the cooler).","The auxiliary exhaust temperature sensor is usually positioned in the down pipe and the EGR temperature sensor is near the EGR valve. If the EGR temperature sensor input signal is not within programmed specifications, or if the EGR sensor input signal is not significantly lower than that of the auxiliary exhaust temperature sensor, a P2457 will be stored and a malfunction indicator lamp may be illuminated.\n"],"symptoms":["There may be no symptoms when this code is stored\nDiminished fuel efficiency\nA stored code\nMalfunction indicator lamp illumination\nCoolant leak\nExhaust leak\nExhaust temperature sensor codes"],"causes":["Potential causes for this code to set are:","Low engine coolant\nDefective EGR temperature sensor\nFaulty exhaust temperature sensor\nExhaust leaks\nClogged EGR cooler\nEngine overheating"]}