{"code":"P2459","description":"Diesel Particulate Filter Regeneration Frequency","info":["This diagnostic trouble code (DTC) is a generic powertrain code, which means that it applies to all 1996-newer vehicles (Ford, Dodge, GMC, Chevrolet, Mercedes, VW, etc.). Although generic, the specific repair steps may vary depending on make/model.","Encountering a stored P2459, lets me know that the powertrain control module (PCM) has detected a malfunction in the diesel particulate filter (DPF) regeneration system. The P2459 code indicates that the regeneration process has not been completed with the desired frequency, over a programmed period of time (or amount of miles/km). This code should only be exhibited in diesel powered vehicles.","\n ","DPF systems are designed to remove ninety-percent of carbon particles (soot) from diesel engine exhaust. They are critical in helping automakers meet federal guidelines for clean burning diesel vehicles. If you like the fact that modern diesel powered vehicles make far less smoke than their predecessors, you can thank DPF systems.","Most DPF systems function in a similar manner, even though there are several different designs. The DPF housing is a normally large steel muffler shaped device which contains a filtration element. Ideally, soot particles are trapped by the filtration element and exhaust gases are allowed to flow through and exit the tailpipe. Typically, the DPF contains wall fibers that attract larger soot particles as they enter the housing but some models use systems that contain a loose web assembly which fills virtually the entire housing. The ports in the filtration device are of a precise size so that larger soot particles are trapped and exhaust gases flow through.","When the filtration element is saturated with a certain degree of soot particles, it becomes partially clogged and exhaust pressure increases. The PCM uses a pressure sensor to monitor DPF back pressure. When back pressure reaches a particular level, the PCM activates the regeneration process for the filtration element. Temperatures inside the DPF must reach approximately 1,200-degrees Fahrenheit for the filtration element to be regenerated effectively. In most cases, a specialized injection system is used to accomplish this. An electronically controlled injection sprays a flammable chemical, such as diesel fuel or diesel exhaust fluid, into the DPF. After the fluid has been introduced, the trapped soot particles are incinerated and released into the atmosphere (via the tailpipe) as ions of nitrogen and water.","Systems which are activated automatically by the PCM as called active DPF systems. This process usually takes place while the vehicle is being driven. Systems that require input from the operator are referred to as passive systems. These systems are activated after the PCM has exhibited a cautionary warning and most of the process takes place while the vehicle is parked. The passive regeneration system procedure may take hours to complete. Consult your vehicle owner’s manual (or service manual) to see with which type of DPF system your vehicle is equipped.","If exhaust pressure fails to reach the desired level or if the PCM detects that the regeneration process has not occurred with the desired degree of regularity, a P2459 will be stored and a malfunction indicator lamp may be illuminated.\n"],"symptoms":["Excessive black smoke from the exhaust\nOther DPF codes usually accompany the P2459\nInability to maintain RPMs\nIncreased engine temperature\nOverheated DPR housing or other exhaust components"],"causes":["Potential causes for this code to set are:","Defective DPF pressure sensor\nFaulty exhaust pressure sensor\nInsufficient diesel exhaust fluid\nIncorrect diesel exhaust fluid\nShorted or open wiring to the DPF injection system\nDefective PCM or a PCM programming error"]}