{"code":"P2462","description":"Diesel Particulate Filter Pressure Sensor B Circuit Intermittent","info":["This diagnostic trouble code (DTC) is a generic powertrain code, which means that it applies to all 1996-newer vehicles (Ford, Dodge, GMC, Chevrolet, Mercedes, VW, etc.). Although generic, the specific repair steps may vary depending on make/model.","If a P2462 is stored, the powertrain control module (PCM) has detected a voltage input signal from the circuit of the diesel particulate filter (DPF) pressure sensor known as B, that is erratic or intermittent. P2462 is used exclusively in diesel equipped vehicles.","\n ","DPF systems are designed to remove ninety-percent of carbon particles (soot) from diesel engine exhaust. Large soot particles are trapped in the DPF element while smaller particles and other (exhaust gas) compounds are allowed to flow through.","At the nucleus of the DPF is the filtration element. Some of the elemental compounds currently being used in DPF construction include: paper fibers, metal fibers, ceramic fibers, silicone wall fibers, and cordierite wall fibers. Ceramic based cordierite is most common because of its excellent filtration. It is however known for overheating at higher temperatures, making it susceptible in vehicles equipped with passive DPF systems. Large particles of soot should be trapped between the fibers and engine exhaust is allowed to flow through. When there is a large concentration of soot particles in the element, exhaust pressure increases.","The filtration element must be regenerated once soot concentration has reached a certain level. Regeneration permits exhaust gases to flow through the DPF so that the correct level of exhaust back pressure can be maintained.","Automatically regenerated systems are known as active DPF systems. The PCM is programmed to inject chemicals (diesel fuel, diesel exhaust fluid, etc.) into the exhaust at scheduled intervals in this type of system. This injection produces increased exhaust temperatures, allowing trapped soot particles be incinerated as ions of nitrogen and oxygen.","Passive DPF systems are similar in theory. They are activated with input from the operator. A qualified repair facility will have to perform the regeneration procedure on some models. It could take several hours to accomplish DPF regeneration once it has begun.","While active regeneration systems are working as the vehicle is being driven, passive systems typically are activated when the vehicle is parked.","Once the filtration element is regenerated, exhaust pressure should return to a normal level. The DPF pressure sensor is typically mounted remotely; away from the excessive heat of the DPF. Exhaust back pressure is monitored using silicon hoses (connected near the DPF inlet and the DPF pressure sensor). If the PCM detects an exhaust pressure condition or an electrical input signal from DPF pressure sensor A that is intermittent or erratic, a code P2462 may be stored.\n"],"symptoms":["Reduced engine performance\nExcessive black smoke from engine exhaust\nAn increase in engine temperatures"],"causes":["Potential causes for this code to set are:","Exhaust leaks\nOpen/shorted circuit/s in the DPF pressure sensor B circuit\nDefective DPF pressure sensor\nClogged, cracked, or collapsed DPF pressure sensor tubes/hoses\nDiesel exhaust fluid reservoir empty\nIncorrect diesel exhaust fluid"]}