{"code":"P2460","description":"Diesel Particulate Filter Pressure Sensor B Circuit Low","info":["This diagnostic trouble code (DTC) is a generic powertrain code, which means that it applies to all 1996-newer vehicles (Ford, Dodge, GMC, Chevrolet, Mercedes, VW, etc.). Although generic, the specific repair steps may vary depending on make/model.","I have discovered that when a code P2460 is stored, the powertrain control module (PCM) has detected a low voltage input signal from the circuit of the diesel particulate filter (DPF) pressure sensor that has been given the designation B. Only vehicles equipped with diesel engines should exhibit this code.","\n ","Designed to remove ninety-percent of carbon particles (soot) from diesel engine exhaust, DPF systems are quickly becoming the norm in diesel powered vehicles. Diesel engines (especially under heavy acceleration) produce thick black smoke from the exhaust. It can be attributed to soot. The DPF usually resembles a muffler or catalytic converter, is mounted in a steel housing, and positioned before the catalytic converter (and/or the NOx trap). By design, large soot particles are trapped in the DPF element while smaller particles (and other exhaust gas compounds) are allowed to flow through.","Several elemental compounds are currently being used to trap large soot particles emitted from diesel engine exhaust. These may include: paper fibers, metal fibers, ceramic fibers, silicone wall fibers, and cordierite wall fibers. Ceramic based cordierite is the most common type of fiber used in DPF applications. Cordierite has excellent filtration characteristics and is inexpensive to manufacture. However, cordierite is known for having problems with overheating at higher temperatures, making it susceptible to malfunctions in vehicles equipped with passive DPF systems.","At the nucleus of any DPF is the filtration element. Large particles of soot are trapped between the fibers as engine exhaust is allowed to pass. As large soot particles are accumulated, exhaust pressure increases. After exhaust pressure has reached a programmed level the filtration element must be regenerated. Regeneration permits exhaust gases to continue flowing through the DPF and maintains the correct level of exhaust pressure.","Active DPF systems are regenerated automatically. In this type of system, the PCM is programmed to inject chemicals (including but not limited to diesel fuel and diesel exhaust fluid) into the DPF at programmed intervals. This electronically controlled injection causes an increase in exhaust temperature, allowing trapped soot particles to burn and be released as ions of nitrogen and oxygen.","Passive DPF systems are similar (in theory) but require some type of input from the operator. The regeneration procedure could take hours to accomplish once it has been initiated. Some vehicles require a qualified repair facility for the regeneration process. Other models are designed so that the DPF must be removed from the vehicle and serviced using a specialized machine that completes the process and disposes of the soot particles.","After the soot particles are sufficiently removed, the DPF is considered regenerated. Exhaust back pressure should return to an acceptable degree after regeneration.","The DPF pressure sensor is typically mounted in the engine compartment and away from the DPF. Exhaust back pressure is monitored by the sensor (as it enters the DPF) using silicon hoses (connected to the DPF and the DPF pressure sensor).","A code P2460 will be stored if the PCM detects an exhaust pressure condition that is lower than manufacturer’s specifications or an electrical input signal from DPF pressure sensor A which is lower than programmed limitations.\n"],"symptoms":["Increased engine temperatures\nHigher than normal transmission temperatures\nDiminished engine performance\nExcessive black smoke from the exhaust"],"causes":["Potential causes for this code to set are:","Exhaust leaks\nClogged DPF pressure sensor tubes/hoses\nOpen or shorted circuit/s in the DPF pressure sensor B circuit\nFaulty DPF pressure sensor"]}