{"code":"P2702","description":"Transmission Friction Element C Apply Time Range/Performance","info":["This is a generic powertrain diagnostic trouble code (DTC) and typically applies to OBD-II vehicles that have an automatic transmission. That may include but is not limited to vehicles from Chevrolet, GMC, Toyota, VW, Ford, Honda, Dodge, Chrysler, etc. Although generic, the exact repair steps may vary depending on year, make, model and powertrain configuration.","Transmission friction element. Pretty vague description given the fact that there are numerous friction elements involved when you consider the mechanical operation of an automatic transmission (A/T). Not to mention manual transmissions also use similar friction materials (i.e. clutch).","\n ","In this case, I suspect we are referring to an A/T. The symptoms and causes vary significantly depending on many things but it is important to note, the first thing to consider is the overall health of the automatic transmission and especially your ATF (Automatic Transmission Fluid).","Problems with internal friction materials in the A/T most likely will cause erratic driving conditions as far as shift timing, torque output, among countless other consequences to this fault are concerned. Abnormally paired tires, inadequately inflated tires, things of this nature tend to cause internal slippage given it's unsymmetrical circumstances. That being said, keep this in mind when considering the drivetrain's functionality and troubleshooting any faults. Install a used tire lately? Same size? Check the tire’s sidewall to verify this. Sometimes, minor differences can cause indirect issues such as this.","Typically, when the ECM (Engine Control Module) activates this P2702 code and related ones, it has proactively been monitoring and adjusting other sensors and systems in order to ensure proper self-diagnosis. So, rest assured, you need to address this before your daily driving needs consequently cause further potential issues. This may be a simple fix, definitely possible. That said, it may also be a complex internal electrical malfunction (i.e. short, open, water intrusion). Make sure to acquire help accordingly here, even pros make easily overlooked mistakes that costs thousands, speaking from experience here.","The letter in this case, \"C\", may refer to a few different possible distinction. You may be dealing with a specific circuit/wire or you may be dealing with a specific friction element within the transmission. Having said all that, always refer to your service manual for specific locations, distinctions, and other such specifications.","Code P2702 is logged by the ECM when it detects that the internal \"C\" friction element inside the transmission is experiencing a general problem with it's performance."],"symptoms":["Uneven handling\nTransmission slipping\nErratic shifting\nAbnormal shift patterns\nHarsh shift selection\nATF (Automatic Transmission Fluid) leak\nLow torque\nAbnormal power output"],"causes":[]}