{"code":"P2722","description":"Pressure Control Solenoid E Malfunction","info":["This is a generic transmission diagnostic trouble code (DTC) and typically applies to OBD-II vehicles equipped with an automatic transmission.","That may include but is not limited to vehicles from Nissan, Land Rover, Cadillac, Chevrolet, Chevy, Dodge, GMC, Mercedes Benz, VW, Audi, Pontiac, Saturn, Skoda, Honda, etc. Although generic, the exact repair steps may vary depending on year, make, model and powertrain configuration.","\n ","When the P2722 OBD-II trouble code is set, the Powertrain Control Module (PCM) has detected a problem with the Transmission Pressure Control Solenoid \"E\". Most automatic transmissions incorporate at least three solenoids that are solenoid A, B and C. However, for this DTC, the transmission contains at least 5 solenoids, A, B, C, D, and E. The trouble codes related to the \"E\" solenoid are codes P2722, P2723, P2724, P2725, and P2726. The code set is based on the specific malfunction that alerts the PCM and illuminates the Check Engine Light.","The purpose of the Transmission Pressure Control Solenoids is to control the pressure of the fluid for the proper operation of an automatic transmission. The PCM receives an electronic signal based on the pressure within the solenoids. An automatic transmission is controlled by bands and clutches that change gears by having fluid pressure in the right place at the right time. Based on the signals from associated devices monitoring the speed of the vehicle, the PCM controls the pressure solenoids to direct fluid at the appropriate pressure to various hydraulic circuits that change the transmission gear ratio at the correct time.","The code P2722 is set by the PCM when the Pressure Control Solenoid \"E\" is experiencing a general malfunction.","Example of a transmission pressure control solenoid:\n"],"symptoms":["Vehicle enters limp mode\nTransmission slips when shifting\nTransmission overheating\nTransmission catches in gear\nDecreased fuel economy\nPossibly misfire-like symptoms\nCheck Engine Light illuminated"],"causes":["Defective Pressure Control Solenoid\nDirty or contaminated fluid\nDirty or clogged transmission filter\nDefective Transmission Pump\nDefective Transmission Valve Body\nRestricted hydraulic passages\nCorroded or damaged connector\nFaulty or damaged wiring\nFaulty PCM"]}