{"code":"P2767","description":"Input/Turbine Speed Sensor \"B\" Circuit No Signal","info":["This diagnostic trouble code (DTC) is a generic powertrain code, which means that it applies to all 1996-newer vehicles (Ford, Honda, Mazda, Mercedes, VW, etc.). Although generic, the specific repair steps may vary depending on make/model.","When I run across a trouble code P2767, it is because the powertrain control module (PCM) has detected no voltage output from the circuit of the input (or turbine) speed sensor that has been given the designation \"B\". Input and turbine speed sensors are virtually identical in design, and serve the same purpose, but manufacturers use variations in terminology to describe them.","\n ","The input/turbine speed sensor is typically a 3-wire, electromagnetic sensor that is used to monitor transmission input speed (identified by the PCM as revolutions per minute or RPMs). The sensor is usually mounted with a bolt/stud or threaded directly into the transmission case. It is normally positioned near the rear of the bell housing (at the transmission input shaft)","Specially designed grooves (or a notched reluctor wheel) are permanently attached to the transmission main (or input) shaft. As RPMs are transferred from the engine to the transmission, the input shaft (or reluctor wheel) spins and passes in close proximity to the end of the sensor. The steel shaft (or reluctor wheel) completes an electronic/electromagnetic circuit. The circuit is interrupted as the grooved (or notched) areas pass by the sensor and an electronic pattern is formed. This pattern formation is received by the PCM as a waveform that it is programmed to interpret as transmission input/turbine speed.","In order to determine the desired input RPM speed, transmission input/turbine speed is compared with engine RPM speed, percentage of engine load, and transmission output speed. A code P2767 will be stored (and a malfunction lamp may be illuminated) if the actual input/turbine speed, or system circuit voltage, fail to coincide with the desired input/turbine speed or manufacturer’s specified voltage.\n"],"symptoms":["Intermittent or erratic speedometer (odometer) operation\nInability of the transmission to shift at all\nInoperative speedometer and/or odometer\nErratic or harsh transmission shift points\nA decrease in fuel efficiency"],"causes":["Potential causes for this code to set are:","A faulty input speed sensor B\nDamaged, loose, or shorted wiring and/or connectors in the circuit\nPCM failure or a PCM programming error"]}