{"code":"P2768","description":"Input/Turbine Speed Sensor \"B\" Circuit Intermittent","info":["This diagnostic trouble code (DTC) is a generic powertrain code, which means that it applies to all 1996-newer vehicles (Ford, Honda, Mazda, Mercedes, VW, etc.). Although generic, the specific repair steps may vary depending on make/model.","If you are presented with a trouble code P2768, it is likely because the powertrain control module (PCM) has detected an erratic voltage input signal from the circuit of the input (or turbine) speed sensor that has been given the designation \"B\". Although input and turbine speed sensors are virtually the same, and serve the same purpose, component terminology varies between manufacturers.","\n ","In most cases, the input/turbine speed sensor is a 3-wire, electromagnetic sensor used to monitor transmission input speed in revolutions per minute (RPM). The sensor is usually positioned near the rear of the bell housing (at the transmission input shaft) and mounted with a bolt/stud or threaded directly into the transmission case.","Either a notched reluctor wheel or specially designed grooves are permanently attached to the transmission main (or input) shaft. As the running engine transfers RPMs to the transmission, the input shaft (or reluctor wheel) passes close to the end of the sensor. The steel shaft (or reluctor wheel) effectively completes an electronic/electromagnetic circuit with the sensor. An electronic pattern is formed when the circuit is interrupted by the grooved (or notched) areas passing by the sensor. The pattern is recognized by the PCM as a waveform that it is programmed to interpret as transmission input/turbine speed.","Transmission output speed, transmission input/turbine speed, engine speed, throttle position, percentage of engine load, and other factors are compared and calculated to determine the desired input/turbine RPM speed. A code P2768 will be stored (and a malfunction lamp may be illuminated) if the input/turbine speed, or system circuit voltage, fail to remain accurate within a predetermined degree for a specific amount of time.","The P2768 indicates an intermittent input circuit voltage for the input/turbine speed sensor.\n"],"symptoms":["Erratic speedometer (odometer) operation\nThe transmission fails to shift properly\nSpeedometer and/or odometer will not operate at all\nTransmission shift points are erratic or harsh\nDiminished fuel efficiency"],"causes":["Potential causes for this code to set are:","Defective input speed sensor B\nDamaged, loose, or burnt wiring and/or connectors\nPCM failure or a PCM programming error\nAccumulation of metal debris on the magnetic sensor"]}