{"code":"P2765","description":"Input/Turbine Speed Sensor \"A\" Circuit","info":["This diagnostic trouble code (DTC) is a generic powertrain code, which means that it applies to all 1996-newer vehicles (Ford, Honda, Mazda, Mercedes, VW, etc.).","Although generic, the specific repair steps may vary depending on make/model.","\n ","When I have encountered a diagnostic trouble code P2765, it has been due to the powertrain control module (PCM) detecting a malfunction in the circuit for the designated input (or turbine) speed sensor known as \"B\". Input and turbine speed sensors are virtually identical in design. The difference is primarily with the descriptive terminology. The A designation is typically reserved for OBD-II equipped vehicles that use multiple input or turbine speed sensors. Consult the manufacturer’s service manual for the location of the input/turbine sensor designated A.","The input/turbine speed sensor is usually an electromagnetic, 3-wire sensor used to monitor transmission input speed (recognized by the PCM as revolutions per minute or RPMs). The sensor is positioned near the rear of the torque converter (at the transmission input shaft) and is either mounted with a bolt/stud or threaded directly into the transmission case.","On the transmission main (or input) shaft, specially designed grooves (or a notched reluctor wheel) are present. The input shaft (or reluctor wheel) passes in close proximity to the end of the sensor; completing the electromagnetic circuit. As the grooves (or notches) pass by the sensor, the circuit is interrupted and an electronic pattern is formed. This pattern formation is received by the PCM as a waveform pattern that it further interprets as transmission input/turbine speed.","Transmission input/turbine speed is compared with engine RPM speed, percentage of engine load, transmission output speed, and vehicle speed to determine the desired input speed RPM. If the actual input/turbine speed fails to coincide with the desired input/turbine speed, a code will be stored and a malfunction lamp may be illuminated.\n"],"symptoms":["Harsh or erratic transmission shift points\nFailure of the transmission to shift\nDecreased fuel efficiency\nSpeedometer (odometer) fluctuation\nLack of speedometer (odometer) operation\nIn some cases, when coming to a stop the engine may stall"],"causes":["Potential causes for this code to set are:","Defective input speed sensor B\nFaulty output speed sensor B\nDamaged, worn, or broken reluctor ring or shaft\nBad transmission torque converter\nLoose, burned, or otherwise damaged wiring and/or connectors\nPCM failure or programming error"]}