{"code":"P0411","description":"Secondary Air Injection System Incorrect Flow Detected","info":["This diagnostic trouble code (DTC) is a generic powertrain code, which means that it applies to OBD-II equipped vehicles. Although generic, the specific repair steps may vary depending on make/model.","Secondary Air Injection is an emission control that uses an air pump (either electric or turned by the drive belt) to move fresh air into the exhaust manifold(s) or exhaust ports when the engine is in open loop and pre-catalytic converter when in closed loop. This reduces hydrocarbon emissions (HC), Carbon Monoxide (CO), and oxides of Nitrogen (NOx). This fresh air helps convert Carbon Monoxide (CO) into Carbon Dioxide (CO2) and Hydrocarbons (HC) into water vapor (H20).","\n ","A check valve is located in the air supply line to keep exhaust gasses from flowing into the pump. A cutoff valve that controls the airflow may be vacuum controlled or electrically controlled. When the powertrain control module (PCM) activates the valve, vacuum travels to the cutoff valve to open it and allow fresh air to flow. Some systems may have only a check valve and the flow may be regulated by a electromagnetic clutch on the air pump (similar to an A/C clutch).","Under hard acceleration, the air pump will be deactivated to prevent backfiring in the exhaust. To self-check, the AIR system will be activated by the PCM and fresh air would be routed into the exhaust system. The oxygen sensors would sense this fresh air as a lean condition and the short term fuel trims would begin to move in the positive direction to compensate. The PCM expects to see this happen within just a few seconds during the self test. If it does not see the short term fuel trims rise, then the PCM interprets this as a malfunction in the AIR system and a code will be recorded.","Other secondary air injection system trouble codes include P0410, P0412, P0413, P0414, P0415, P0416, P0417, P0418, P0419, P041F, P044F, P0491, and P0492."],"symptoms":["MIL (Malfunction Indicator Lamp) illumination\nBackfiring in the exhaust under hard acceleration\nEngine running rich (This is counter-intuitive. See explanation below)\nSquealing belt"],"causes":["Potential causes of a P0411 code include:","Damaged or missing check valve\nAIR pump intake port plugged/damaged\nAIR pump clutch malfunction\nHoles or damage to exhaust components"],"type":"ERR"}