{"code":"P0414","description":"Secondary Air Injection System Switching Valve A Circuit Shorted","info":["This diagnostic trouble code (DTC) is a generic powertrain code, which means that it applies to OBD-II equipped vehicles (Dodge, Ram, Ford, GMC, Chevrolet, VW, Toyota, etc.). Although generic, the specific repair steps may vary depending on make/model.","A stored code P0414, simply means that the powertrain control module (PCM) has detected a short in a secondary air injection (SAI) system switching valve circuit. This particular switching valve has been given the designation A and refers to a particular switching valve in a system that uses multiple switching valves, or the only valve if there is a single valve system. A shorted circuit could mean that the effected circuit has come into contact with an unexpected voltage signal or a ground. A shorted circuit will usually result in a blown fuse.","\n ","The SAI system pumps ambient air into the engine exhaust system as a method of reducing harmful exhaust emissions. Automotive SAI systems use either a belt driven pump or an electric pump to draw-in ambient air, compress it slightly, and inject the pressurized air into the engine exhaust manifolds. One-way valves, switching valves, anti-backfire valves, and bypass valves (controlled by the PCM) are used to regulate and distribute air pressure and protect the SAI air pump.","The PCM receives voltage input signals from pressure sensors to monitor fluctuations in SAI system pressure. When appropriate conditions are met, the PCM electronically opens the necessary valves and allows secondary air to be pumped into the exhaust system. The PCM monitors SAI pressure sensors and activates the pump when required in vehicles that are equipped with electric pumps.","If the PCM detects a voltage input signal from the SAI switching valve (designated as A) circuit that is indicative of a short (to voltage or ground), a code P0414 will be stored and a malfunction indicator lamp may be illuminated.","Other secondary air injection system trouble codes include P0410, P0411, P0412, P0413, P0415, P0416, P0417, P0418, P0419, P041F, P044F, P0491, and P0492.\n"],"symptoms":["Constant SAI pump activation (short to voltage)\nNo SAI pump activation (short to ground with a blown fuse)\nLoud whining from SAI pump"],"causes":["Potential causes for this code to set are:","Shorted wiring, components, and/or connectors in the SAI system\nShorted SAI pump"],"type":"ERR"}