{"code":"P0420","description":"Catalyst System Efficiency Below Threshold (Bank 1)","info":["This diagnostic trouble code (DTC) is a generic powertrain code. It is considered generic because it applies to all makes and models of vehicles (1996-newer), although specific repair steps may be slightly different depending on the model. So this engine code article applies to Nissan, Toyota, Chevrolet, Ford, Honda, GMC, Subaru, VW, etc.","P0420 is one of the more common trouble codes that we see. Other popular codes include P0171, P0300, P0455, P0442, etc. So be sure to bookmark this site for future reference!","The catalytic converter has an oxygen sensor in front and behind it. When the vehicle is warm and running in closed loop mode, the upstream oxygen sensor waveform reading should fluctuate. The downstream O2 sensor reading should be fairly steady. Typically the P0420 code triggers the Check Engine Light if the readings of the two sensors are similar. Oxygen sensors are also referred to as O2 sensors.","This is indicative of (among other things) a converter that is not working as efficiently as it should be (according to specs). Catalytic converters are not normally a \"wear\" type item, that is they are not designed to wear out and need replacement. If they have failed, it is likely due to something else that caused it to fail. This is what a P0420 means in simplified terms."],"symptoms":["The main symptom to the driver is the illumination of the MIL (malfunction indicator lamp). You will likely not notice any drivability problems, although there may be symptoms. For example, if the substance inside the catalytic converter is broken or failed, it may be restricting the exhaust which will result in a feeling of reduced power output from the vehicle."],"causes":["A code P0420 may mean that one or more of the following has happened:","Leaded fuel was used where unleaded was called for (unlikely)\nA damaged or failed oxygen / O2 sensor\nDownstream oxygen sensor (HO2S) wiring damaged or connected improperly\nThe engine coolant temperature sensor is not working properly\nDamaged or leaking exhaust manifold / catalytic converter / muffler / exhaust pipe\nFailed or underperforming catalytic converter (likely)\nRetarded spark timing\nThe oxygen sensors in front and behind the converter are reporting too similar of readings\nLeaking fuel injector or high fuel pressure\nCylinder misfire\nOil contamination"],"type":"ERR"}