{"code":"P042F","description":"Exhaust Gas Recirculation A Control Stuck Closed","info":["This is a generic powertrain diagnostic trouble code (DTC) and applies to OBD-II vehicles. That may include but is not limited to vehicles from Ford, Chevrolet / GM / Cummins, Dodge / Ram, Isuzu, Pontiac, Toyota, BMW, Mercedes, etc. Although generic, the exact repair steps may vary depending on year, make, model and powertrain configuration.","If your vehicle has stored a code P042F, it means that the powertrain control module (PCM) has detected a problem with the exhaust gas recirculation (EGR) valve control system.","\n ","In the case of the P042F, the valve appears (to the PCM) to be stuck in the closed position. The designation A applies to a particular position or stage of the step-down EGR valve control system, which is explained below.","The EGR system is responsible for allowing the engine to consume a portion of the unburned fuel from the exhaust system. The EGR system is necessary to reduce harmful levels of nitrogen oxide (NOx) created as a side effect of gasoline and diesel engine operation.","The focal point of the EGR system is an electronically controlled (EGR) valve which opens to allow exhaust gases to re-enter the engine intake. The PCM uses input signals from the throttle position sensor (TPS), vehicle speed sensor (VSS), and the crankshaft position sensor (CKP), to determine when conditions are right to open/close the EGR valve.","Vehicles which exhibit this type of code are equipped with a step-down EGR valve. The step-down EGR valve operates in stages according to the degree which the throttle is opened, how much load is placed on the engine, and how fast the vehicle is moving.","In some models, the position of the EGR valve plunger is also monitored by the PCM. If the desired position of the EGR valve (as commanded by the PCM) is different from the actual position, a code P042F will be stored and a malfunction indicator lamp (MIL) may be illuminated. Other vehicles utilize data contrived from the manifold air pressure (MAP) sensor and/or the differential pressure feedback EGR (DPFE) sensor to determine whether the EGR valve is in the desired position (or not). Most vehicles will require multiple ignition cycles (with a failure) before MIL illumination will occur."],"symptoms":["There will likely be no symptoms exhibited with this code\nSlightly diminished fuel efficiency"],"causes":["Defective EGR valve\nEGR control solenoid/valve is bad\nOpen or shorted wiring/connectors in the EGR control circuit\nFaulty DPFE sensor\nBad EGR valve position sensor\nPCM malfunction or PCM programming error"],"type":"ERR"}