{"code":"P043F","description":"Evaporative Emission System Leak Detection Reference Orifice High Flow","info":["This is a generic diagnostic trouble code (DTC) that typically applies to OBD-II vehicles that have an EVAP system which use a leak detection system. That may include but is not limited to vehicles from Toyota, Scion, GM, Chevrolet, Hyundai, Pontiac, Volvo, etc. Anecdotally this code seems to be much more commonly seen on Toyota brand vehicles. Although generic, the exact repair steps may vary depending on year, make, model and powertrain configuration.","\n ","The PCM has detected a discrepancy in the evaporative emissions system (EVAP) leak detection reference orifice when a code P043F is stored in your OBD-II vehicle. In this case, a high flow condition has been indicated.","The EVAP system is designed to capture fuel vapors (from the fuel tank) before they escape into the atmosphere. The EVAP system utilizes a vented reservoir (usually called a canister) to store excessive vapors until the engine is being operated under the appropriate conditions to burn them most effectively.","The pressure (developed when fuel is stored) acts as the propellant, causing the vapors to vent through the tubes and eventually into the canister. A charcoal element, contained in the canister, absorbs fuel vapors and holds them for release at the appropriate time.","Assorted sample orifices, a leak detection pump, a charcoal canister, the EVAP pressure sensor, the purge valve/solenoid, the vent control valve/solenoid, and a complex system of metal tubes and rubber hoses (stretching from the fuel tank to the engine compartment) are typical components of the EVAP system.","Engine vacuum is used by the EVAP system to draw fuel vapors (from the charcoal canister and through the lines) into the intake manifold where they can be burned instead of being vented into the atmosphere. The PCM electronically controls the purge control valve/solenoid which is the gateway of the EVAP system. It is responsible for regulating intake vacuum to the EVAP canister so that fuel vapors may be drawn into the engine only when conditions are ideal for fuel pressure vapors to be burned most effectively.","Some EVAP systems utilize an electronic leak detection pump to build pressure within the system, so that the system can be tested for leaks/flow. Leak detection reference orifices may be placed at either a single point or in multiple points throughout the EVAP system. Leak detection reference orifices are typically of the in-line variety so that an accurate degree of flow can be measured with the leak detection pump activated. The PCM uses input signals from EVAP pressure and flow sensors, in conjunction with the leak detection reference orifice/s, to determine if the leak detection system is functioning properly. The EVAP leak detection reference orifice may be a small filter type device or simply an area of the EVAP line which restricts flow in order for an EVAP pressure/flow sensor to obtain an accurate sample.","If the PCM detects a high flow condition through the EVAP leak detection reference orifice, a code P043F will be stored and a malfunction indicator lamp (MIL) may be illuminated."],"symptoms":["No symptoms will likely be exhibited\nHissing or humming sound (even when the ignition switch OFF)\nSlightly diminished fuel efficiency\nOther EVAP leak detection codes may be stored"],"causes":["Defective EVAP pressure sensor\nFaulty vent control or purge control solenoid\nBad leak detection pump"],"type":"WARN"}