{"code":"P0434","description":"Heated Catalyst Temperature Below Threshold (Bank 1)","info":["This diagnostic trouble code (DTC) is a generic powertrain code, which means that it applies to OBD-II equipped vehicles (Dodge, Ram, Ford, GMC, Chevrolet, VW, Audi, Toyota, etc.). Although generic, the specific repair steps may vary depending on make/model.","When I have diagnosed a code P0434, I have found that the powertrain control module (PCM) has detected a problem with the temperature of the heated catalytic converter for engine bank two. Bank 2 indicates that the malfunction has occurred in the bank of the engine which does not contain the #1 cylinder.","\n ","Although I cannot state with absolute certainty that a code P0434 is only applicable to diesel powered vehicles; I have never seen it exhibited in anything other than diesel powered vehicles.","Heated catalytic converters are used to reduce exhaust emissions produced by diesel fueled engines. A filtration block, composed of ceramic fibers interwoven with platinum and other precious metals, enclosed in an inline steel housing and placed in the exhaust system, is the key component of the heated catalytic converter. Beyond the heat created as a side effect of engine exhaust, diesel engine exhaust must frequently be heated further in order to sufficiently reduce nitrogen oxide (N2O) particles, carbon monoxide, and unburned hydrocarbons into harmless ions of nitrogen, oxygen, carbon dioxide, and water. Temperatures inside the heated catalytic converter are often designed to reach a minimum of 1,200-degrees Fahrenheit. In order to produce the extreme temperatures needed to reduce diesel engine emissions, diesel exhaust fluid is injected into the heated catalytic converter in intervals controlled by the PCM.","Upstream and downstream exhaust temperature sensors are used by the PCM to monitor the heated catalytic converter threshold. This is necessary to ensure that the filtration element (catalyst) is being heated sufficiently.","Exhaust gases are pushed through the manifold, into the exhaust pipe, over the upstream exhaust temperature sensor, and through the heated catalytic converter. After they pass through the heated catalytic converter, they flow across the downstream exhaust temperature sensor. The PCM is programmed with specific minimum requirements regarding the temperature differential between exhaust gases entering the catalytic converter and exhaust gases exiting the catalytic converter. These programmed requirements are referred to here as the heated catalyst temperature threshold.","If heated catalyst temperature variation (between the upstream and downstream exhaust temperature sensors) is less than the minimum allowable threshold, a code P0434 will be stored and a malfunction indicator lamp (MIL) may be illuminated.","Other bank 2 catalyst efficiency trouble codes include P0430, P0431, P0432, P0433, P0435, P0436, P0437, P0438, and P0439.\n"],"symptoms":["Decreased fuel efficiency\nA lack of general engine performance\nExcessive black smoke from exhaust\nOther related diagnostic trouble codes\nMIL (malfunction indicator lamp) illumination"],"causes":["Potential causes for this code to set are:","Malfunctioning diesel exhaust fluid injection system\nInadequate diesel exhaust fluid\nDefective exhaust temperature sensor/s\nBurnt, broken, or disconnected wiring and/or connectors"],"type":"ERR"}