{"code":"P0452","description":"Generic: Evaporative Emission System Pressure Sensor/Switch Low\nFord: FTP Sensor Circuit Low Conditions\nGM: Fuel Tank Pressure Sensor Circuit Low Input Conditions\nNissan: Evaporative emission (EVAP) canister purge system - pressure sensor malfunction","info":["This diagnostic trouble code (DTC) is a generic powertrain code. It is considered generic because it applies to all makes and models of vehicles (1996-newer), although specific repair steps may be slightly different depending on the model.","The DTC P0452 is relates to an emission system malfunction. Your PCM or powertrain management computer relies on a fuel tank pressure sensor to detect fluctuations in the tanks internal pressure.","\n ","Depending on the make of your car, the sensor could be located in the fuel purge line coming off the fuel module on the top of the fuel tank or in the top of the tank itself.","The PCM has determined that the system pressure is unusually low indicating a problem in the system, not necessarily just at the sensor. This sensor is used primarily for emission control strategy only. Your fuel tank will have a tendency to build fuel vapor pressure when the temperatures are high and a vacuum when under a load.","The sensor sends a voltage to the computer for analysis, the value of the current is dependent on the pressure or vacuum. The code relates to all vehicles, however they differ in the sensor output. For instance, Buick's sensor produces about 0.1 volt with positive pressure in the tank and up to 5 volts with negative pressure, as in a vacuum.","A Honda's sensor increases the voltage signal as positive pressure builds in the tank. Either way, the sensors serve the same purpose. They all convert pressure to a voltage that increases or decreases with pressure or vacuum decay.","Related evaporative emission trouble codes include P0450, P0451, P0453, P0454, P0455, P0456, P0457, P0458, and P0459."],"symptoms":["The only symptom you will notice with a P0452 code is the service engine soon or check engine light will illuminate. In rare cases you may smell a noticeable fuel vapor."],"causes":["Potential causes for this DTC include:","Failed fuel tank pressure sensor\nHarness to the sensor has an open or short circuit\nFaulty electrical connection to the FTP sensor\nCracked or broken vapor line to the vacuum canister\nCracked or broken positive vapor line to the tank\nPlugged line\nLeaky gasket at the fuel pump module\nGas cap left loose resulting in a loss of vacuum\nPinched vapor line"],"type":"WARN"}