{"code":"P0457","description":"Evaporative Emission Control System (EVAP) Leak Detected","info":["This is a generic powertrain code, which means it covers all makes/models, 1996-newer. However, specific troubleshooting steps will vary depending on the vehicle.","Diagnostic trouble code (DTC) P0457 relates to a vacuum leak in the evaporative emission system used to prevent fuel vapor leaks into the atmosphere. Codes P0456 and P0455 are similar codes that refer to the degree of vacuum leaks from smallest to largest. The correction is similar in all circumstances.","\n ","This code doesn't cause driveability problems, but should be corrected as soon as possible. This code states that a vacuum leak is present that compromises the evaporative emission system operation.","Automobiles require two types of controls over emissions -- passive and active. The active portion relates to the fuel ratio control and the catalytic converter's ability to convert carbon monoxide, oxides of nitrogen and hydrocarbons into harmless water and carbon dioxide.","The passive relates to this P0457 code. Fuel vapor accounts for 20 percent of the harmful emissions through evaporation. To prevent these vapors from entering the atmosphere they are contained within the fuel system and re-enter the engine via the intake manifold.","The evaporative emission system consists of the fuel tank, a vacuum hose to the charcoal canister for containing the fuel vapors, pressure sensor on the fuel tank, purge valve on the charcoal canister, vacuum hose to the filler neck shut off valve and vacuum hose from the charcoal canister purge valve to the intake manifold.","When the engine is off, the vent shutoff valve and canister purge valve are closed. The fuel can't escape into the atmosphere. When the engine starts, the purge valve on the canister opens to allow the trapped fuel vapor to be drawn by engine vacuum into the intake manifold. At the same time the vent shutoff valve also opens to allow a small amount of air to enter the canister and mix with the fuel vapor for a better mixture. Once vented and the pressure sensor in the tank shows a significant drop, both valves close sealing the system once again.","A major leak exists preventing the system from being drawn into a vacuum necessary to draw the fuel vapors into the engine to be burned.","Related evaporative emission trouble codes include P0450, P0451, P0452, P0453, P0454, P0455, P0456, P0458, and P0459."],"symptoms":["The symptoms of a P0457 code will vary depending on the component or system causing the disruption in the fuel trim. Not all will be present simultaneously.","Malfunction Indicator Lamp (MIL) illumination with P0457 DTC set\nThere may be an occasional smell of fuel\nFuel economy is effected as fuel is allowed to evaporate into the atmosphere"],"causes":["The causes for this DTC may include:","This code relates to a large leak. The most common cause is the gas cap. Either it was left loose, is cracked, lost or has a foreign object or dirt on the threads preventing a good seal.\nIf the gas cap is not the cause, a hose may have rotted and cracked or possibly come off. The system is not subjected to abuse of any kind, so age and weather may be to blame.\nThe vacuum canister may have cracked"],"type":"ERR"}