{"code":"P046B","description":"Catalyst Temperature Sensor 1/2 Correlation (Bank 2)","info":["This is a generic transmission diagnostic trouble code (DTC) and applies to OBD-II vehicles with a catalyst temperature sensor. That may include but is not limited to vehicles from Dodge, Ford, Chevrolet, Dodge, Ram, etc. Although generic, the exact repair steps may vary depending on year, make, model and powertrain configuration.","\n ","When an OBD-II equipped vehicle has stored a code P046B, it means that the powertrain control module (PCM) has detected a discrepancy between the temperature signals from the catalytic converter of engine bank two. (Bank 2) denotes the bank of the engine which does not contain the number one cylinder. So far as I know, only diesel applications utilize catalyst temperature sensors.","Clean burning diesel vehicles require various types of diesel exhaust injections to clear the catalytic converter of harmful emissions. Diesel exhaust fluid (DEF) is injected into the catalytic converter in order to elevate the temperature of the catalyst and burn the nitrogen oxide particles trapped within. These vehicles utilize catalyst temperature sensors (as opposed to oxygen sensors) to monitor catalytic converter efficiency. Using temperature to monitor catalyst efficiency is the most accurate and practical method.","Sensor 1 and Sensor 2 might also be called the upstream and downstream catalyst temperature sensors, respectively. The sensors are typically placed just before and immediately after the catalytic converter in the exhaust system. When the engine is running and warmed up sufficiently, exhaust entering the catalytic converter should be notably cooler than exhaust that is exiting the converter. This is true regardless of the state of the DEF system. The PCM monitors the catalyst temperature sensors constantly and compares the two sensor signals. If the degree of variation between the two is not within a programmed amount, a code P046B will be stored and a malfunction indicator lamp (MIL) may also be illuminated."],"symptoms":["There may be no symptoms with this code\nHeavy black smoke from exhaust (more than usual)\nOther DEF and catalytic converter codes\nReduced fuel efficiency\nIncreased exhaust emissions"],"causes":["Defective exhaust temperature sensor\nBad catalytic converter\nDEF system malfunction\nBurned or otherwise open/shorted circuits in the exhaust temperature sensor system"],"type":"ERR"}