{"code":"P0463","description":"Fuel Level Sensor Circuit High Input","info":["This diagnostic trouble code (DTC) is a generic powertrain code, which means that is applies to OBD-II equipped vehicles. Although generic, the specific repair steps may vary depending on make/model.","The fuel level sensor (sender) is located in the fuel tank usually integral to the fuel pump module. Usually they cannot be replaced without replacing the fuel pump module, though there are exceptions. There is a float attached to an arm that travels along a resistor which is grounded to the tank, frame or has a dedicated ground circuit. Voltage is supplied to the sender and the ground path changes according to fuel level. How much voltage depends on the system but 5 volts isn't uncommon.","\n ","As the fuel level changes, the float moves the arm and changes the resistance to ground which varies the voltage signal. This signal may travel to a fuel pump computer module or directly to the instrument cluster module. Depending on the system, the fuel pump computer module may only monitor the resistance to ground and then relay the fuel level information to the instrument panel. If the fuel level signal to the fuel pump module (or instrument cluster module or PCM (powertrain control module)) goes above 5 volts for a specific amount of time, then the module that is monitoring the fuel level circuit will record this fault code.","Related fuel level sensor circuit trouble codes include:","P0460 Fuel Level Sensor Circuit Malfunction\nP0461 Fuel Level Sensor Circuit Range/Performance\nP0462 Fuel Level Sensor Circuit Low Input\nP0464 Fuel Level Sensor Circuit Intermittent"],"symptoms":["Mil (Malfunction indicator lamp) illumination\nFuel level gauge may fluctuate abnormally or read empty or full\nFuel light may illuminate and sound alarm"],"causes":["Potential causes of a P0463 code include:","The signal circuit to the fuel sender is open or shorted to B+ (Battery voltage)\nThe ground circuit is open, or ground path may have high resistance due to rust or missing ground strap on fuel tank\nDamage to the fuel tank could cause problem in fuel level circuit\nThere's an open in the fuel lever sensor's resistor to ground\nPossibly faulty instrument cluster\nLess likely is the possibility that the PCM, BCM, or Fuel pump computer module has failed"],"type":"WARN"}