{"code":"P0460","description":"Fuel Level Sensor Circuit Malfunction","info":["This generic powertrain/engine diagnostic trouble code typically applies to all OBDII equipped engines, but shows up more often in certain Chrysler, GM, Ford, Lincoln, Mercury, Kia, Mazda, Mercedes Benz, Infiniti, Nissan and Subaru vehicles.","The Fuel Level Sensor (FLS) is usually found mounted in the fuel tank, usually in the top of the fuel tank / fuel pump module. The FLS converts the mechanical fuel level into an electrical signal for the Powertrain Control Module (PCM). Typically, the PCM will then inform other controllers utilizing the vehicle’s data communication bus.","\n ","The PCM receives this voltage signal to determine how much fuel it has in the fuel tank, monitoring fuel usage and thereby determining fuel economy. This code is set if this input does not match normal operating voltages stored in the PCM’s memory. It also looks at the voltage signal from the FLS sensor to determine if it is correct at initial Key On.","P0460 could have been set because of mechanical (incorrect fuel level rationality; refueling the vehicle with the ignition switch \"on\" or even engine running can do this. Fuel level changes too rapidly which is not normal) or electrical (FLS sensor circuit) issues. These cannot be overlooked in the troubleshooting stage, especially when dealing with an intermittent problem.","Troubleshooting steps may vary depending upon manufacturer, type of FLS sensor and wire colors.","Related fuel level sensor circuit trouble codes include:","P0461 Fuel Level Sensor Circuit Range/Performance\nP0462 Fuel Level Sensor Circuit Low Input\nP0463 Fuel Level Sensor Circuit High Input\nP0464 Fuel Level Sensor Circuit Intermittent"],"symptoms":["Malfunction Indicator Lamp (MIL) illuminated\nDecrease in perceived fuel economy\nDecrease in Distance to Empty mileage\nIncorrect fuel level on gauge in instrument cluster – always reads wrong"],"causes":["Typically the causes for this code to set are:","Open in the signal circuit to the FLS sensor - possible\nShort to voltage in the signal circuit to the FLS sensor- possible\nShort to ground in the signal circuit to the FLS sensor- possible\nFailed FLS Sensor / sensing arm stuck mechanically - likely\nFailed PCM - unlikely"],"type":"ERR"}