{"code":"P0482","description":"Cooling Fan Relay 2 Control Circuit","info":["This is a generic powertrain diagnostic trouble code (DTC), which means it covers all makes/models, 1996-newer. However, specific troubleshooting steps will vary depending on the vehicle.","If your vehicle's check engine light comes on and after pulling the code you find a P0482 displayed, if refers to the engine cooling fan circuit. It is a generic code applying to all OBD II (on board diagnostics) vehicles.","\n ","While you are driving, air in sufficient quantity is passing through the radiator effectively cooling the engine. When you bring the car to a stop no air is passing through the radiator and the engine begins to increase in temperature.","The PCM (powertrain control module) senses the increase in engine temperature through the CTS (coolant temperature sensor) located near the thermostat. When the temperature reaches about 223-degrees F (value depends on make/model/engine), the PCM will command the cooling fan relay to turn on the fan. It does so by supplying the ground to the relay.","There is a problem within this circuit causing the fan to fail to operate allowing the engine to overheat while sitting still or driving at a slow speed. When the PCM attempts to activate the fan and senses the command and the result do not match, the code is set.","NOTE: P0482 speaks of the basic circuit, however codes P0480 and P0481 relate to the same problem with the only difference is they relate to the different fan speed relays."],"symptoms":["Check engine light (malfunction indicator lamp) illumination and code P0482 set\nEngine temperature will rise when the vehicle stops and idles"],"causes":["The causes for this DTC may include:","Faulty fan control relay 3\nFan control relay harness is open or shorted\nCircuit electrical connections poor\nFaulty cooling fan 3\nFaulty coolant temperature sensor\nFan cooling fan harness is open or shorted\nCooling fan circuit poor electrical connection\nIntake air temperature (IAT) failure\nA/C selector switch\nA/C refrigerant pressure sensor\nVehicle speed sensor (VSS)"],"type":"ERR"}