{"code":"P0489","description":"Exhaust Gas Recirculation \"A\" Control Circuit Low","info":["This is a generic powertrain code, which means it covers all makes/models, 1996-newer. However, specific troubleshooting steps will vary depending on the vehicle.","These engine trouble codes refer to a failure in the EGR (exhaust gas recirculation) system. To be more specific -- the electrical aspect. The EGR is an integral part of the vehicles emission system whose function is to prevent the formation of harmful Nox (oxides of nitrogen) from forming in the cylinders.","\n ","The EGR is operated by the engine management computer. The computer opens or closes the EGR as load, speed and temperature dictate in order to maintain the proper cylinder head temperature. There are two wires to the electrical solenoid on the EGR with which the computer activates it. A potentiometer is also located in the EGR solenoid that signals the position of the EGRs pintle (operating mechanism that opens and closes the passage.)","This works much like dimming your lights in the home. As the switch is turned the lights get brighter as you increase the voltage. Your engine computer fails to see any voltage change as it attempts to open or close the EGR indicating it is stuck in one position. Codes P0489 EGR control circuit \"A\" means no low voltage change to indicate the EGR is opening or closing. P0490 is basically identical but it means circuit high as opposed to low.","Unleaded fuel is prone to producing Nox when under extreme temperatures in the engine's cylinders. The EGR routes a regulated amount of exhaust gas back into the intake manifold. The purpose is to dilute the incoming fuel mixture sufficiently to reduce the cylinder head temperature below that at which Nox forms.","EGR operation is essential for more reasons than preventing Nox emissions -- it allows more advanced timing for more power without detonation, and a leaner fuel mixture for better fuel economy."],"symptoms":["Extremely rough running engine\nCheck engine light illuminated\nDrop in fuel economy\nDecrease in power\nNo start or very difficult to start followed by rough idle"],"causes":["The causes for this DTC may include:","Short to ground\nShort to battery voltage\nBad connector with pushed out pins\nCorrosion in connector\nFouled EGR pintle\nFailed EGR solenoid\nBad EGR\nFaulty ECU or computer"],"type":"WARN"}