{"code":"P0491","description":"Secondary Air Injection System Insufficient Flow (Bank 1)","info":["This is a generic powertrain code, which means it covers all makes/models, 1996-newer.","However, specific troubleshooting steps will vary depending on the vehicle.","\n ","The secondary air injection system, commonly found on Audi, BMW, Porsche and VW vehicles – and may be found on other vehicles – features an air pump, an exhaust manifold, an input check valve, vacuum control switch, an electrical input circuit for the vacuum control switch and tons of vacuum hoses.","This system pumps fresh air into exhaust system during cold starts to feed oxygen and exhaust gases. This ensures a more complete burn of harmful emissions – hydrocarbons. After about minute, the system turns itself off.","If the air pump and check valve are faulty, they are normally easier to replace; however, many of the vacuum lines are under or behind the intake manifold. This makes them difficult to reach in most cases. The P0491 code tell there is a fault with the system – usually that the secondary air flow is too low on bank 1. Bank #1 is the side of the engine with cylinder #1. For bank #2, see code P0492.","Other secondary air injection system trouble codes include P0410, P0411, P0412, P0413, P0414, P0415, P0416, P0417, P0418, P0419, P041F, P044F, and P0492."],"symptoms":["Malfunction Indicator Lamp (MIL) illumination"],"causes":["Potential causes for a P0491 may include:","Faulty exhaust manifold check valve\nA fuse or relay for the secondary air injection pump may be faulty\nA faulty air pump\nLeaking vacuum hose\nA bad vacuum control switch\nA dislodged a vacuum line\nA leak in the hoses/piping between the secondary air injection pump and the Combi or secondary air injection\nA sensor for the secondary air pressure may be faulty\nThe combi valve itself is faulty\nThe secondary air injection port in the cylinder head may be plugged with carbon\nThe secondary air injection ports in the cylinder head may by clogged"],"type":"ERR"}