{"code":"P049A","description":"Exhaust Gas Recirculation B Flow","info":["This is a generic powertrain diagnostic trouble code (DTC) that typically applies to OBD-II vehicles that have an exhaust gas recirculation (EGR) system. That may include but is not limited to vehicles from Dodge, Ford, Toyota, Chevrolet, Nissan, VW, Audi, Mazda, Mitsubishi, Subaru, etc.","Although generic, the exact repair steps may vary depending on year, make, model and powertrain configuration.","\n ","A stored code P049A means that the powertrain control module (PCM) has detected a malfunction in the exhaust gas recirculation (EGR) system \"B\" flow for a particular step-down setting. The designation \"B\" refers to a certain position of the step-down EGR valve. Either an electrical problem or a mechanical problem may cause a code P049A to be stored.","Excessive or insufficient EGR flow may result in a stored code P049A.","The step-down EGR valve system is critical in the reduction of nitrous oxide (NOx) particles that are released into the atmosphere as a result of internal combustion and diesel engine operation. NOx has been proven to be a contributing factor in ozone depletion from exhaust emissions. NOx emissions are regulated by federal mandate in North America.","The step-down EGR system is designed to deliver a portion of spent exhaust gases back to the intake manifold, in measured increments. Once exhaust gases are re-circulated back to the intake manifold, they are burned a second time.","EGR system flow is monitored using one of several diverse methods, including:","The differential pressure feedback EGR (DPFE) sensor is positioned in or near the tube which connects the EGR valve and the exhaust manifold. When the EGR valve is opened, pressure in the EGR tube and DPFE sensor is increased. DPFE sensor voltage reflects the change accordingly\nThe manifold absolute pressure (MAP) sensor is used to monitor EGR flow in other vehicle applications. In this type of system, when the PCM commands the step-down EGR opened to a particular stage, a proportionate change in MAP sensor voltage is also expected\nSome vehicles use the manifold air temperature (MAT) sensor to monitor EGR flow. When the EGR is opened to the desired amount (and hot exhaust gases are allowed to flow into the intake manifold), an appropriate variation in MAT sensor voltage is expected","A code P049A will be stored and a malfunction indicator lamp (MIL) may be illuminated if the PCM fails to see the desired degree of change from the respective \"B\" EGR flow monitoring sensor system. In some vehicle applications, multiple ignition cycles (with a failure) are required for MIL illumination."],"symptoms":["Decreased engine performance\nExcessive rich or lean exhaust\nDelayed engine start-up (especially when cold)\nDiminished fuel efficiency"],"causes":["Defective EGR valve\nCarbon clogged EGR passage/s\nCollapsed or cracked DPFE hoses\nFaulty DPFE, MAP, or MAT Sensor\nOpen or shorted circuits to the EGR valve or related sensors"],"type":"ERR"}