{"code":"P04A4","description":"Exhaust Pressure Control Valve B Stuck Open","info":["This is a generic powertrain diagnostic trouble code (DTC) and typically applies to OBD-II vehicles equipped. That may include but is not limited to vehicles from Dodge, Honda, Chevy, Ford, VW, etc. Although generic, the exact repair steps may vary depending on year, make, model and powertrain configuration.","\n ","A stored code P04A4 means that the powertrain control module (PCM) has detected a malfunction in one of the exhaust pressure control (regulator) valves. Valve \"B\" typically indicates the problem has occurred in the bank of the engine which does not contain the number one cylinder but designs vary between manufacturers. In this case, the valve appears to be stuck in the open position.","Exhaust pressure (also called back pressure) regulators are used in turbocharged gasoline and diesel engines. Exhaust back pressure control valve operation is often similar to that of the throttle body. It uses an electronically controlled plate to restrict exhaust flow as determined by the PCM. There is also an exhaust back pressure control valve position sensor and/or an exhaust back pressure sensor.","Increased exhaust back pressure is used to elevate engine and engine coolant temperature faster. This can be especially helpful in very cold climates.","This is a basic, generic overview of exhaust pack pressure valve operation. Check specifications for the vehicle in question before making any assumptions. When the PCM detects a cold air intake temperature that is below a minimum threshold, it will initiate exhaust back pressure valve operation and maintain it until the intake air temperature is normalized. Exhaust back pressure regulator activation usually only occurs once per each ignition cycle. The exhaust back pressure control valve is designed to park in the wide open position once it is deactivated by the PCM.","If the PCM detects that the exhaust back pressure regulator is not in the desired position, or if the exhaust back pressure sensor indicates that it is out of position, a code P04A4 will be stored and a malfunction indicator lamp (MIL) may be illuminated."],"symptoms":["Delayed engine warm up\nEngine stall or stumble when cold\nDiminished engine performance when cold\nOther exhaust back pressure codes"],"causes":["Defective exhaust back pressure control valve position sensor\nBad exhaust pressure sensor\nFaulty exhaust pressure control valve\nOpen or shorted wiring in one of the exhaust pressure control valve circuits"],"type":"WARN"}