{"code":"P000F","description":"Fuel System Over Pressure Relief Valve Activated","info":["This generic powertrain diagnostic trouble code (DTC) typically applies to many OBD-II vehicles. That may include but is not limited to vehicles from Land Rover, Ford, Alfa Romeo, Toyota, etc.","When your OBD-II equipped vehicle exhibits a stored code P000F, it means that the powertrain control module (PCM) has detected excessive fuel pressure and the over pressure relief valve has been activated.","\n ","If there are fuel volume regulator codes or fuel pressure regulator codes present, you should diagnose and repair those before attempting to diagnose the P000F. Fuel system over pressure relief valve activation is most likely a reaction to a malfunction in the fuel pressure regulation system.","Today's clean burning diesel vehicles require extreme levels of fuel pressure to function properly. In my personal experience, I have never encountered a fuel system over pressure relief valve on anything except a diesel vehicle application.","The over pressure relief valve is typically located in the main fuel supply line or on the fuel rail. It is an electronically controlled valve that uses a solenoid as an actuator. The valve will have an inlet line, and outlet line, and a return hose which allows excessive fuel to be returned to the tank (without spillage) whenever the valve is activated.","The PCM receives an input signal from the fuel pressure sensor whenever the vehicle is in the key on engine running (KOER) position. If this input signal reflects that fuel pressure exceeds a programmed limit, the PCM will energize the fuel system over pressure relief valve, the valve will open, excessive pressure will be relieved, and a small amount of fuel will be diverted back to the fuel tank.","Once the PCM has detected an over pressure condition and the relief valve has been activated, a code P000F will be stored and a malfunction indicator lamp (MIL) may be illuminated. MIL illumination may require multiple ignition cycles with a failure."],"symptoms":["Delayed start or no start condition\nA general lack of engine performance\nDiminished fuel efficiency\nOther fuel system codes or misfire codes"],"causes":["Bad fuel pressure sensor\nDefective fuel pressure regulator\nFaulty fuel volume regulator\nRestricted fuel filter\nPCM failure or PCM programming error"],"type":"ERR"}