{"code":"P000E","description":"Fuel Volume Regulator Control Exceeded Learning Limit","info":["This generic powertrain diagnostic trouble code (DTC) typically applies to many OBD-II vehicles. That may include but is not limited to vehicles from Land Rover, Ford, Alfa Romeo, Toyota, etc.","If your vehicle has stored a code P000E, it means that the powertrain control module (PCM) has detected a problem with the fuel volume regulator (fuel metering control valve).","\n ","The malfunction is related to the PCM's ability to control fuel volume to the engine. The learning limit is the degree to which the PCM is programmed to adapt in order to actuate the solenoid of the fuel volume control valve.","In my personal experience, the electronic fuel volume control system is used only on diesel engines with a common rail fuel injection system. Use caution when servicing the high-pressure fuel system.","The fuel volume regulator is composed of two parts which work in conjunction. An electronically controlled solenoid actuates an in-line valve which restricts fuel volume accordingly. In some cases, the fuel volume regulator may have an integrated fuel volume sensor as well. Other vehicle applications utilize a fuel volume sensor in the fuel supply line or fuel injector rail. A fuel return line allows excess fuel to be safely diverted back to the fuel tank when volume must be reduced.","The fuel volume regulator is typically positioned in the fuel supply line between the fuel tank and the fuel rail. It is an electronically controlled valve which is completely open during regular operation (when it is not energized). When it becomes necessary for the PCM to restrict fuel volume, the fuel volume control regulator circuit is completed using varying degrees of voltage. The valve is opened or closed according to the amount of voltage applied to the circuit.","The fuel volume sensor signal is input to the PCM which takes the necessary steps to adjust fuel volume via the regulator. If the input signal from the fuel volume sensor indicates that actual fuel volume cannot be controlled sufficiently by the PCM, a code P000E will be stored and a malfunction indicator lamp may be illuminated."],"symptoms":["Diminished engine performance\nExcessive black smoke from exhaust\nDecreased fuel efficiency\nOther drivability codes may be stored"],"causes":["Bad fuel volume regulator control valve\nFuel pump malfunction\nDefective fuel volume sensor\nOpen or shorted circuits in the fuel volume control system\nFaulty PCM or PCM programming error"],"type":"ERR"}