{"code":"P0017","description":"Crankshaft Position - Camshaft Position Correlation (Bank 1 Sensor B)","info":["This diagnostic trouble code (DTC) is a generic powertrain code, which means that it applies to OBD-II equipped vehicles, including but not limited to Ford, Dodge, Toyota, VW, Honda, Chevrolet, Hyundai, Audi, Acura, etc.","The crankshaft position sensor (CKP) and Camshaft position sensor (CMP) work in harmony to control the spark/fuel delivery and timing. They both consist of a reluctor, or tone, ring which passes over a magnetic sensor, which generates a voltage, indicating position.","\n ","The crankshaft sensor is part of the primary ignition system and functions as the \"trigger\". It detects the position of the crankshaft relays that information on to the PCM or the ignition module (depending on the vehicle) to control spark timing. The Camshaft position sensor detects the position of the camshafts and relays the information to the PCM. The PCM uses the CMP signal to identify the beginning of the injector sequence. What ties these two shafts and their sensors together is the timing belt or chain. The cam and crank should be precisely timed together.","If the PCM detects that the crank and cam signals are out of time by a specific number of degrees, this DTC will set. Bank 1 is the side of the engine that contains cylinder #1, the \"B\" sensor is most likely the exhaust camshaft side.","Note it is not uncommon on certain models to see this DTC in conjuction with P0008, P0009, P0016, P0018, and P0019. If you have a GM vehicle and have those multiple DTCs, check for service bulletins that may apply to your engine."],"symptoms":["Malfunction Indicator Lamp (MIL) illumination\nThe engine may run but with reduced performance\nThe engine may crank but not start\nThe engine may exhibit a rattle near the harmonic balancer indicating the tone ring is damaged\nThe engine may start and run, but poorly"],"causes":["Timing chain stretched, or timing belt skipped a tooth due to wear\nMisalignment of timing belt/chain\nTone ring on crankshaft slipped/broken\nTone ring on camshaft slipped/broken\nBad crank sensor\nBad cam sensor\nDamaged wiring to crank/cam sensor\nTiming belt/chain tensioner damaged\nAn improperly torqued crankshaft balancer\nA mis-built or mis-timed engine\nA loose or missing crankshaft balancer bolt\nThe CMP actuator solenoid stuck open\nThe CMP actuator stuck in a position other than 0 degrees"],"type":"ERR"}