{"code":"P002C","description":"B Camshaft Profile Control Circuit High Bank 1","info":["This is a generic powertrain diagnostic trouble code (DTC) and typically applies to OBD-II vehicles. Vehicles affected may include but is not limited to Volvo, Chevrolet, Ford, Dodge, Porsche, Ford, Land Rover, Audi, Hyundai, Fiat, etc. Although generic, the exact repair steps may vary depending on year, make, model and powertrain configuration.","\n ","The camshaft is responsible for the valves’ positions. It uses a shaft with lobes integrated in the design to a specific measurement (depending on engine manufacturer and model) to, when mechanically timed properly, precisely open and close valves at the optimal amount/speed. The crankshaft and camshaft are connected mechanically using different styles (e.g. belt, chain).","In the code description, they mention the camshaft \"profile\". What they are referring to here, is the shape or the roundness of the lobe. Some systems use these adjustable lobes, I am going to call it, to precisely integrate a more efficient \"lobe design\" at given times. These are beneficial because, at different engine speeds and loads, having a different camshaft profile can increase volumetric efficiency among other benefits depending on operator demands. It is important to note, most times it is not another physical lobe rather, manufacturers mimic a \"new lobe\" by using varying strategies (i.e. switchable/adjustable rocker arm components).","The letter \"1\" in the description is extremely valuable in this case. Not only could the camshaft be on either side, but there may be 2 shafts on each cylinder head. So it's important to clarify which camshaft you are working with before proceeding. As far as banks go, bank 1 will be the one with cylinder #1. Most times, B refers to the exhaust camshaft and A refers to the intake camshaft. This all depends on which particular engine you are working with as there are countless different designs that will alter these diagnosis procedures depending which one you own. Refer to she manufacturer's service manual for the specifics.","The ECM (Engine Control Module) illuminates the CEL (Check Engine Light) with P002C and related codes when it detects a malfunction within the camshaft profile control circuit. P002C is set when there is an high electrical condition within the bank 1 circuit.\n"],"symptoms":["Low power\nPoor driveability\nReduced fuel economy\nAbnormal throttle response\nGeneral reduction in efficiency\nAltered power bands"],"causes":["Lack of oil maintenance\nIncorrect oil\nContaminated oil\nDefective oil solenoid\nStuck valve\nBroken wire\nElectrical short (internal or mechanical)\nECM (Engine Control Module) issue"],"type":"WARN"}