{"code":"P0034","description":"Turbo Charger Bypass Valve Control Circuit Low","info":["This diagnostic trouble code (DTC) is a generic OBD-II powertrain code. It is considered generic because it applies to all makes and models of vehicles (1996-newer), although specific repair steps may vary depending on the make and model.","Owners of these these brands may include but are not limited to VW, Dodge, Saab, Pontiac, Ford, GM, etc.","\n ","When this code is exhibited, it indicates that the powertrain control module (PCM) has detected a malfunction with the control circuit for the valve that is designed to relieve excessive turbocharger boost pressure. This particular code means that a low boost condition or low boost pressure bypass valve control circuit voltage has been detected.","Sometimes the boost controller is a stand-alone module but (more often) it is an integrated part of the PCM. It calculates input data from various engine and transmission sensors to determine how much boost pressure is required for the engine to perform at optimum levels; the boost pressure control valve is then opened or closed as commanded. If actual boost pressure fails to coincide with the desired boost pressure, as regulated by the boost pressure control valve, this type of code will be stored and a service engine soon lamp may be illuminated.","Most OBD-II equipped vehicles utilize a turbo bypass control valve that is actuated with a small electric motor but there a few manufacturers that still use a vacuum operated design. Check turbocharger bypass control system specifications for your vehicle before attempting diagnosis. Electronically controlled turbo bypass control valves are monitored via a signal circuit to the PCM. IF signal voltage falls below a programmed range, for an unacceptable amount of time, this type of code will be stored.","Conditions for causing this code to be stored can lead to excessive or insufficient turbocharger boost pressure. This type of code should be addressed as soon as possible.\n"],"symptoms":["Irregular noises from the turbocharger wastegate and/or hoses\nHeavy black smoke from the exhaust\nDiminished engine performance\nFouled spark plugs\nHigher engine and/or transmission temperatures\nAdditional codes may also be stored, including other turbocharger boost related codes, engine misfire codes, or knock sensor codes\nDue to higher engine temperatures, cylinder detonation is also a definite possibility"],"causes":["Potential causes for this P0034 code to trigger include:","Faulty boost pressure sensor\nBad turbocharger bypass valve\nDisconnected, cracked, or collapsed vacuum lines (vacuum actuated bypass valve)\nA defective turbocharger bypass valve actuator\nBoost control sensor circuit wiring may be shorted, burnt, cut, or disconnected\nLoose, corroded, or disconnected electrical connectors in the boost sensor reference circuit\nDefective PCM or boost controller"],"type":"WARN"}