{"code":"P0035","description":"Turbo Charger Bypass Valve Control Circuit High","info":["This diagnostic trouble code (DTC) is a generic OBD-II powertrain code. It is considered generic because it applies to all makes and models of vehicles (1996-newer), although specific repair steps may vary depending on the make and model.","Owners of these these brands may include but are not limited to VW, Dodge, Saab, Pontiac, Ford, GM, etc.","\n ","When I find this code stored in a turbocharged vehicle, I know that the powertrain control module (PCM) has detected a malfunction in the control circuit for the turbocharger boost pressure bypass valve. This electronically controlled valve is designed to relieve excessive turbocharger boost pressure. This code, in particular, indicates that a high boost condition or high boost pressure bypass valve circuit voltage has been detected.","While the boost controller is occasionally a stand-alone module, it is more frequently an integrated part of the PCM. The purpose of the turbocharger boost controller (as the name implies) is intended to calculate input data from various engine and transmission sensors and use the calculations to determine how much boost pressure is required for the engine to perform at optimum levels at any given time or circumstance. The boost pressure control valve is then opened or closed as commanded by the PCM. If the desired boost pressure fails to coincide with actual boost pressure (as regulated by the PCM) a turbocharger bypass valve control circuit high code will be stored and a service engine soon lamp may be illuminated. Turbo bypass control valves, which are electronically controlled, are monitored through a signal circuit to the PCM. A turbocharger bypass valve control circuit high code will be stored if signal voltage falls below a programmed range for an unacceptable amount of time.","A turbo bypass control valve that is actuated with a small electric motor is the norm for most OBD-II equipped vehicles. Nevertheless, there a few manufacturers that still utilize use a vacuum operated valve. Electronic valves are controlled directly by a voltage signal from the PCM; vacuum actuated valves are controlled using a vacuum control (or vacuum service) solenoid. The vacuum service solenoid is typically supplied with constant engine vacuum. A voltage signal from the PCM initiates opening (and closing) of the solenoid to allow or restrict vacuum to the valve as required. Always consult the service manual (or equivalent) for your vehicle (turbocharger bypass control system specifications) before attempting diagnosis.","Since the conditions for causing this code to be stored can lead to major engine damage from excessive or insufficient turbocharger boost pressure, this type of code should be checked out at your earliest convenience.\n"],"symptoms":["Increased engine and/or transmission temperatures\nRandom noises from the turbocharger wastegate and/or hoses\nReduced engine performance\nBlack smoke from the exhaust system\nOther turbocharger boost related codes, engine misfire codes, or knock sensor codes may also be stored\nThe spark plugs may be fouled\nHotter engine temperatures may also lead to cylinder detonation"],"causes":["Potential causes for this P0035 code include:","A defective boost pressure sensor is possibly the most common cause of a stored turbocharger bypass valve control circuit high code\nTurbocharger bypass valve failure\nCollapsed, disconnected, or split vacuum lines (applicable for vacuum actuated bypass valves)\nTurbocharger bypass valve actuator problems\nA shorted or open circuit in the turbocharger bypass control sensor circuit\n• Loose, corroded, or disconnected electrical wiring/connectors in the turbocharger bypass control/boost pressure sensor reference circuit\nA bad PCM or boost controller"],"type":"WARN"}