{"code":"P0049","description":"Turbocharger/Supercharger Turbine Overspeed","info":["This diagnostic trouble code (DTC) is a generic powertrain code, which means that it applies to OBD-II equipped vehicles (Dodge, Ram, Ford, GMC, Chevrolet, VW, Toyota, etc.). Although generic, the specific repair steps may vary depending on make/model.","If you have encountered a code P0049 in an OBD-II equipped vehicle, it indicates that the powertrain control module (PCM) has detected a turbocharger or supercharger turbine overspeed condition. This code could be attributed to a mechanical or an electrical malfunction in the forced air induction (FAI) system.","\n ","As forced air induction systems, turbochargers and superchargers are both used to increase engine performance. By design, ambient air is drawn into each type of device, which then compresses the air and forces it into the engine combustion chambers. The method in which they are driven is the most significant difference between the turbocharger and supercharger. While the supercharger is driven by a belt that runs off the engine crankshaft, the turbocharger is driven by engine exhaust. In order to make the air that is introduced to the engine even cooler and denser, FAI systems often use some type of intercooler. A methanol or cold water injection may also be utilized for this purpose.","The boost controller is usually an integrated part of the PCM. Data from engine and transmission sensors is calculated by the PCM to determine the degree of boost pressure required for the engine to perform at an optimum level. To determine whether or not boost pressure meets desired levels, it is monitored (by the PCM) using one or more boost pressure sensors. The PCM compares actual boost pressure with desired boost pressure and activates bypass control valves and/or blow-off valves (as required) to prevent an overboost condition.","Most bypass control valves and blow-off valves are actuated electronically. Prior to attempting a diagnosis for a code P0049, consult a reliable vehicle information source (such as All Data DIY) for information regarding the forced air induction control system for your vehicle.","If the PCM detects a level of boost pressure that is higher than the programmed limit, a code P0049 will be stored and a malfunction indicator lamp (MIL) may be illuminated.","Related turbo / supercharger engine trouble codes:","P0045 Turbocharger/Supercharger Boost Control \"A\" Circuit/Open\nP0046 Turbocharger/Supercharger Boost Control \"A\" Circuit Range/Performance\nP0047 Turbocharger/Supercharger Boost Control \"A\" Circuit Low\nP0048 Turbocharger/Supercharger Boost Control \"A\" Circuit High"],"symptoms":["Loud noises from the wastegate and/or hoses especially under acceleration\nThick black smoke from the exhaust\nHigher engine and/or transmission temperatures\nSpark detonation is possible due to elevated cylinder temperature\nFouled spark plugs\nAdditional codes may also be stored, including other turbocharger boost related codes, knock sensor codes, or engine misfire codes"],"causes":["Potential causes for this code to set are:","Faulty boost pressure sensor\nBad turbocharger bypass valve, wastegate, or blow-off valve\nMechanical turbocharger/supercharger failure\nDisconnected, cracked, or collapsed vacuum lines (vacuum actuated bypass valve)\nDisconnected or damaged turbocharger hoses\nLoose, corroded, or disconnected electrical connectors in boost pressure sensor circuits\nDefective PCM, boost controller, or PCM programming error"],"type":"ERR"}