{"code":"P0040","description":"O2 Sensor Signals Swapped Bank 1 Sensor 1 / Bank 2 Sensor 1","info":["This diagnostic trouble code (DTC) is a generic OBD-II powertrain code. It is considered generic because it applies to all makes and models of vehicles (1996-newer), although specific repair steps may vary depending on the make and model. Owners of these these brands may include but are not limited to Ford, Dodge, BMW, Chrysler, Mercedes Benz, Nissan, VW, etc.","\n ","In a nutshell, a P0040 code means that the vehicle's computer (the PCM or powertrain control module) has detected that the first O2 oxygen sensors downstream from the engine have swapped wiring. The vehicle's PCM uses the oxygen sensor readings to adjust how much fuel to inject into the engine for most efficient operation. The PCM monitors the engine sensor readings and if for example it puts more fuel into bank 2 of the engine but then sees that the bank 1 oxygen sensor is reacting instead of bank 2, that is the type of thing that triggers this code. For this DTC, the first O2 oxygen sensor that is in the exhaust manifold or downstream from it is the sensor #1. It will be upstream from the catalytic converter.","This trouble code is not common and only applies to vehicles with engines that have more than one bank of cylinders. If you have an inline engine you won't get this code. Bank 1 is always the bank of the engine that contains cylinder #1."],"symptoms":["Malfunction indicator lamp (MIL) illuminated solid or flashing\nDecreased engine power and possible limp mode\nIncreased fuel consumption\nRough idle or rough running","This is a code that should be attended to right away. Ignoring this code could lead to a damaged catalytic converter which is very costly."],"causes":["A P0040 DTC trouble code may be caused by one or more of the following:","Oxygen sensor wiring connectors swapped from bank to bank (most likely)\nO2 sensor wiring crossed, damaged, and/or shorted\nFailed PCM (less likely)"],"type":"ERR"}