{"code":"P0055","description":"HO2S Heater Resistance (Bank 1 Sensor 3)","info":["This diagnostic trouble code (DTC) is a generic powertrain code, which means that it applies to all 1996-newer vehicles (Chevrolet, Ford, GMC, Mazda, Pontiac, Isuzu, etc.). Although generic, the specific repair steps may vary depending on make/model.","In my personal experience, a stored code P0055 means that the powertrain control module (PCM) has detected a malfunction in the heater circuit of the downstream (or post catalytic converter) oxygen (O2) sensor for engine bank one. Bank 1 specifies that the malfunction concerns the bank of the engine that contains the number one cylinder. Sensor 3 indicates that the problem is associated with the downstream sensor.","\n ","A zirconium dioxide sensing element, protected by a vented steel housing, lies at the heart of your typical O2 sensor. The sensing element is connected to wire leads in the O2 sensor wiring harness with platinum electrodes. Data from the O2 sensor is transmitted to the PCM via the controller area network (CAN). The data consists of information regarding the percentage of oxygen particles in the engine exhaust as compared to the oxygen content of ambient air. The data is used by the PCM to calculate fuel delivery and ignition timing. Battery voltage is used by the PCM as a means to preheat the O2 sensor during cold start conditions. The O2 sensor signal circuits are complemented by a circuit dedicated to preheating the sensor. The heater circuit usually consists of a battery voltage wire (12.6-volts minimum) and a system ground wire. The PCM takes measures to apply battery voltage to the O2 sensor heater during low engine coolant temperature conditions. This usually occurs until the PCM enters closed loop operation. Voltage is routed through the PCM, sometimes with the help of a relay and/or fuses. The circuit is energized when the ignition switch is turned on during cold start conditions. The PCM is programmed to de-energize the O2 heater circuit once the engine reaches normal operating temperature.","When the PCM detects a level of resistance, from the O2 sensor heater circuit, that is greater than programmed limitations; a code P0055 will be stored and a malfunction indicator lamp (MIL) may be illuminated. Certain vehicles could require multiple ignition cycles (with a failure) for the MIL to be illuminated. If this applies to your vehicle, you will need to use the OBD-II readiness mode in order to make sure that your repairs are successful. Once repairs are performed, drive the vehicle until the PCM either enters readiness mode or the code is reset."],"symptoms":["Delayed start up due to a lean cold start condition\nDiminished fuel efficiency\nBlack smoke from exhaust due to a rich cold start condition\nOther related diagnostic trouble codes may also be stored"],"causes":["Potential causes of a P0055 trouble code may include:","Burnt, broken, or disconnected wiring and/or connectors\nA faulty O2 sensor\nBlown fuse or burnt fusible link\nDefective engine control relay"],"type":"ERR"}