{"code":"P0057","description":"Generic: HO2S Heater Control Circuit Low (Bank 2 Sensor 2)\nNissan: Heated oxygen sensor (HO2S) 2 Bank 2 - heater voltage low","info":["This code is a generic powertrain code. It is considered generic because it applies to all makes and models of vehicles (1996-newer), although specific repair steps may be slightly different depending on the model.","For Nissan vehicles, the description is just slightly different, it's listed as Heated oxygen sensor (HO2S) 2 Bank 2 - heater voltage low.","\n ","Heated Oxygen sensors (HO2S) are inputs used by the PCM (Powertrain Control Module) to determine oxygen content in the exhaust system. Bank 2, sensor 2 refers to the second sensor back on Bank 2. The PCM uses the information gained from the Bank 2,2 HO2S mainly to monitor the efficiency of the catalytic converter. Integral to this sensor is a heater element","The PCM controls this heater to warm up the sensor to operating temperature. This allows the engine to enter closed loop faster and reduces emissions on cold startup. The PCM continuously monitors the heater circuits for abnormal voltages or in some cases, even amperages. Depending on the make of vehicle, the Oxygen sensor heater is controlled one of two ways. One way is that the PCM directly controls the voltage feed to the heater either directly or via a HO2S relay and a ground is supplied from the vehicle's common ground. The other way would be a fused 12 volt Battery feed (B+) that feeds 12 volts to the heater element anytime the ignition is on and the control of the heater is done by a driver in the PCM which controls the ground side of the heater circuit.","Finding out which one you have is important because the PCM activates the heater under various circumstances. If the PCM detects an abnormally low voltage condition on the heater circuit, P0057 may set. Bank 2 is the side of the engine that does not contain cylinder #1."],"symptoms":["Malfunction indicator lamp (MIL) illumination\nThere will likely be no other symptoms"],"causes":["Potential causes of a P0057 trouble code may include:","Bank 2,2 oxygen sensor heater element has failed\nPhysical damage to heated oxygen sensor has occurred\nControl circuit (or voltage feed, depending on system) is shorted to ground\nPCM Oxygen sensor heater driver has failed"],"type":"WARN"}