{"code":"P006C","description":"MAP - Turbocharger/Supercharger Inlet Pressure Correlation","info":["This generic powertrain diagnostic trouble code (DTC) typically applies to many OBD-II vehicles. That may include but is not limited to vehicles from Toyota, Dodge, Chrysler, Fiat, Sprinter, VW, Mazda, etc.","A stored code P006C means that the powertrain control module (PCM) has detected a discrepancy in the correlating signals between the manifold absolute pressure (MAP) sensor and the turbocharger/supercharger inlet pressure sensor.","\n ","In some vehicle applications, the MAP sensor may be described as a barometric pressure sensor. Obviously, the code P006C is applicable exclusively to vehicles with forced air induction systems.","Other stored MAP sensor or forced air induction system codes should be diagnosed and repaired before attempting to diagnose a code P006C.","Intake manifold absolute pressure (air density) is measured in either kilopascal (kPa) units or inches of mercury (Hg), utilizing the MAP sensor. These measurements are input to the PCM as varying degrees of voltage. MAP and barometric pressure signals are measured in similar increments.","The turbocharger/supercharger inlet pressure sensor will typically be of a similar design to the MAP sensor. It also monitors air density. It is most often positioned inside the turbocharger/supercharger inlet hose and it provides the PCM with an appropriate voltage signal reflecting such.","If voltage input signals (between the MAP sensor and the turbocharger/supercharger inlet pressure sensor) differ by more than a programmed degree (over a certain period of time and under a particular set of circumstances), a code P006C will be stored, and a malfunction indicator lamp (MIL) may be illuminated.","In some vehicle applications, MIL illumination may require multiple drive cycles (with a failure). Exact parameters for code storage (as it relates to the vehicle in question) can be obtained by consulting a reliable vehicle information source (such as AllData DIY)."],"symptoms":["Reduced engine performance\nDecreased fuel efficiency\nHesitation or delayed engine acceleration\nA rich or lean condition\nLouder than normal hissing/suction noise upon acceleration"],"causes":["Defective MAP sensor\nFaulty turbocharger/supercharger inlet pressure sensor\nOpen or shorted wiring or connector\nInsufficient engine vacuum\nRestricted air intake\nPCM or PCM programming error"],"type":"ERR"}