{"code":"P0093","description":"Fuel System Large Leak Detected","info":["This diagnostic trouble code (DTC) is a generic powertrain code. It is considered generic because it applies to all makes and models of vehicles (1996-newer), although specific repair steps may be slightly different depending on the model.","\n ","When the computer sets this code it senses a large fuel leak in the high pressure section of the engine. The ECM in a diesel always monitors and controls the fuel pressure from the fuel injector pump to the injectors as long as the engine is running.","To set a code P0093 the ECM must sense a sudden large drop in fuel pressure within the system. This drop in fuel pressure can be internal, external or caused by a faulty sensor signal to the ECM.","When this happens, the ECM sets the code, goes into fail-safe mode which will suspend the fuel injector pump operation and allow one minute to pull over before it shuts the engine down. It will remain in fail-safe mode until the key is off.","The engine may run again but investigate the problem first. This problem will not correct itself or go away. The engine could shut down at any time or speed.","Unlike gasoline engines with fuel injection pressures of 30 to 50 PSI, diesel engine fuel pressure runs up in the Megapascal range, from 4,500 to 30,000 PSI. It takes very high fuel pressure to force fuel into the high compression cylinder of a diesel.","As you progress in diagnosing the problem be always mindful of the fuel pressure when the engine is running. It is ridiculously high! You have a code P0093 stating there is a large fuel leak in the system. Use caution when sticking your nose under the hood of a running engine with this code, or wrenching on the fuel system."],"symptoms":["Code set and malfunction indicator lamp illumination (check engine light)\nEngine will enter fail-safe mode and shut down within one minute\nPossible large loss of power above idle"],"causes":["Potential causes for this DTC include:","Fuel injector failure\nFuel line common rail leak\nFuel pressure sensor malfunction\nFuel pump or lift pump failure\nFuel heater constantly on\nFuel temperature sensor failure\nLeaks at any point in the high pressure circuit\nElectrical connector corrosion or seating problems\nFuel pressure regulator malfunction\nFuel filter plugged dropping the fuel line volume\nInjector pump leak\nFuel control actuator failure\nCascade overflow valve malfunction\nShort in the electrical harness at the injectors or to the ECM\nFuel pressure limiting valve\nECM failure"],"type":"ERR"}