{"code":"P0094","description":"Fuel System Leak Detected - Small Leak","info":["This diagnostic trouble code (DTC) is a generic powertrain code, which means that it applies to all 1996-newer vehicles (Ford, GMC, Chevrolet, VW, Dodge, etc.). Although generic, the specific repair steps may vary depending on make/model.","When I come across a stored code P0094, it generally means that the powertrain control module (PCM) has detected a substantial decrease in fuel pressure. Fuel pressure specifications vary from one manufacturer to another and the PCM is programmed to monitor fuel pressure according to these specifications. This code is primarily used in diesel powered vehicles.","\n ","Diesel fuel systems are monitored (by the PCM) using one or more fuel pressure sensors. Low pressure fuel is pumped from the storage tank to the high pressure injector pump via a supply (or transfer) pump that is usually either attached to the frame rail or inside the fuel tank. Once the fuel exits the injector pump, it can reach levels as high as 2,500 psi. Use caution when testing fuel pressure. These extreme fuel pressure conditions can be very hazardous. Although diesel fuel is not as combustible as gasoline, it is highly flammable especially under high pressure. Additionally, diesel fuel under these levels of pressure can penetrate the skin and enter the bloodstream. This can be harmful or even fatal under certain circumstances.","Fuel pressure sensors are placed at strategic locations in the fuel delivery system. Typically, there will be at least one fuel pressure sensor for each segment of the fuel system; a sensor for the low pressure supply end and another for the high pressure delivery end.","The fuel pressure sensors are normally of a three-wire design. Some manufacturers use battery voltage and others use a lesser degree of voltage (usually five-volts) as a reference for the PCM. Reference voltage and a ground signal are supplied to the sensor. The sensor provides the PCM with a voltage input signal. As fuel system pressure increases, the resistance level of the fuel pressure sensor decreases, allowing the voltage signal that is input to the PCM to increase accordingly. When fuel pressure decreases, resistance levels in the fuel pressure sensor increase, causing the voltage input signal to the PCM to decrease. If the fuel pressure sensor/s is operating normally, this cycle takes effect with each ignition cycle.","If the PCM detects fuel system pressure that does not coincide with programmed specifications, during a set period of time and under certain circumstances, a code P0094 will be stored and a malfunction indicator lamp may be illuminated.\n"],"symptoms":["The distinct smell of diesel fuel\nDiminished fuel efficiency\nDecreased engine performance\nOther fuel system codes may be stored"],"causes":["Possible causes for this engine code include:","Clogged fuel filter\nDefective fuel pressure sensor\nFaulty fuel pressure regulator\nFuel system leaks that may include: fuel tank, lines, injection pump, supply pump, fuel injectors"],"type":"ERR"}