{"code":"P0099","description":"Intake Air Temperature Sensor 2 Circuit Intermittent","info":["This diagnostic trouble code (DTC) is a generic powertrain code, which means that it applies to all 1996-newer vehicles (Ford, Mazda, Mercedes Benz, etc.). Although generic, the specific repair steps may vary depending on make/model.","A stored code P0099 means that the powertrain control module (PCM) has detected an intermittent input signal from the #2 intake air temperature (IAT) sensor circuit.","\n ","The PCM uses the IAT input signal and the mass airflow (MAF) sensor input signal to calculate fuel delivery and ignition timing strategy. Since maintaining a correct air/fuel ratio (typically 14:1) is critical to engine performance and fuel efficiency, the input of the IAT sensor is very important.","The IAT sensor can be threaded directly into the intake manifold but is more commonly inserted into the air inlet pipe or air cleaner box. Some manufacturers also integrate the IAT sensor into the MAF sensor housing. At any rate, it must be positioned so that (with the engine running) ambient air, drawn into the intake manifold through the throttle body, can continuously and consistently flow across it.","The IAT sensor is usually a two-wire thermistor sensor. Sensor resistance varies according to the temperature of the air that flows across the cold wire element. Most OBD II equipped vehicles utilize a reference voltage (five-volts is normal) and a ground signal to complete the IAT sensor circuit. The varying resistance levels in the IAT sensor element cause voltage fluctuations in the input circuit. These fluctuations are interpreted by the PCM as changes in intake air temperature.","If the PCM detects a certain number of intermittent signals from the #2 IAT sensor, over a set period of time, a code P0099 will be stored and a malfunction indicator lamp may be illuminated.\n"],"symptoms":["Slightly diminished fuel efficiency\nDecreased engine performance (especially upon cold start)\nHesitation or surge at idle or upon light acceleration\nOther drivability codes may be stored"],"causes":["Possible causes for this engine code include:","Open or shorted #2 IAT sensor wiring and/or connectors\nDefective #2 IAT sensor\nFaulty MAF sensor\nClogged air filter\nBroken intake air inlet pipe"],"type":"ERR"}