{"code":"P00A0","description":"Charge Air Cooler Temperature Sensor Circuit Bank 2","info":["This diagnostic trouble code (DTC) is a generic powertrain code, which means it applies to OBD-II equipped vehicles that have a charge air cooler temperature sensor (Chevy, Ford, Toyota, Mitsubishi, Audi, VW, etc.). Although generic, the exact repair steps may vary depending on make/model.","A turbocharger is basically an air pump used to force air into the engine. Inside, there are two sections: the turbine and the compressor.","\n ","The turbine is attached to the exhaust manifold, where it is driven by exhaust gases. The compressor attaches to the air intake. Both are connected by a shaft, so when the turbine spins, the compressor also spins, allowing intake air to be drawn into the engine. Cooler air provides denser intake charge to the engine and therefore more power. Because of this, many engines are equipped with a charge air cooler, also known as an intercooler. Charge air coolers can be either air-to-liquid or air-to-air coolers, but the function is the same – to cool air entering the intake.","A charge air cooler temperature sensor (CACT), is used to measure the temperature and therefore the density, of air entering exiting the charge air cooler. This information is sent to the powertrain control module (PCM) where it is compared to intake air temperature (and in some cases engine coolant temperature and exhaust gas recirculation temperature) to determine charge air cooler performance. The PCM sends a reference voltage (usually 5 volts) through an internal resistor. It then measures the voltage to determine charge air cooler temperature.","Note: Sometimes the CACT is part of the boost pressure sensor.","Code P00A0 is set when the PCM detects a malfunction in the bank 2 charge air cooler temperature sensor circuit. Bank 2 indicates the problem is with the second bank of the engine. That is, the bank that does not include cylinder #1.","Related bank 2 charge air cooler temperature sensor circuit diagnostic codes include:","P00A1 Charge Air Cooler Temperature Sensor Circuit Range/Performance Bank 2\nP00A2 Charge Air Cooler Temperature Sensor Circuit Low Bank 2\nP00A3 Charge Air Cooler Temperature Sensor Circuit High Bank 2\nP00A4 Charge Air Cooler Temperature Sensor Circuit Intermittent/Erratic Bank 2"],"symptoms":["Illuminated check engine light\nPoor engine performance\nDecreased fuel economy\nVehicle stuck in \"limp\" mode\nDiesel particulate filter regeneration inhibited (if equipped)"],"causes":["Possible causes for this P00A0 code include:","Faulty sensor\nWiring problems\nFailed or restricted charge air cooler\nFaulty PCM"],"type":"ERR"}