{"code":"P00B3","description":"Radiator Coolant Temperature Sensor Circuit Low","info":["This generic powertrain diagnostic trouble code (DTC) typically applies to all OBD-II vehicles. That may include but is not limited to vehicles from Mercedes, Vauxhall, Nissan, BMW, Mini, Chevy, Mazda, Honda, Acura, Ford, etc.","The cooling system is an integral part of your vehicles engine system. It is responsible for not only monitoring your engine's temperature but also regulating it. It does this using various electrical and mechanical systems/components including but not limited to: Coolant Temperature Sensor (CTS), radiator, water pump, thermostat, etc.","\n ","The Engine Control Module (ECM) uses the CTS' values to monitor the engine's temperature and in turn, can regulate it accurately. Different temperatures require different air/fuel mixtures so it is imperative that the CTS is functioning within desired ranges. Most times, CTS' are Negative Temperature Coefficient sensors, which means, the resistance within the sensor itself decreases as the temperature rises. Understanding this will help you greatly when troubleshooting.","The ECM activates P00B1 and associated codes when it monitors one or multiples condition outside a specific electrical range within the CTS or it's circuit. The ECM may detect an issue that is not consistent which comes and goes (P00B5) From my experience, the culprit here tends to be mechanical. Keep in mind, electrical faults could be the cause as well.","P00B3 Radiator Coolant Temperature Sensor Circuit Low code is set when the ECM monitors a low specific electrical value within the radiator CTS or it's circuit. It is one of five related codes, which are P00B1, P00B2, P00B3, P00B4, and P00B5."],"symptoms":[],"causes":["Defective radiator or other coolant temperature sensor (CTS)\nDirty/plugged sensor pickup\nSensor O-ring/Gasket leaking\nBroken or damaged wiring harness\nFuse\nECM issue\nPin/connector problem (corrosion, melting, broken lock tab etc.)"],"type":"WARN"}