{"code":"P0604","description":"Internal Control Module Random Access Memory (RAM) Error","info":["This diagnostic trouble code (DTC) is a generic powertrain code, which means that it applies to OBD-II equipped vehicles (Dodge, Chevrolet, BMW, Saturn, Kia, VW, etc.). Although generic, the specific repair steps may vary depending on make/model.","When a stored code P0604 presents itself, it means that the powertrain control module (PCM) has detected an internal random access memory (RAM) error. This type of code applies to the PCM itself.","\n ","RAM, as it pertains to the PCM, allows regularly accessed data to be rapidly located when requested. The PCM is programmed from the factory with vital engine management information. There is in fact so much information programmed into the PCM that it would take too much time to access every bit of it, every time an engine management response was initiated. The RAM contains a select, set amount of data that allows the PCM to respond faster in situations which occur repeatedly and in rapid sequence.","Particular settings for engine and transmission management are programmed into the RAM for every vehicle produced. It not only helps to manage engine efficiency and performance more rapidly but also serves to recognize and interact with other onboard vehicle control modules.","If the PCM detects a discrepancy between the RAM and other controllers, or if the RAM fails to function as designed, a code P0604 will be stored and a malfunction indicator lamp (MIL) may be illuminated. Depending upon the severity of the malfunction, multiple failure cycles may be necessary for MIL illumination.","Other internal control module error trouble codes include:","P0601 Internal Control Module Memory Check Sum Error\nP0602 Control Module Programming Error\nP0603 Internal Control Module Keep Alive Memory (KAM) Error\nP0605 Internal Control Module Read Only Memory (ROM) Error"],"symptoms":["No start condition\nMultiple drivability issues\nHarsh or erratic automatic transmission shifting\nDiminished fuel economy\n• The engine may stall or run roughly (especially at idle)"],"causes":["Possible causes for this code include:","PCM programming error\nNew or incorrect PCM\nAftermarket (high-performance) PCM program installed\nBlown ECM/PCM fuse\nLow battery voltage or complete battery discharge\nBad ECM/PCM power supply relay\nA defective ECM/PCM\nOpen or shorted wiring or connectors in the CAN harness\nInsecure control module ground strap or broken ground wire"],"type":"ERR"}