{"code":"P0609","description":"Control Module VSS Output B Malfunction","info":["This generic powertrain diagnostic trouble code (DTC) typically applies to many OBD-II vehicles. That may include but is not limited to vehicles from Citroen, Chevy, Ford, Peugeot, GMC, Dodge, Ram, Ducati, etc.","\n ","The powertrain control module (PCM) has detected a malfunction in a particular vehicle speed sensor (VSS) output voltage signal when a code P0609 is stored.","In this case, a VSS output signal was expected to come from either the PCM itself or one of the many (other) on-board controllers. This particular VSS output circuit has been given the designation \"B\". Consult a source of reliable vehicle information for the specific function of this circuit as it pertains to the vehicle in question.","Vehicles which are equipped with OBD-II diagnostic systems may utilize as many as seventy on-board controllers. These controllers communicate via the controller area network (CAN).","The VSS is an electromagnetic sensor that is used to complete a circuit which provides one or more controllers with an accurate signal reflecting vehicle speed. The VSS is typically positioned near the output shaft of the transmission (or 4WD transfer case) or in the rear differential. A toothed, steel reluctor (permanently affixed to the output shaft or ring gear) passes within close proximity to the electromagnetic sensor and completes the circuit. The gaps between the teeth provide circuit interruptions. The PCM and other controllers receive these circuit completions and interruptions as a wave form pattern of voltage. The frequency of this wave form pattern is interpreted as vehicle speed.","The VSS signal is usually input to a primary controller, such as the PCM or transmission control module (TCM). Once the primary controller receives the VSS input, it is shared with other controllers via the CAN. If any of these secondary controllers fails to receive the VSS signal, or receives an inconsistent VSS signal, a code P0609 will be stored and a malfunction indicator lamp (MIL) may be illuminated.","Example photo of a VSS (Vehicle Speed Sensor):\n"],"symptoms":["Erratic or incorrect speedometer/odometer\nAbnormal (automatic) transmission shifting\nOutput shaft speed sensor codes\nInput speed sensor codes\nABS or Traction Control System (TCS) codes"],"causes":["Defective PCM, TCM, or other controller\nOpen or shorted circuits in the CAN\nCorroded, broken, or loose electrical connectors\nController programming error"],"type":"ERR"}