{"code":"P0600","description":"Generic: Serial Communication Link Malfunction\nChrysler: PCM Fault, SPI Communications Conditions\nGM: Loss of Serial Communication Link Conditions\nInfiniti: AT communication - circuit malfunction\nNissan: ECM/TCM - communication malfunction","info":["This is a generic powertrain diagnostic trouble code (DTC), which means it covers all makes/models, 1996-newer. However, specific troubleshooting steps will vary depending on the vehicle.","\n ","This code indicates a malfunction in the wiring link between the electronic control module (ECM) and one of its supporting control modules. On board diagnostics (OBD) trouble code P0600 is generic by design and encompasses all computer-controlled vehicles.","Explanation of OBD code P0600","Your vehicle's ECM or powertrain control module (PCM) has lost its control over one or more actuator modules. Most vehicles have as many as 18 actuators that the primary ECM controls. It does so through a controller area network (Can Bus Automotive Network), which is a series of wiring harnesses from the ECM to the controllers.","The controllers operated by the ECM, known as modules, control the majority of the functions of your vehicle. The code P0600 was set when the ECM recognized a loss of communication and control over one or more of these modules for eight consecutive starts.","ECM and associated control modules","This is a list of the primary control modules operated by the ECM:","Fuel injection system\nIgnition system\nVariable camshaft timing\nTurbo charger\nEmission systems\nAir conditioning\nTransmission shift points\nBody ride control\nABS brakes\nCruise control\nAnti-theft\nSunroof and seat position\nPower windows\nTraction control systems\nProximity alerts","These are just a few, not to mention all the available computer controlled options available today."],"symptoms":["This is a commonly misdiagnosed code inasmuch as it may cause a deceptive symptom. Always bear in mind that the code P0600 indicates a communication failure. For instance -- an ignition system failure or a failed fuel injector can cause a misfire.","An inexperienced technician may begin by attempting to diagnose the affected system rather than the loss of communication. If the ECM is not controlling the ignition control module or grounding the fuel injector, a misfire will occur.","This is not a fault with the system, but with control of the system itself. Depending on the location of the failure, the following symptoms may be present:","Check engine light illuminated accompanied by an additional code,\nABS light illuminated,\nTransmission light illuminated (vehicle may not shift properly),\nBig drop in fuel economy,\nDriveability problems may occur, such as stalling at an idle, rough running and poor acceleration, or\nProblems with a particular system indicating a possible communication loss in this area."],"causes":["Experience has proven that a poor connection or failed ECM driver is the root cause of this code. For the most part, the ECM acts as a ground to control these components and modules as opposed to supplying power to them.","A loose or corroded connector is more likely than a frayed or broken wire between both devices. Poor grounds are another plausible cause. The ECM, as well as the activator module, need a good ground to operate.","The wiring harness or Can Bus may be defective and have a short to ground or an open wire."],"type":"ERR"}