{"code":"P061F","description":"Internal Control Module Brake Signal Performance","info":["This generic powertrain diagnostic trouble code (DTC) typically applies to many OBD-II vehicles. That may include but is not limited to vehicles from Dodge, Mazda, Ram, Ford, Chrysler, Chevrolet, Toyota, etc. Anecdotally this code seems to be most commonly found on Ford vehicles (Mustang, F-150, etc).","\n ","When a code P061F is stored, it means that the powertrain control module (PCM) has detected an internal performance error with the throttle actuator controller. Other controllers may also detect an internal PCM performance error (in the throttle actuator controller) and cause a P061F to be stored.","This code is used exclusively in vehicles equipped with a drive by wire (DBW) throttle system.","Internal control module monitoring processors are responsible for various controller self-test duties and overall internal control module accountability. Throttle actuator controller input and output signals are subject to self-test and are monitored constantly by the PCM and other related controllers. The transmission control module (TCM), traction control module (TCSM), and other controllers are subject to interaction with the throttle actuator controller.","Most OBD-II equipped vehicles use the DBW system (instead of a cable operated throttle). This not only helps to decrease exhaust emissions and increase fuel efficiency, it also promotes more efficient interaction with stability and traction control systems and aids in optimizing the accuracy of cruise control systems.","Controlled by the PCM using an electric throttle actuator motor, the DBW system employs one or more accelerator pedal position (APP) sensors and multiple throttle position sensors (TPS). All of these sensors are supplied with a 5-volt (typically) reference and a ground signal.","TPS/APP sensors are generally of the potentiometer type. Sensor resistance (circuit voltage) varies according to the position of the throttle plate (TPS) or accelerator pedal (APP). Each individual sensor completes a particular circuit. The sensors are actuated by a pivoting fulcrum extension on the accelerator pedal or the throttle plate shaft. As the contacts of the sensor are moved across a circuit board, sensor resistance changes; causing variations in circuit resistance and (therefore) signal input voltage into the PCM and other controllers.","Inside the cockpit of the vehicle, the APP sensors are affixed to the accelerator pedal bracket. From one APP sensor, the PCM and other controllers receive an input signal (to open or close the throttle plate) whenever the pedal is depressed/released. From a second APP sensor, the PCM and other controllers receive a signal determining to what degree the throttle plate should be opened/closed.","APP/TPS input signals allow the PCM to control the actual position of the throttle plate via the throttle actuator motor. The APP sensor provides a desired degree of throttle and the TPS provides the actual degree. The PCM makes the required adjustments by moving the throttle actuator motor in the appropriate direction.","A separate signal from the TPS is input to the PCM (and the other controllers), reflecting actual throttle position. On-board controllers constantly monitor the signals from the APP sensor and the TPS and compare actual throttle position with desired throttle position.","Whenever the ignition is on and the PCM is energized, throttle actuator controller self-tests are initiated. In addition to running internal controller self-tests, the controller area network (CAN) also compares signals from each individual module to ensure that each controller is functioning properly. These tests are performed simultaneously.","If the TPS/APP sensor inputs exceed the maximum degree of variance as set forth by the manufacturer, a code P061F will be stored and a malfunction indicator lamp (MIL) may be illuminated. Normally, the PCM will enter limp in mode. In this mode, engine acceleration will be restricted. Additionally, if the PCM detects a discrepancy between any of the on-board controllers, which would indicate an internal APP sensor or TPS error, a code P061F will be stored and a malfunction indicator lamp (MIL) may be illuminated. Multiple failure cycles may be necessary for MIL illumination, depending upon the perceived severity of the malfunction."],"symptoms":["Limited or no acceleration\nStuck throttle (at any RPM)\nMultiple drivability issues\nReduction in fuel efficiency\nRough idle or stall (especially at idle)"],"causes":["Faulty DBW actuator motor\nOpen or shorted circuit or connectors in the CAN harness\nInsufficient control module ground\nDefective TPS or APP sensor\nDefective controller or programming error\nOpen or shorted circuits between the TPS/APP sensor and the PCM"],"type":"ERR"}