{"code":"P061D","description":"Internal Control Module Engine Air Mass Performance","info":["This generic powertrain diagnostic trouble code (DTC) typically applies to many OBD-II vehicles. That may include but is not limited to vehicles from Ford, Mazda, Chevrolet, Lincoln, etc.","\n ","When a code P061D is stored, it means that the powertrain control module (PCM) has detected an internal performance error in the engine air mass (mass air flow - MAF) monitoring system. Other controllers may also detect an internal PCM performance error (with the engine RPM monitoring system) and contribute to a P061D being stored.","Internal control module monitoring processors are responsible for various controller self-test duties and overall internal control module accountability. Engine air mass calculation system input and output signals are subject to self-test and are monitored constantly by the PCM and other related controllers. The transmission control module (TCM), traction control module (TCSM), and other controllers are subject to interaction with the engine air mass monitoring system.","Engine air mass is monitored (by the PCM and other controllers) using input signals from the MAF sensor/s. Desired engine MAF is programmed into the PCM and other controllers. Actual engine air mass is calculated using input data from the MAF sensor, as well as the throttle position sensor (TPS), and other engine and transmission sensors. Desired engine air mass is then compared with actual engine air mass. After desired and actual engine air mass are compared, the PCM makes the necessary adjustments to fuel delivery and ignition timing.","Whenever the ignition is on and the PCM is energized, internal engine RPM monitoring self-tests are initiated. In addition to running internal controller self-tests, the controller area network (CAN) also compares signals from each individual module to ensure that all controllers are functioning properly. These tests are performed simultaneously.","If the PCM detects an internal error in desired engine air mass and actual engine air mass (which exceeds the maximum allowable threshold), a code P061D will be stored and a malfunction indicator lamp (MIL) may be illuminated. Multiple ignition cycles (with a failure) may be required for MIL illumination."],"symptoms":["Hesitation or stumble upon acceleration\nEngine misfire\nDiminished fuel efficiency\nEngine misfire codes may also be present"],"causes":["Defective MAF sensor\nCorroded MAF sensor connector\nDefective PCM or PCM programming error\nOpen or shorted circuit or connectors in the CAN harness\nInsufficient control module ground\nOpen or shorted circuits between the MAF sensor and the PCM"],"type":"ERR"}