{"code":"P062C","description":"Internal Control Module Vehicle Speed Performance","info":["This is a generic powertrain diagnostic trouble code (DTC) and typically applies to OBD-II vehicles. That may include but is not limited to vehicles from , etc. Although generic, the exact repair steps may vary depending on year, make, model and powertrain configuration.","\n ","When a code P062C is stored, it means that the powertrain control module (PCM) has detected an internal performance error with the vehicle speed sensor (VSS) signal. Other controllers may also detect an internal PCM performance error (in the VSS signal) and cause a P062C to be stored.","Internal control module monitoring processors are responsible for various controller self-test duties and overall internal control module accountability. VSS signal input and output signals are subject to self-test and are monitored constantly by the PCM and other related controllers. The transmission control module (TCM), traction control module (TCSM), and other controllers are subject to interaction with the VSS signal.","The VSS is typically an electromagnetic sensor that interacts with some type of toothed reluctor ring, wheel, or gear that is mechanically affixed to an axle, transmission/transfer case output shaft, or driveshaft. As the axle spins, so spins the reluctor ring. As the reluctor passes by (in very close proximity to) the sensor, the notches in the reluctor ring create interruptions in the electromagnetic sensor circuit. These interruptions are received by the PCM (and other controllers) as wave form patterns. The faster the wave form patterns are input into the controller, the higher the estimated vehicle speed. As the input of wave forms slow, vehicle speed estimation (as perceived by the controller) decreases. These input signals are compared (between modules) via the controller area network (CAN).","Whenever the ignition is on and the PCM is energized, VSS signal self-tests are initiated. In addition to running internal controller self-tests, the controller area network (CAN) also compares signals from each individual module to ensure that each controller is functioning properly. These tests are performed simultaneously.","If the PCM detects discrepancies in VSS inputs/outputs, a code P062C will be stored and a malfunction indicator lamp (MIL) may be illuminated. Additionally, if the PCM detects a discrepancy between any of the on-board controllers, which would indicate an internal VSS error, a code P062C will be stored and a malfunction indicator lamp (MIL) may be illuminated. Multiple failure cycles may be necessary for MIL illumination, depending upon the perceived severity of the malfunction."],"symptoms":["Erratic speedometer/odometer operation\nIrregular transmission shift patterns\nIllumination of the service engine soon lamp, traction control lamp, or antilock brake lamp\nUnexpected activation of the antilock braking to traction control system (if equipped)\nTraction control codes and/or ABS codes may be stored\nThe ABS system may be rendered inoperable in some cases"],"causes":["Defective controller or programming error\nExcessive metal debris buildup on VSS\nDamaged or worn teeth on reluctor ring\nA defective VSS\nA bad controller power relay or blown fuse\nOpen or shorted circuit or connectors in the CAN harness\nInsufficient control module ground\nOpen or shorted circuits between the VSS and the PCM"],"type":"ERR"}