{"code":"P062A","description":"Fuel Pump A Control Circuit Range/Performance","info":["This is a generic powertrain diagnostic trouble code (DTC) and applies to many OBD-II vehicles (1996-newer). That may include but is not limited to vehicles from Ford, Dodge, Toyota, Chrysler, Jeep, Ram, Chevrolet, Nissan, Mitsubishi, Mercedes, etc. Although generic, the exact repair steps may vary depending on year, make, model and powertrain configuration.","\n ","If the P062A code appears, it means that a problem has been found in the fuel pump \"A\" control circuit. Specifically it means that the voltage detected with the circuit is outside the normal range or experiencing performance problems. Typically, it is brought on by damaged wires/connectors within the circuit or the Controller Area Network (CAN) bus. The Powertrain Control Module (PCM) or the Engine Control Module (ECM) normally identifies this code, however other supporting modules can also spark up this particular code such as:","Alternative Fuel Control Module\nFuel Injection Control Module\nTurbo Control Module","Depending on the make and model of the vehicle it may be several drive cycles before it is able to activate this code or it can also be an immediate reaction as soon as the ECM recognizes the fault.","The fuel pump is integral in the overall drivability of the vehicle. After all, without the fuel pump, there would be no fuel being delivered to the engine. The control circuit, generally speaking, is responsible for turning the pump on and off depending on the operator's needs. An open within said circuit could also cause the P062A code to become active so be aware of this before proceeding with any kind of diagnosing.","A typical fuel pump:\n","Related fuel pump A control circuit codes include:","P0627 Fuel Pump \"A\" Control Circuit /Open\nP0628 Fuel Pump \"A\" Control Circuit Low\nP0629 Fuel Pump \"A\" Control Circuit High\nP062A Fuel Pump \"A\" Control Circuit Range/Performance"],"symptoms":["The check engine light is illuminated\nEngine won’t start\nEngine misfire/stall\nEngine starts but dies\nFuel economy is reduced\nEngine cranks fine but does not start\nEngine dies when reaching operating temperature","Note: It is still possible that problem is actually unresolved, even if the check engine light does not light up immediately. Always ensure your vehicle has gone through a few drive cycles. i.e. drive the car for a week, if CEL (check engine light) is not illuminated by the end, the issue is most likely resolved."],"causes":["Issues with the fuel pump itself\nSevered or damaged ground wire in the device's control module\nUnattached ground strap in the control module\nOpen, shorted, or corroded wiring in the CAN bus\nA faulty CAN bus\nUnsecured harnesses and wires causing a chafe or broken circuit\nHigh resistance in circuit (e.g. melted/corroded connectors, internal wire corrosion)"],"type":"ERR"}