{"code":"P0623","description":"Generator Lamp Control Circuit","info":["This is a generic diagnostic trouble code (DTC) and applies to many OBD-II vehicles (1996-newer). That may include but is not limited to vehicles from Ford, Lincoln, Chevrolet, GMC, Dodge, etc. Although generic, the exact repair steps may vary depending on year, make, model and powertrain configuration.","\n ","A stored code P0623 means that the powertrain control module (PCM) has detected a malfunction with the generator lamp control circuit.","The generator lamp is contained in the instrument panel. Its primary purpose is to warn the driver of potential charging system problems, when it is illuminated.","The PCM typically monitors the continuity of the generator lamp control circuit whenever the engine is running. The generator lamp control circuit is integral to generator operation and maintaining battery charge levels.","Each time the ignition is turned on and the PCM is energized, multiple controller self-tests are performed. In addition to running internal controller self-tests, the controller area network (CAN) is used to compare signals from each individual module to ensure that the various controllers are interfacing properly.","If a problem is detected in monitoring the generator lamp control circuit, a code P0623 will be stored and a malfunction indicator lamp (MIL) may be illuminated,. Depending upon the perceived severity of the malfunction, multiple failure cycles may be necessary for MIL illumination.","Internal control module codes must always be taken seriously. A stored code P0623 could result in a variety of drivability concerns, including a no-start and/or dead battery condition.","A typical alternator:\n"],"symptoms":["Engine drivability issues\nEngine stall when idling\nInadvertent engine shutoff\nDelayed engine cranking\nOther stored codes"],"causes":["Faulty PCM\nPCM programming error\nOpen or shorted generator lamp control circuit\nIndividual cell resistance is excessive\nDefective alternator/generator\nFailed generator lamp bulb"],"type":"ERR"}