{"code":"P0624","description":"Fuel Cap Lamp Control Circuit","info":["This is a generic diagnostic trouble code (DTC) and applies to many OBD-II vehicles (1996-newer). That may include but is not limited to vehicles from Ford, Kia, Chevrolet, GMC, Hyundai, etc. Although generic, the exact repair steps may vary depending on year, make, model and powertrain configuration.","\n ","A stored code P0624 means that the powertrain control module (PCM) has detected a malfunction with the fuel cap lamp control circuit.","The fuel cap lamp is contained in the instrument panel. Its primary purpose is to warn the driver of a loose or missing fuel cap, when it is illuminated.","Fuel warning lamp operation is controlled by the PCM. Using input signals from the fuel tank pressure switch and other sensors, the PCM determines whether or not the fuel cap is properly installed in the fuel filler neck. If the PCM determines that the cap is loose or missing, fuel cap lamp illumination should be triggered.","The PCM typically monitors the continuity of the fuel cap lamp control circuit whenever the engine is running.","Each time the ignition is turned on and the PCM is energized, multiple controller self-tests are performed. In addition to running internal controller self-tests, the controller area network (CAN) is used to compare signals from each individual module to ensure that the various controllers are interfacing properly.","If a problem is detected in monitoring the fuel cap lamp control circuit, a code P0624 will be stored and a malfunction indicator lamp (MIL) may be illuminated. Depending upon the perceived severity of the malfunction, multiple failure cycles may be necessary for MIL illumination.","Check gas cap warning light:\n"],"symptoms":["Diminished fuel efficiency\nEvaporative emissions system deactivation\nOther stored codes"],"causes":["Faulty PCM\nPCM programming error\nOpen or shorted fuel cap lamp control circuit\nDefective, loose, or missing fuel cap\nFailed fuel cap warning lamp bulb"],"type":"ERR"}