{"code":"P063E","description":"Auto Configuration Throttle Input Not Present","info":["This is a generic diagnostic trouble code (DTC) and applies to many OBD-II vehicles (1996-newer). That may include but is not limited to vehicles from Nissan, Toyota, Mazda, Hyundai, Kia, etc. Although generic, the exact repair steps may vary depending on year, make, model and powertrain configuration.","\n ","If your OBD-II equipped vehicle has stored a code P063E, it means that the powertrain control module (PCM) has not detected an auto configuration throttle input signal.","When the ignition cylinder is placed in the ON position and the various on-board controllers (the PCM included) are energized, multiple self-tests are initiated. The PCM depends upon input signals from engine sensors to automatically configure an engine start-up strategy and perform these self-tests. Throttle position is among the key input signals required by the PCM for auto configuration.","The throttle position sensor (TPS) should provide the PCM (and other controllers) with a throttle input signal for automatic configuration purposes. The TPS is a variable resistance sensor that is mounted on the throttle body assembly. The tip of the throttle plate shaft slips inside the TPS. As the throttle plate shaft is moved (either via the accelerator cable or drive-by-wire system), it also moves a potentiometer inside the TPS and causes a variation in circuit resistance. The result is a change in TPS signal circuit voltage to the PCM.","If the PCM fails to detect a throttle position input circuit, when the ignition switch is placed in the ON position and the PCM is energized, a code P063E will be stored and a malfunction indicator lamp may be illuminated. The auto configuration system may also be deactivated; resulting in serious drivability issues.","A typical throttle body:\n"],"symptoms":["Engine stall at idle (especially at start up)\nDelayed engine start\nDrivability issues\nOther TPS related codes"],"causes":["Defective TPS\nOpen or shorted circuit between the TPS and PCM\nCorrosion in TPS connector\nBad PCM or PCM programming error"],"type":"ERR"}