{"code":"P0640","description":"Intake Air Heater Control Circuit","info":["This is a generic diagnostic trouble code (DTC) and applies to many OBD-II vehicles (1996-newer). That may include but is not limited to vehicles from Buick, Chevrolet, Ford, GMC, Mercedes-Benz, Opel, etc. Although generic, the exact repair steps may vary depending on year, make, model and powertrain configuration.","\n ","If a code P0640 has been stored in your OBD-II equipped vehicle, it means that the powertrain control module (PCM) has detected a malfunction in the intake air heater control circuit.","The intake air heater typically consists of a heater element that becomes functional when battery voltage is applied. Increasing intake air temperature stabilizes fuel atomization and helps to evaporate any moisture that may be present. Warmer intake air also promotes greater fuel efficiency.","The intake air heater element is a stationary metal grid that actually becomes red hot when battery voltage is applied. With the intake air heater element glowing hot, intake air passes through and around it and is heated significantly.","The PCM uses data input from the intake air temperature (IAT) sensors to determine whether the intake air heater is functioning properly. Intake air heater usage is limited. Vehicles that utilize an intake air heater usually have an IAT sensor before and after the heater element so that the PCM can effectively monitor intake air heater operation.","If the PCM detects no difference between intake air temperature after it has passed through the intake air heater element, a code P0640 will be stored and a malfunction indicator lamp (MIL) may be illuminated. In most cases, MIL illumination will require more than one ignition cycle with a failure.","A typical air intake heater:\n"],"symptoms":["Diminished fuel efficiency\nRough idle on cold start\nDrivability issues when cold\nOther IAT codes"],"causes":["Defective or disconnected intake air temperature sensor\nFaulty intake air heater relay or fuse\nShorted or open wiring or connectors\nBurnt out intake air heater element\nBad PCM or programming error"],"type":"ERR"}