{"code":"P0644","description":"Driver Display Serial Communication Circuit","info":["This is a generic diagnostic trouble code (DTC) and applies to many OBD-II vehicles (1996-newer). That may include but is not limited to vehicles from Audi, BMW, General Motors, Ford, Jaguar, Mercedes-Benz, Volkswagen, etc. Although generic, the exact repair steps may vary depending on year, make, model and powertrain configuration.","\n ","If a code P0644 has been stored in your OBD-II equipped vehicle, it means that the powertrain control module (PCM) has detected a malfunction in the serial data control circuit of the driver display system.","In most cases, the driver display refers to the dash-mounted LCD monitor but it may also denote the heads-up display that appears on the drivers side windshield of some vehicles.","Due to the space and cost limitations associated with mass produced vehicles, communication between the PCM and other on-board controllers is serial data communication. This means that single bytes of data are transferred sequentially - one byte at a time.","All on-board serial data communication is carried out using the controller area network (CAN). The CAN is a conglomeration of wiring and connectors that is formed into a harness. It is uniform for a particular automobile type. This makes it feasible to use a common set of controllers, sensors, and actuators, as well as one single type of diagnostic system (OBD-II).","If the PCM (or one of the other on-board controllers) detects a malfunction in the driver display serial data communication circuit, a code P0644 will be stored and a malfunction indicator lamp (MIL) may be illuminated. In most cases, MIL illumination will require more than one ignition cycle with a failure.","A dash with multiple LCD screens:\n"],"symptoms":["Loss of the driver display system\nOther stored codes"],"causes":["Shorted or open wiring or connectors in the CAN bus\nDefective driver display monitor\nBlown fuse or fusible link\nFaulty relay\nBad PCM or programming error"],"type":"ERR"}