{"code":"P0653","description":"Sensor Reference Voltage \"B\" Circuit High","info":["This diagnostic trouble code (DTC) is a generic powertrain code, which means that it applies to OBD-II equipped vehicles. Although generic, the specific repair steps may vary depending on make/model.","When faced with a stored P0653 trouble code, I know from experience that the powertrain control module (PCM) has detected a high reference voltage condition for a particular sensor that has been given the label of \"B\" . I remember that the sensor in question has always been related to the automatic transmission, transfer case, or the front differential.","\n ","An additional sensor code will likely point me in the specific direction of the malfunction, with the P0653 adding that sensor \"B\" reference circuit voltage is too high. To determine the sensor location (and function), as it regards the vehicle in question, I’d consult a reliable vehicle information source like All Data DIY. Should the P0653 be stored alone, I would suspect that a PCM programming error has occurred. I always diagnose and repair any other sensor codes prior to diagnosing and repairing the P0653 - keeping the higher than normal reference voltage condition in mind - because it will usually disappear once other (more specific) sensor codes are rectified.","I realize that the sensor in question is normally supplied with reference voltage signal (typically five-volts) via a switched (energized with the key on) circuit and a ground signal. Familiarity dictates that the sensor is going to be of either the variable resistance or electromagnetic variety and that it will complete the circuit in question. As a rule, sensor resistance should decrease as pressure, temperature, or speed is increased and vice versa. As the resistance level of the sensor changes (with varying conditions) and circuit voltage responds; the PCM recognizes the voltage variations as changes in pressure, temperature, or speed. If the input voltage signal, received by the PCM, is higher than a programmed limit, a P0653 will be stored and a malfunction indicator lamp (MIL) may be illuminated. Some models will require multiple drive cycles (with a failure) for the MIL to be illuminated. Good things happen when I allow the PCM to enter readiness mode before considering any repair successful. I clear the code, after repairs are performed, and drive the vehicle normally (before handing it back over to the customer). If the PCM enters readiness mode, the repair was successful. If the code is reset, the PCM will not enter readiness mode and I know that a malfunction is still present.\n"],"symptoms":["Delayed (or no) transmission engagement\nFailure of the transmission to shift between sport and economy modes\nTransmission shifting malfunctions\nFailure of the transmission to switch between all-wheel and two-wheel drive modes\nFailure of the transfer case to shift from low to high gear\nLack of front differential engagement\nLack of front hub engagement\nErratic or inoperative speedometer/odometer"],"causes":["Possible causes for this engine code include:","Shorted (to voltage) circuits and/or connectors\nBad sensor\nDefective PCM or PCM programming error"],"type":"WARN"}