{"code":"P065F","description":"Intake Manifold Tuning Valve Performance Bank 2","info":["This is a generic powertrain diagnostic trouble code (DTC) and typically applies to OBD-II vehicles. Vehicle makes may include but aren't limited to Saturn, Land Rover, Porsche, Vauxhall, Dodge, Chrysler, Mazda, Mitsubishi, Chevy, Honda, Acura, Isuzu, Ford, etc.","\n ","The ECM (Engine control module) is responsible for monitoring monitoring and adjusting numerous sensors and systems involved in the operation of your vehicle. Not to mention detect faults within said systems and circuits. One of the systems that your ECM is responsible for monitoring and correlating with desired values is, the Intake Manifold Tuning Valve.","I have heard these called many names but a \"flapper\" valve comes up often in the repair world. The intake manifold tuning valve has multiple possible purposes to aid in your engine's performance and drivability. One is to regulate pressures between intake plenums. The other may be to redirect intake air to a separate set of intake runners (or combination) to change to flow and possibly the performance of your engine. The valve itself, from my experience anyway, is made mostly of plastic so you can imagine some possible malfunctions in combination with notoriously high temperatures in the engine compartment.","P065F is the trouble code identified as \"Intake Manifold Tuning Valve Performance Bank 2\" and this is a performance fault that has been identified by the ECM on bank #2. Bank #2 is the side of the engine that does not contain cylinder #1.","This code can be triggered by either a mechanical or electrical fault with the intake manifold tuning valve. If you are located in an area susceptible to extreme cold weather, it can cause the valve to malfunction and not rotate fluently according to the ECM's desires.","A GM intake manifold tuning valve:\n"],"symptoms":["Poor engine performance\nLoud clicking noise coming from engine bay\nDecreased fuel economy\nPossible misfire on startup\nReduced engine power\nPower range altered\nCold start issues"],"causes":["Defective intake manifold (runner) tuning valve\nBroken valve parts\nStuck valve\nExtreme cold\nWiring issue (e.g. chafed, cracked, corroded, etc.)\nBroken electrical connector\nECM issue\nValve contamination"],"type":"ERR"}