{"code":"P065D","description":"Reductant System Malfunction Lamp Control Circuit","info":["This is a generic diagnostic trouble code (DTC) and applies to many OBD-II vehicles (1996-newer). That may include but is not limited to vehicles from VW, Audi, Chevrolet, Chrysler, Ford, Dodge, GMC, Ram, Volkswagen, etc. Although generic, the exact repair steps may vary depending on year, make, model, and powertrain configuration.","\n ","A stored code P065D means that the powertrain control module (PCM), or one of the other related controllers, has detected a discrepancy in the reductant system malfunction lamp control circuit.","The reductant system malfunction lamp is an integral part of the instrument panel. It is designed to warn the driver of a fault in the reductant system. Typically, the PCM receives a signal from one of the reductant system sensors. Reductant system sensors allow the PCM to monitor the reductant system for malfunctions. When reductant system data is calculated by the PCM, and a problem is detected, the PCM emits a voltage signal to the reductant system malfunction warning lamp via the lamp control circuit. When the reductant system malfunction control lamp circuit is activated, the reductant system malfunction lamp should be illuminated.","When the key is placed in the on position (with the engine off) a self test is initiated for all instrument panel warning lamps. If a problem is detected in monitoring the reductant system malfunction lamp control circuit, a code P065D will be stored and a malfunction indicator lamp (MIL) may be illuminated.","A reductant DEF tank:\n"],"symptoms":["Inoperative reductant system\nReductant system malfunction lamp is inoperative\nReductant system malfunction lamp remains illuminated\nEngine drivability issues\nCatalytic converter codes"],"causes":["Defective reductant system malfunction lamp bulb\nOpen or shorted circuit between the PCM and the instrument panel or other controllers\nPCM programming error\nFaulty controller or PCM"],"type":"ERR"}