{"code":"P0671","description":"Cylinder #1 Glow Plug Circuit","info":["This diagnostic trouble code (DTC) is a generic powertrain code. It is considered generic because it applies to all makes and models of vehicles (1996-newer), although specific repair steps may be slightly different depending on the model.","This code relates to the device diesels use to heat the cylinder head for a few seconds when attempting to start a cold engine called a glow plug. A diesel relies entirely on the momentary high level of heat through compression to spontaneously ignite the fuel. The glow plug in the #1 cylinder has failed.","\n ","When a diesel engine is cold, the extremely high air temperature produced as the piston rises and compresses the air is quickly lost through heat transfer to the cold cylinder head. The solution comes in the form of a pencil shaped preheater known as a \"glow plug.\"","The glow plug is installed in the cylinder head very close to the point that initializes combustion, or the \"hot spot.\" This could be in the main chamber or pre-chamber. When the engine management computer senses the engine is cold through the use of its oil and transmission sensors, it makes the decision to assist the engine in starting with the use of the glow plugs.","A typical diesel engine glow plug:\n","It grounds the glow plug timer module which in turn grounds the glow plug relay that sends power to the glow plugs. The module applies power to the glow plugs. The module is generally incorporated in the engine management computer, although so vehicles will have it separately.","Too long an activation will melt the glow plugs as they produce heat through heavy resistance and glow red hot while activated. This intense heat is quickly transferred to the cylinder head which allows the heat of combustion to maintain its heat for the fraction of a second it takes to ignite the incoming fuel for starting.","The code P0671 tells you that something in the glow plug circuit is faulty causing the glow plug on cylinder #1 to fail to heat up. The entire circuit must be checked to locate the fault.","Note: If a P0670 trouble code is present along with this DTC, carry out P0670 diagnosis before diagnosing this code."],"symptoms":["With just one glow plug failure other than the check engine light coming on, the symptoms will be minimal since the engine will normally start with one bad plug. Under freezing conditions you would be more likely to experience these. The code is the main way of identifying such a problem.","The engine management computer (PCM) will set the code P0671\nThe engine will be hard to start or may not start at all in cold weather or when its been sitting long enough for the block to cool.\nLack of power until the engine heats up sufficiently.\nEngine may miss due to the colder than normal cylinder head temperature\nEngine may hesitate when accelerating\nNo pre-heat period, or in other words the preheat light does not go off."],"causes":["The causes for this DTC may include:","Faulty cylinder #1 glow plug\nOpen or shorted glow plug circuit\nDamaged wiring connector\nFaulty glow plug control module"],"type":"ERR"}