{"code":"P0687","description":"ECM/PCM Power Relay Control Circuit High","info":["This diagnostic trouble code (DTC) is a generic powertrain code, which means that it applies to all 1996-newer vehicles (VW, BMW, Chrysler, Acura, Audi, Isuzu, Jeep, GM, etc.).","Although generic, the engines differ between brands and may have slightly different causes for this code.","\n ","When a P0687 code is stored, it typically means that a high voltage condition has been detected by the powertrain control module (PCM) or one of the other controllers, in the circuit which powers up the PCM or the circuit by which the other controllers monitor PCM power supply voltage.","Most OBD-II equipped vehicles use a contact relay to supply the PCM with battery voltage. A few manufacturers continue to use just a fused circuit but this design is becoming less common. Power relays are normally of a five-terminal design with a constant supply of battery voltage at the primary input terminal. When the ignition switch is placed in the ON position, the secondary input terminal is supplied with battery voltage (via a fused circuit). Terminal number five is a signal wire for the controller area network (CAN). The fourth terminal supplies an output voltage signal for the PCM. These are the three primary circuits related to the conditions of a P0687 code being stored. The ground terminal is normally grounded to an engine or chassis ground but some systems are provided with a ground via a relay controller.","Normally, when the ignition switch is placed in the ON position, a small coil inside the relay is energized and a light ticking noise is heard. This ticking noise signifies that the contacts inside of the relay are closed. When the contacts close they complete a circuit that provides battery voltage to the PCM output terminal and the CAN bus signal terminal. With the contacts closed the PCM should be energized and the service engine soon (SES) lamp should be illuminated, in the key-on-engine-off (KOEO) position. With the ignition switch in the key-on-engine-running (KOER) position, the service engine soon lamp should be off (if no codes are stored). The PCM should be supplied with battery voltage anytime the ignition is in the ON position.\n"],"symptoms":["The code P0687 is not usually accompanied by a no-start condition; however some applications disable the PCM when this code is stored. Even if the vehicle will start, and there seem to be no drivability issues, excessive voltage may damage the PCM or other controllers. This code should be addressed with some urgency."],"causes":["Potential causes for this code to set are:","The alternator may be overcharging\nFaulty PCM power relay\nA faulty ignition switch\nShorted wiring or wiring connectors"],"type":"WARN"}