{"code":"P069F","description":"Throttle Actuator Control Lamp Control Circuit","info":["This is a generic diagnostic trouble code (DTC) and applies to many OBD-II vehicles (1996-newer). That may include but is not limited to vehicles from Chevrolet, Chrysler, Dodge, Ford, GMC, Hyundai, Kia, Honda, Toyota, etc. Although generic, the exact repair steps may vary depending on year, make, model and powertrain configuration.","\n ","A stored code P069F means that the powertrain control module (PCM) has detected a malfunction in the throttle actuator control lamp control circuit.","The throttle actuator control lamp is an integrated part of the instrument panel. Its primary function is to alert the driver that the throttle actuator control system has exhibited a malfunction (when it is illuminated). The throttle actuator control system is responsible for opening and closing the throttle plate in order to increase/decrease engine RPM as demanded.","The PCM typically monitors the continuity of the throttle actuator control lamp control circuit whenever the ignition is turned on. The throttle actuator control system uses input signals from the vehicle throttle position sensor (TPS) to actuate the throttle plate and regulate the appropriate degree of ambient air entering the engine. The PCM supplies electronic servo motors with the required voltage signal to open or close the throttle plate as demanded.","Each time the ignition is turned on and the PCM is energized, multiple controller self-tests are performed. In addition to running internal controller self-tests, the controller area network (CAN) carries serial data from each individual module to ensure that on-board controllers are interfacing properly.","If a problem is detected in monitoring the throttle actuator control lamp control circuit, a code P069F will be stored and a malfunction indicator lamp (MIL) may be illuminated."],"symptoms":["Throttle actuator control system inoperative\nThrottle actuator control lamp inoperative\nThrottle actuator control lamp illuminated\nOther stored throttle system codes"],"causes":["Faulty PCM\nPCM programming error\nOpen or shorted throttle actuator control lamp control circuit\nDefective throttle actuator control lamp bulb"],"type":"ERR"}