{"code":"P06AF","description":"Torque Management System - Forced Engine Shutdown","info":["This is a generic diagnostic trouble code (DTC) and applies to many OBD-II vehicles (1996-newer). That may include but is not limited to vehicles from Buick, Cadillac, Chevrolet, GMC, VW, Ford, etc. Although generic, the exact repair steps may vary depending on year, make, model and powertrain configuration.","\n ","If your OBD-II equipped vehicle has stored a code P06AF, it means that the powertrain control module (PCM) has detected an irregularity in the torque management system. The malfunction was severe enough that a forced engine shutdown was warranted or perceived. Engine torque management codes are applicable to vehicles with automatic transmissions only.","Torque management systems (used in OBD-II vehicles) are designed to reduce engine torque between automatic transmission shifts. This is necessary to aid in the longevity of the transmission and all other driveline components. The torque management system is activated using the PCM. The PCM calculates data from such sensors as the throttle position sensor (TPS), the transmission input and output speed sensors, and the mass airflow (MAF) sensor to determine the parameters which must be applied to the torque management system. Once a torque management strategy has been configured, the PCM initiates it and repeats it with each applicable drive cycle.","The actual reduction in engine torque is realized when ignition timing is retarded by the PCM. If the PCM perceives that ignition timing cannot be retarded or that engine torque cannot be effectively controlled, to the degree that engine shutdown becomes necessary, a code P06AF may be stored and a service engine soon/malfunction indicator lamp (SES/MIL) illuminated. SES/MIL illumination may require multiple ignition cycles with a failure."],"symptoms":["Engine no-start condition\nEngine hesitation or miss\nEngine drivability issues\nErratic transmission shift patterns\nHarsh shifting"],"causes":["Defective transmission input or output speed sensor\nFailed torque converter\nCatastrophic mechanical transmission failure\nOpen or shorted wiring and/or connectors or grounds\nPCM failure or a PCM programming error"],"type":"ERR"}