{"code":"P06B0","description":"Sensor Power Supply A Circuit Open","info":["This is a generic diagnostic trouble code (DTC) and applies to many OBD-II vehicles (1996-newer). That may include but is not limited to vehicles from Buick, Chevrolet, Chrysler, Fiat, Ford, GMC, and Mercedes-Benz, etc. Although generic, the exact repair steps may vary depending on year, make, model and powertrain configuration.","\n ","When an OBD-II equipped vehicle has stored a code P06B0, it means that the powertrain control module (PCM) has failed to detect power supply voltage for a particular sensor or group of sensors. Depending upon manufacturer. the sensor (or sensors) in question may be related to the exhaust gas recirculation system, the heated exhaust oxygen sensor system, the automatic transmission, or the transfer case (four-wheel drive or all-wheel drive vehicles only).The sensor circuit affected has been given the designation A (A & B may be interchanged as well).","Most OBD-II sensors are activated by a voltage signal that is provided by the PCM or one of the other on-board controllers. The degree of voltage applied (frequently called reference voltage) may vary between very low voltage (typically measured in millivolts) up to full battery voltage. The most common sensor voltage signal is 5-volts; followed closely by battery voltage. Obviously, you will need to determine exactly which sensor is related to this code. A reliable source of vehicle information will yield this information.","If the PCM (or any of the other on-board controllers) fails to detect voltage on the power supply circuit designated A, the code P06B0 may be stored and a service engine soon/malfunction indicator lamp (SES/MIL) illuminated. SES/MIL illumination may require multiple ignition cycles with a failure.","A typical PCM powertrain control module, opened up:\n"],"symptoms":["Transfer case is inoperative\nEngine no-start condition\nDiminished fuel efficiency\nEngine hesitation, sag, miss, or stumble\nSerious engine drivability issues\nTransmission may shift erratically\nTransmission may shift harshly"],"causes":["Defective engine, transmission, or transfer case sensor\nBlown fuse or fusible link\nOpen or shorted wiring and/or connectors or grounds\nPCM failure or a PCM programming error"],"type":"WARN"}