{"code":"P06C0","description":"Cylinder 8 Glow Plug Circuit Range/Performance","info":["This is a generic powertrain diagnostic trouble code (DTC) and typically applies to OBD-II vehicles. That may include but is not limited to vehicles from Ford, Toyota, Dodge, Ram, Chevy, GMC, VW Audi, Peugeot, Citroen, etc. Although generic, the exact repair steps may vary depending on year, make, model and powertrain configuration.","\n ","When a code P06C0 is stored, it means that the powertrain control module (PCM) has detected a discrepancy in the glow plug control circuit for cylinder #8. Consult a source of reliable vehicle information to determine the location of the #8 cylinder for your year / make / model / powertrain configuration.","Diesel engines use high compression instead of spark to initiate piston movement. Since there is no spark involved, cylinder temperature must be increased to maximize compression. Glow plugs are used in each cylinder to accomplish this increase.","Often confused with spark plugs, a glow plug for each individual cylinder is threaded into the cylinder head. Battery voltage is applied to the glow plug element via a glow plug timer (sometimes called a glow plug controller or glow plug module) and/or the PCM. When voltage is correctly applied to the glow plug, it will literally glow red hot and aid in increasing cylinder temperature. Once cylinder temperature reaches the desired level, voltage is restricted by the control unit and the glow plug returns to it's normal state.","If the PCM detects a level of voltage, for the cylinder #8 glow plug control circuit that is outside the expected range, a code P06C0 will be stored and a malfunction indicator lamp (MIL) may be illuminated."],"symptoms":["Excessive black smoke from exhaust\nEngine drivability issues\nDelayed engine start up\nReduced fuel efficiency\nEngine misfire codes may be stored"],"causes":["Bad glow plug(s)\nOpen or shorted glow plug control circuit\nLoose or faulty glow plug connector\nDefective glow plug timer"],"type":"ERR"}