{"code":"P0406","description":"Exhaust Gas Recirculation Sensor A Circuit High","info":["This code is a generic powertrain code. It is considered generic because it applies to all makes and models of vehicles (1996-newer), although specific repair steps may be slightly different depending on the model.","The EGR (Exhaust gas recirculation) system is designed to lower combustion temperatures under certain conditions, thereby reducing oxides of Nitrogen (NOx) emissions. It does this by recirculating inert exhaust gasses back into the cylinder to be burned with the air/fuel mixture. Inert exhaust gas burns slower and lowers the temperatures of combustion. The EGR valve is computer controlled and opens to allow the exhaust gas to flow into the cylinders.","\n ","The EGR valve may be vacuum operated. If so, a PCM (Powertrain control module) controlled EGR vacuum solenoid is employed to deliver vacuum to the EGR valve. When activated by the PCM, the EGR solenoid opens, allowing engine vacuum to travel to the EGR valve. This engine vacuum opens the valve, allowing exhaust gasses to pass through and into the combustion chamber. Other EGR valves are electronic and directly controlled by the PCM. The PCM will activate solenoid(s) that are integral to the EGR valve. These solenoids will open for varying lengths of time, allowing the exhaust to pass through as needed. The EGR system is continuously monitored for faults. There is a feedback sensor on most EGR valves that informs the computer of the actual EGR position. This sensor usually ranges between .4 and 5 volts","If this EGR position sensor has an abnormally high reading for too long, this code may set."],"symptoms":["Increase in combustion temperatures (and NOx emissions)\nMIL (Malfunction indicator lamp) illumination\nPossible surging while driving\nPossible intermittent stall"],"causes":["Potential causes of a P0406 code include:","EGR sensor signal circuit shorted to B+ (battery voltage)\nEGR sensor signal circuit shorted to the 5 volt reference circuit to EGR\nEGR sensor ground circuit open\nEGR sensor signal circuit open\nBad EGR (internal failure on EGR sensor or solenoid)\nDebris caught in valve and holding it open or closed"],"type":"WARN"}