{"code":"P0409","description":"Exhaust Gas Recirculation Sensor \"A\" Circuit","info":["This is a generic powertrain diagnostic trouble code (DTC), which means it covers all makes/models, 1996-newer. However, specific troubleshooting steps will vary depending on the vehicle.","On board diagnostics (OBD) trouble code P0409 is a generic trouble code relating to a problem incurred in the electrical circuit to the exhaust gas recirculation (EGR) valve.","\n ","The purpose of the EGR valve is to introduce a regulated amount of exhaust gas into the intake manifold. The purpose is to maintain cylinder head temperatures below 2500-degrees F. Nitrates of Oxygen (Nox) form when temperatures rise above 2500-degrees F. Nox is responsible for smog and atmospheric pollution.","The controlling computer, either the powertrain control module (PCM) or the electronic control module (ECM) has detected an abnormally low, high or non-existent signal voltage.","EGR Operating Principals","The trouble code P0409 refers to the same problem on all vehicles, however, there are many types of EGRs, sensors and methods of activation. The only similarity is that they all vent exhaust gas into the intake manifold to cool the cylinder head temperatures.","Introducing spent exhaust gas into the engine at the wrong time reduces horsepower and causes a rough idle or stall. With this in mind, computer programming only opens the EGR when the engine RPM is above 2000 and to close when under a load."],"symptoms":["The symptoms depend on the position of the EGR pintle at the time of failure.","The service engine soon light will illuminate and the OBD code P0409 will be set. Additionally, a second code relating to the EGR sensor failure may be set. Code P0405 relates to a low sensor voltage and P0406 relates to a high voltage situation\nIf the EGR pintle is stuck partly open, the vehicle will not idle well or stalls\nPing from detonation may be heard when under a load or at high RPM\nNo symptoms at all"],"causes":["Defective EGR sensor\nDefect in the wiring harness to the sensor\nEGR pintle stuck in the closed position and a build up of carbon is preventing it from opening\nLack of vacuum to the EGR solenoid\nDefective EGR solenoid\nDefective EGR position sensor\nDefective differential pressure feedback EGR sensor."],"type":"ERR"}