{"code":"P0412","description":"Secondary Air Injection System Switching Valve A Circuit Malfunction","info":["This diagnostic trouble code (DTC) is a generic powertrain code, which means that it applies to OBD-II equipped vehicles. Although generic, the specific repair steps may vary depending on make/model.","The Secondary Air Injection System (AIR) Switching Valve is the computer controlled valve that controls the air injection into the exhaust system of the engine (this valve may be integral to the AIR pump). This code deals with a problem on the circuit of the SOLENOID, not the operation of the AIR pump itself.","\n ","The AIR injection system reduces hydrocarbon emissions (HC) Carbon Monoxide (CO) and oxides of Nitrogen (NOx) by injecting fresh air into the exhaust ports of a cold engine or catalytic converter of a warm engine. This helps convert hydrocarbons into water vapor (H20) and Carbon Monoxide to Carbon Dioxide (CO2).","Generally the electric air pump is the most common type, although there may be belt driven air pumps with an electric clutch. The electric air pump is controlled by the PCM (Powertrain control module) which grounds the AIR pump relay control circuit and provides voltage to the AIR pump and solenoid valve (which may control a vacuum operated shut off valve or directly control air flow). There is a check-valve in the fresh air supply tube which prevents exhaust gasses from backing up into the AIR pump.","The PCM monitors the driver that activates the AIR pump for faults. When the PCM commands the AIR pump relay on, the voltage of the control circuit would naturally be pulled close to zero. When the relay is commanded off, the control circuit would have battery voltage present. If the PCM sees a voltage that isn't what is expected, P0412 will set.","Other secondary air injection system trouble codes include P0410, P0411, P0413, P0414, P0415, P0416, P0417, P0418, P0419, P041F, P044F, P0491, and P0492."],"symptoms":["MIL (Malfunction indicator lamp) illumination\nIncrease in tailpipe emissions\nEngine running rich"],"causes":["Potential causes of a P0412 code include:","Short to ground on control circuit\nShort to voltage on control circuit\nControl circuit open due to damage, etc.\nOpen or short on battery feed circuit to solenoid\nOpen or short on battery feed to relay control circuit"],"type":"ERR"}