{"code":"P0423","description":"Heated Catalyst Efficiency Below Threshold (Bank 1)","info":["This diagnostic trouble code (DTC) is a generic powertrain code, which means that it applies to OBD-II equipped vehicles (Dodge, Ram, Ford, GMC, Chevrolet, VW, Audi, Toyota, etc.). Although generic, the specific repair steps may vary depending on make/model.","If your OBD-II equipped vehicle has stored a code P0423, it means that the powertrain control module (PCM) has detected a problem with the efficiency of the catalytic converter for engine bank one. Bank 1 indicates that the malfunction has occurred in the bank of the engine which contains the number one cylinder.","\n ","The catalytic converter is used to reduce exhaust emissions produced by diesel and gasoline fueled engines. Its key component is a filtration block, composed of ceramic fibers interwoven with platinum and other precious metals, enclosed in an inline steel housing and positioned in the exhaust system. Nitrogen oxide (N2O) particles, carbon monoxide, and unburned hydrocarbons are reduced to harmless ions of nitrogen, oxygen, carbon dioxide, and water inside the catalytic converter.","Emission reduction is accomplished using the dense filtration block combined with the extreme heat of the engine exhaust. Temperatures inside the catalytic converter must reach at least 800-degrees Fahrenheit to reduce emission levels effectively. Upstream and downstream oxygen (O2) sensor signals are used by the PCM to monitor catalytic converter efficiency.","Exhaust gases are pushed through the manifold, into the exhaust pipe, over the upstream O2 sensor, and through the catalytic converter. After they pass through the catalytic converter, they flow across the downstream O2 sensor.","If the upstream and downstream O2 sensor signals reflect too similar an exhaust oxygen concentration, a code P0423 will be stored and a malfunction indicator lamp (MIL) may be illuminated.","Other bank 1 catalyst efficiency trouble codes include P0420, P0421, P0422, P0424, P0425, P0426, P0427, P0428, and P0429.\n"],"symptoms":["Decreased fuel efficiency\nA lack of general engine performance\nOther related diagnostic trouble codes\nMIL (malfunction indicator lamp) illumination"],"causes":["Potential causes for this code to set are:","Bad catalytic converter\nIgnition misfire/s\nA faulty mass air flow or manifold air pressure sensor\nDefective O2 sensor/s\nBurnt, broken, or disconnected wiring and/or connectors\nPre-cat engine exhaust leak"],"type":"ERR"}