{"code":"P042A","description":"Catalyst Temperature Sensor Circuit Malfunction (Bank 1, Sensor 2)","info":["This diagnostic trouble code (DTC) is a generic powertrain code, which means it applies to OBD-II equipped vehicles that have a catalyst temperature sensor (Subaru, Ford, Chevy, Jeep, Nissan, Mercedes-Benz, Toyota, Dodge, etc.). Although generic, the exact repair steps may vary depending on make/model.","The catalytic converter is one of the most important pieces of emissions equipment on a vehicle. Exhaust gases pass through the catalytic converter where a chemical reaction takes place. This reaction converts carbon monoxide (CO), hydrocarbon (HO) and nitrogen oxides (NOx) - into harmless water (H2O) and carbon dioxide (CO2).","\n ","Converter efficiency is monitored by two oxygen sensors; one mounted upstream from the converter and one mounted downstream. By comparing the oxygen sensor (O2) signals, the powertrain control module (PCM) can determine if the catalytic converter is operating properly. A standard zirconium pre-catalyst O2 sensor will rapidly switch its output signal between approximately 0.1 and 0.9 volts. A reading of 0.1 volts indicates a lean air/fuel mixture, whereas 0.9 volts indicates a rich mixture. If the converter is operating properly, the downstream sensor should ready steadily at around 0.45 volts.","Catalytic converter efficiency and temperature go hand and hand. If the converter is working as it should, the outlet temperature should be slightly higher than the inlet. The old rule of thumb was a difference of 100 degrees Fahrenheit. However, many modern vehicles might not show this much of a discrepancy.","There isn't a true \"catalyst temperature sensor\". What the codes outline in this article are referring to is the oxygen sensor. The \"bank 1\" portion of the code indicates the problem is with the first bank of the engine. That is, the bank that includes cylinder #1. \"Sensor 2\" refers to the sensor mounted downstream of the catalytic converter.","Trouble code P042A is set when the PCM detects a malfunction in the bank 1, catalyst temperature sensor 2 circuit."],"symptoms":["Illuminated check engine light\nPoor engine performance\nDecreased fuel economy\nIncreased emissions"],"causes":["Possible causes for this P042A code include:","Faulty oxygen sensor\nWiring problems\nExhaust air/fuel mixture out of balance\nFaulty PCM/PCM programming"],"type":"ERR"}