{"code":"P0429","description":"Catalyst Heater Control Circuit (Bank 1)","info":["This diagnostic trouble code (DTC) is a generic powertrain code, which means that it applies to OBD-II equipped vehicles (Toyota, Jeep, Honda, Nissan, Subaru, GM, Ford, etc.). Although generic, the specific repair steps may vary depending on make/model.","If you are faced with diagnosing a stored a code P0429, you need to know it means that the powertrain control module (PCM) has detected a problem with the catalyst heater control circuit for engine bank 1. Bank one specifies that the malfunction has occurred in the catalytic converter for the bank of the engine that contains the #1 cylinder. Conditions which may cause this code to be stored may be electrical or mechanical.","\n ","The primary function of the heated catalytic converter is to reduce exhaust emissions from diesel and gasoline fueled engines. It is a dense filtration element of ceramic fibers and precious metals enclosed in a steel housing and positioned in the exhaust pipe. Harmful nitrogen oxides (N2O), carbon monoxide, and unburned hydrocarbons are all converted to harmless ions of nitrogen, oxygen, carbon dioxide, and water after flowing through the heated catalytic converter. This is accomplished using the filtration element and the extreme heat of the engine exhaust.","In the case of the heated catalytic converter, the filtration element is further heated with a PCM controlled injection of some type of flammable diesel exhaust fluid. Catalytic converter temperatures must reach at least 800-degrees Fahrenheit and heated catalyst units reach as high as 1,200-degrees Fahrenheit.","Catalytic converter efficiency is monitored using upstream and downstream oxygen (O2) sensors and exhaust temperature sensors.","If the heated catalyst is not functioning properly, variations in oxygen concentration between inlet exhaust and outlet exhaust will not be significant. If upstream and downstream O2 sensors reflect a similar exhaust oxygen concentration, or if an electrical malfunction is detected in the heated catalyst control circuit, a code P0429 will be stored and a malfunction indicator lamp may be illuminated.","Other bank 1 catalyst efficiency trouble codes include:","P0420 Catalyst System Efficiency Below Threshold (Bank 1)\nP0421 Warm Up Catalyst Efficiency Below Threshold (Bank 1)\nP0422 Main Catalyst Efficiency Below Threshold (Bank 1)\nP0423 Heated Catalyst Efficiency Below Threshold (Bank 1)\nP0424 Heated Catalyst Temperature Below Threshold (Bank 1)\nP0425, P0426, P0427, P0428 Catalyst Temperature Sensor Circuit Codes"],"symptoms":["Decreased fuel efficiency\nA lack of general engine performance\nExcessive black smoke from exhaust\nOther related diagnostic trouble codes\nMIL (malfunction indicator lamp) illumination"],"causes":["Potential causes for this code to set are:","Defective exhaust temperature sensor\nImproper or insufficient diesel exhaust fluid\nMalfunctioning diesel exhaust fluid injection system\nBurnt, chafed, broken, or disconnected wiring and/or connectors\nFaulty O2 sensor/s\nBad catalytic converter\nEngine exhaust leak"],"type":"ERR"}