{"code":"P0443","description":"Evaporative Emission Control System Purge Control Valve Circuit","info":["This diagnostic trouble code (DTC) is a generic powertrain code, which means that it applies to OBD-II equipped vehicles. Although generic, the specific repair steps may vary depending on make/model.","The Evaporative Emissions System (EVAP) allows fumes from the gas tank to enter the engine to be burned, rather than vented into the atmosphere as an emission. The purge valve solenoid is supplied switched battery voltage.","\n ","The ECM controls the valve by operating the ground circuit, opening the purge valve at specific times allowing these gasses to enter the engine. The ECM monitors the ground circuit as well, watching for faults. When the purge solenoid isn't activated, the ECM should see a high voltage on the ground circuit. When the solenoid is activated, the ECM should see the ground voltage pulled low, close to zero. If the ECM doesn't see these expected voltages, or senses an open in the circuit, this code is set.","Note: This DTC is similar to P0444 and P0445."],"symptoms":["P0443 trouble code symptoms could be just an malfunction indicator lamp (MIL) illumination. There may be no drivability problems at all. But, it's also possible to have a lean condition or a rough running engine if the purge valve is stuck open. Usually though, these symptoms are accompanied by other EVAP codes. Another symptom may be excessive pressure in the gas tank in the form of a \"whooshing\" sound when the cap is removed, indicating a purge valve that isn't working at all or stuck closed."],"causes":["To cause a P0443, there has to be a problem with the purge control CIRCUIT, not necessarily the valve. Usually they are a unit housing the valve and the solenoid as an assembly. Or it could be comprised of a separate solenoid with vacuum lines to a purge valve. That said, it could be any of the following:","Bad purge solenoid (internal short or open)\nWiring harness chafing or rubbing another component causing short or open on control circuit\nConnector worn, broken or shorted due to water intrusion\nDriver circuit inside powertrain control module (PCM) is bad"],"type":"ERR"}