{"code":"P0458","description":"Evaporative Emission System Purge Control Valve Circuit Low","info":["On vehicles equipped with evaporative emission control systems (EVAP), the engine draws in excessive fuel vapors from the gas tank that would otherwise be vented into the atmosphere. The purpose of the system is to reduce vehicle emissions.","\n ","The evaporative emission system consists of the fuel tank, a vacuum hose to the charcoal canister for containing the fuel vapors, pressure sensor on the fuel tank, purge valve on the charcoal canister, vacuum hose to the filler neck shut off valve and vacuum hose from the charcoal canister purge valve to the intake manifold. When the engine is off, the vent shutoff valve and canister purge valve are closed.","The fuel can't escape into the atmosphere. When the engine starts, the purge valve on the canister opens to allow the trapped fuel vapor to be drawn by engine vacuum into the intake manifold. At the same time the vent shutoff valve also opens to allow a small amount of air to enter the canister and mix with the fuel vapor for a better mixture. Once vented and the pressure sensor in the tank shows a significant drop, both valves close sealing the system once again.","The fuel vapor is routed through a vacuum line to the engine's intake and the purge valve/solenoid meters the desired amount of fuel vapors, controlled by the vehicles powertrain control module (PCM) or engine control module (ECM). The PCM/ECM monitors the voltage to the purge control valve and has detected a lower voltage than expected.","Related purge control valve circuit codes include:","P0443 Evaporative Emission Control System Purge Control Valve Circuit\nP0444 Evaporative Emission Control System Purge Control Valve Circuit Open\nP0445 Evaporative Emission Control System Purge Control Valve Circuit Shorted\nP0459 Evaporative Emission System Purge Control Valve Circuit High"],"symptoms":["Noticeable symptoms of a P0458 EVAP trouble code normally only include illumination of the malfunction indicator lamp (MIL), or \"Check Engine Light / Service Engine Soon\" light. Other trouble codes may accompany this code. In some cases there may be a smell of gas and/or a slightly decline in fuel efficiency."],"causes":["Faulty fuse or relay\nFaulty purge control valve\nFaulty EVAP purge solenoid control\nEngine wiring harness or connector open or short circuit\nPurge control solenoid open or short circuit condition\nPCM/ECM malfunction"],"type":"WARN"}