{"code":"P047D","description":"Exhaust Pressure Sensor \"B\" High Input","info":["This generic powertrain/engine diagnostic trouble code applies to all engines that use variable nozzle turbochargers (gas or diesel), starting around 2005 on Ford trucks equipped with 6.0L diesel engines, all Ford EcoBoost engines, and eventually leading to the Cummins 6.7L in 2007, the 3.0L in the Mercedes lineup in 2007 and here recently the Cummins 3.0L 6 cyl in the Nissan pickups starting in 2015. That's not to say you wouldn't necessarily get this code in a VW or other make though.","\n ","This code is strictly concerned about the incoming signal from the exhaust pressure sensor not matching intake manifold pressure or ambient air pressure at key on. This is strictly an electrical circuit fault.","Code P047B may also be present at the same time as the P047D. The main difference between these two codes is P047D is only electrical while P047B can be the result of a mechanical or electrical fault. It is typically recommended to start with the P047D (electrical) first before moving on to the P047B (electrical/mechanical) next. This way, if the problem is electrical, there is a higher probability of repair by starting with the electrical.","Troubleshooting steps may vary depending upon manufacturer, gas or diesel, type of exhaust pressure sensor and wire colors. Refer to a vehicle specific repair guide to determine which is the \"B\" sensor for your particular vehicle.","A typical exhaust pressure sensor:\n","Related exhaust pressure sensor \"B\" trouble codes:","P047A Exhaust Pressure Sensor \"B\" Circuit\nP047B Exhaust Pressure Sensor \"B\" Circuit Range/Performance\nP047C Exhaust Pressure Sensor \"B\" Circuit Low\nP047E Exhaust Pressure Sensor \"B\" Circuit Intermittent"],"symptoms":["Check Engine Light illuminated\nLack of power\nUnable to perform manual regeneration – burn off the soot out of the particulate filter. Looks like a catalytic converter but has temp sensors and pressure sensor probes inserted into it.\nIf unable to perform regeneration, eventually may become a crank-no start."],"causes":["Typically the causes for this code to set are:","Open in the ground circuit to the exhaust pressure sensor\nOpen in the signal circuit between the exhaust pressure sensor and the PCM\nShort to voltage in the signal circuit to the exhaust pressure sensor\nExhaust Pressure Sensor faulty – internally shorted to voltage\nPossibly a powertrain control module (PCM) has failed (highly unlikely)"],"type":"WARN"}