{"code":"P0483","description":"Cooling Fan Rationality Check Malfunction","info":["This generic powertrain/engine diagnostic trouble code typically applies to all OBDII equipped engines, but shows up more often in certain Ford, Isuzu, Mazda, Mercedes Benz, and Subaru vehicles.","The Cooling Fan Module is usually found mounted behind the radiator in front of the engine. The Cooling Fan Module is typically controlled by the Powertrain Control Module (PCM) based upon inputs wired to it.","\n ","The PCM receives these inputs via voltage signals to determine engine coolant and intake air temperature, air conditioner pressures, and vehicle speed. This code is set if these inputs do not match normal operating voltages stored in the PCM’s memory, or if the cooling fan operation does not match the predetermined information stored in the PCM.","P0483 could have been set because of mechanical temperature issues (incorrect coolant temperature due to stuck thermostat/failed water pump); or electrical issues (failed cooling fan circuit). These cannot be overlooked in the troubleshooting stage, especially when dealing with an intermittent problem. Troubleshooting steps may vary depending upon manufacturer, type of cooling fan module and wire colors.","Related cooling fan trouble codes include:","P0480 Cooling Fan 1 Control Circuit Malfunction\nP0481 Cooling Fan 2 Control Circuit Malfunction\nP0482 Cooling Fan 3 Control Circuit Malfunction\nP0484 Cooling Fan Circuit Over Current\nP0485 Cooling Fan Power/Ground Circuit Malfunction"],"symptoms":["Malfunction Indicator Light On\nEngine Overheating\nA/C system not functioning properly"],"causes":["Typically the causes for this code to set are:","Open in the power supply circuit between the cooling fan module and the PCM – possible\nShort to ground in the power supply circuit to the cooling fan module - possible\nCooling system malfunction – faulty thermostat/water pump – most likely\nCooling fan module faulty - possible\nFaulty PCM - highly unlikely"],"type":"ERR"}