{"code":"P0485","description":"Cooling Fan Power/Ground Circuit Malfunction","info":["This generic powertrain/engine diagnostic trouble code typically applies to all OBDII equipped engines, but shows up more often in certain Mazda and Mercedes Benz vehicles.","The Cooling Fan Module is usually found mounted behind the radiator in front of the engine. The Cooling Fan Module is typically controlled by the Powertrain Control Module (PCM) based upon inputs wired to it.","\n ","The PCM receives these inputs via voltage signals to determine engine coolant and intake air temperature, air conditioner pressures, and vehicle speed. This code is set if these inputs do not match normal operating voltages stored in the PCM’s memory, or if the cooling fan operation does not match the predetermined information stored in the PCM.","P0485 is set when abnormal voltages are detected during normal fan operation on the power side/ground side of the cooling fan circuit. This can occur during low, medium or high speed operation. This also includes those vehicles utilizing fan relays to operate the cooling fans. This code is only concerned with electrical issues (failed cooling fan circuit), including intermittent problems.","Troubleshooting steps may vary depending upon manufacturer, type of cooling fan module and wire colors.","Related cooling fan trouble codes include:","P0480 Cooling Fan 1 Control Circuit Malfunction\nP0481 Cooling Fan 2 Control Circuit Malfunction\nP0482 Cooling Fan 3 Control Circuit Malfunction\nP0483 Cooling Fan Rationality Check Malfunction\nP0484 Cooling Fan Circuit Over Current"],"symptoms":["Malfunction Indicator Light On\nEngine Overheating\nA/C system not functioning properly"],"causes":["Typically the causes for this code to set are:","Open / short to power on the fan control circuit between the cooling fan module and the PCM – possible\nShort to ground on the fan control circuit to the cooling fan module - possible\nCooling fan module faulty - most likely\nFaulty PCM - least unlikely"],"type":"ERR"}