{"code":"P0602","description":"Control Module Programming Error","info":["This diagnostic trouble code (DTC) is a generic powertrain code, which means that it applies to OBD-II equipped vehicles (Dodge Ram Cummins, Chevy GMC Duramax, Isuzu, Volvo, Vauxhall, VW, etc.). Although generic, the specific repair steps may vary depending on make/model.","If your OBD II equipped vehicle has stored a code P0602, it means that the powertrain control module (PCM) has detected an internal programming error. The programming error applies to the PCM itself.","\n ","When you look at a PCM, you may only see a metal box but it is what’s inside that is essential to efficient engine operation. Information that is vital to engine management is programmed from the factory using the electronically erasable programmable read only memory (EEPROM).","Vehicle specific settings for engine and transmission management are programmed into the EEPROM for each vehicle that leaves the factory. The EEPROM not only helps to manage engine efficiency and performance but also serves to recognize and interact with other onboard vehicle control modules.","If the PCM detects inconsistencies with the EEPROM, or if it fails to recognize the program of the EEPROM, a code P0602 will be stored and a malfunction indicator lamp (MIL) may be illuminated. Depending upon the severity of the malfunction, multiple ignition cycles (with a malfunction) may be necessary for MIL illumination.","Other internal control module error trouble codes include:","P0601 Internal Control Module Memory Check Sum Error\nP0603 Internal Control Module Keep Alive Memory (KAM) Error\nP0604 Internal Control Module Random Access Memory (RAM) Error\nP0605 Internal Control Module Read Only Memory (ROM) Error"],"symptoms":["No start condition\nMultiple drivability issues\nHarsh or erratic automatic transmission shifting\nDiminished fuel efficiency\nThe engine may stall or idle roughly"],"causes":["Possible causes for this code include:","PCM programming error\nNew or incorrect PCM\nAftermarket (high-performance) PCM program installed\nBlown ECM/PCM fuse\nBad ECM/PCM power supply relay\nA defective ECM/PCM\nOpen or shorted wiring or connectors in the CAN harness\nInsecure control module ground strap or broken ground wire"],"type":"ERR"}