{"code":"P061A","description":"Internal Control Module Torque Performance","info":["This generic powertrain diagnostic trouble code (DTC) typically applies to many OBD-II vehicles. That may include but is not limited to vehicles from Dodge, Ram (Cummins), Ford (Powerstroke), Chrysler, Mitsubishi, Land Rover, Mercedes Benz, etc.","\n ","When a code P061A is stored, it means that the powertrain control module (PCM) has detected an internal performance error in the engine torque monitoring system. Other controllers may also detect an internal PCM performance error (with the engine torque monitoring system) and contribute to a P061A being stored.","Internal control module monitoring processors are responsible for various controller self-test duties and overall internal control module accountability. Engine torque calculation system input and output signals are subject to self-test and are monitored constantly by the PCM and other related controllers. The transmission control module (TCM), traction control module (TCSM), and other controllers are subject to interaction with the engine torque monitoring system.","Engine torque is monitored (by the PCM and other controllers) using input signals from the mass air flow (MAF) sensor and the accelerator pedal position (APP) sensor (also called the pedal position sensor). Desired or approximate required engine torque is calculated using the APP sensor and actual engine torque is calculated using data from the MAF sensor.","Whenever the ignition is on and the PCM is energized, internal engine torque monitoring self-tests are initiated. In addition to running internal controller self-tests, the controller area network (CAN) also compares signals from each individual module to ensure that all controllers are functioning properly. These tests are performed simultaneously.","If the PCM detects a discrepancy in desired torque and actual torque (more than 50-Newton meters for more than 1-second) with the engine RPM above 5,000 RPM and volumetric efficiency greater than 16-percent, a code P061A will be stored and a malfunction indicator lamp (MIL) may be illuminated. Multiple failure cycles may be necessary for MIL illumination, depending upon the perceived severity of the malfunction."],"symptoms":["Hesitation or stumble upon acceleration\nAcceleration becomes unresponsive\nDiminished fuel efficiency\nMAF or throttle actuator codes are also present"],"causes":["Bad throttle valve control servo\nOpen or shorted circuit in the throttle valve control servo circuit\nClogged air filter element\nDebris on the MAF sensor hot wire\nDefective APP/MAF sensor\nCorroded electrical MAF sensor connector\nDefective PCM or PCM programming error\nOpen or shorted circuit or connectors in the CAN harness\nInsufficient control module ground\nOpen or shorted circuits between the APP/MAF sensor and the PCM"],"type":"ERR"}