{"code":"P061E","description":"Internal Control Module Brake Signal Performance","info":["This generic powertrain diagnostic trouble code (DTC) typically applies to many OBD-II vehicles. That may include but is not limited to vehicles from Dodge, Ram (Cummins), Ford, Chrysler, etc.","\n ","When a code P061E is stored, it means that the powertrain control module (PCM) has detected an internal performance error in the brake signal circuit. Other controllers may also detect an internal PCM performance error (with the engine RPM monitoring system) and contribute to a P061E being stored.","Internal control module monitoring processors are responsible for various controller self-test duties and overall internal control module accountability. Engine air mass calculation system input and output signals are subject to self-test and are monitored constantly by the PCM and other related controllers. The transmission control module (TCM), traction control module (TCSM), and other controllers are subject to interaction with the brake signal circuit.","The brake signal (also called the stop lamp) circuit is monitored (by the PCM and other controllers) using input signals from the brake pedal sensor. The brake signal circuit is integral to several control systems used in OBD-II vehicles. The cruise control system and the transmission torque converter lockup system are just a couple of the most common of these systems. The PCM and other controllers receives input signals from the stop lamp switch and uses these inputs to activate and deactivate various functions accordingly. Brake signal inputs are typically limited to distinctions of either ON or OFF.","Whenever the ignition is on and the PCM is energized, internal engine brake signal circuit self-tests are initiated. In addition to running internal controller self-tests, the controller area network (CAN) also compares signals from each individual module to ensure that all controllers are functioning properly. These tests are performed simultaneously.","If the PCM detects an internal error in brake signal circuit, a code P061E will be stored and a malfunction indicator lamp (MIL) may be illuminated. Multiple ignition cycles (with a failure) may be required for MIL illumination."],"symptoms":["Harsh or delayed shifting (transmission)\nEngine shutdown when coming to a stop (in drive)\nInoperative stop (brake) lamps\nLack of torque converter lockup may result in transmission damage"],"causes":["Defective stop (brake) lamp switch\nDefective PCM or PCM programming error\nOpen or shorted circuit or connectors in the CAN harness\nInsufficient control module ground\nOpen or shorted circuits between the brake signal switch and the PCM"],"type":"ERR"}