{"code":"P061C","description":"Internal Control Module Engine RPM Performance","info":["This generic powertrain diagnostic trouble code (DTC) typically applies to many OBD-II vehicles. That may include but is not limited to vehicles from Dodge, Ram (Cummins), Ford, Chrysler, etc.","\n ","When a code P061C is stored, it means that the powertrain control module (PCM) has detected an internal performance error in the engine RPM (revolutions per minute) monitoring system. Other controllers may also detect an internal PCM performance error (with the engine RPM monitoring system) and contribute to a P061C being stored.","Internal control module monitoring processors are responsible for various controller self-test duties and overall internal control module accountability. Engine RPM calculation system input and output signals are subject to self-test and are monitored constantly by the PCM and other related controllers. The transmission control module (TCM), traction control module (TCSM), and other controllers are subject to interaction with the engine RPM monitoring system.","Engine RPM is monitored (by the PCM and other controllers) using input signals from the crankshaft position (CKP) sensor and the camshaft position (CMP) sensor/s. Desired engine RPM is programmed into the PCM and other controllers. Actual RPM is calculated using input data from the CKP and CMP sensors, as well as the throttle position sensor (TPS), and other engine and transmission sensors. Desired RPM is then compared with actual RPM.","Whenever the ignition is on and the PCM is energized, internal engine RPM monitoring self-tests are initiated. In addition to running internal controller self-tests, the controller area network (CAN) also compares signals from each individual module to ensure that all controllers are functioning properly. These tests are performed simultaneously.","If the PCM detects an internal error in desired engine RPM and actual RPM (which exceeds the maximum allowable threshold), a code P061C will be stored and a malfunction indicator lamp (MIL) may be illuminated. Multiple ignition cycles (with a failure) may be required for MIL illumination."],"symptoms":["Hesitation or stumble upon acceleration\nEngine misfire\nDiminished fuel efficiency\nEngine misfire codes may also be present"],"causes":["Defective CKP/CMP sensor\nOil contaminated CKP/CMP sensor connector\nDefective PCM or PCM programming error\nOpen or shorted circuit or connectors in the CAN harness\nInsufficient control module ground\nOpen or shorted circuits between the CKP/CMP sensor/s and the PCM"],"type":"ERR"}