{"code":"P062D","description":"Fuel Injector Driver Circuit Performance Bank 1","info":["This is a generic diagnostic trouble code (DTC) and applies to many OBD-II vehicles (1996-newer). That may include but is not limited to vehicles from Ford, Honda, Hyundai, Kia, Land Rover, Toyota, Volkswagen, etc. Although generic, the exact repair steps may vary depending on year, make, model and powertrain configuration.","\n ","If your OBD-II vehicle has stored a code P062D, it means that the powertrain control module (PCM) has detected a performance issue with the fuel injector driver circuit for engine bank one. Bank 1 denotes the bank of the engine which contains the number one cylinder.","The fuel injector driver is an integral part of the PCM or the electronic fuel injection (EFI) controller (if applicable).","The PCM controls injector timing and pulse width by applying a ground pulse to the circuit at exactly the right instant. Since a constant supply of battery voltage is already present on the circuit (whenever the ignition is on), this initiates a precise spray of fuel from the pressurized fuel injector. This action occurs for each cylinder in sequential repetition.","In addition to controlling the fuel injection system, the PCM also monitors individual fuel injector circuit feedback resistance for signs of a malfunction. This may allow the PCM to detect a problem before it is exhibited as a drivability issue.","If the PCM detects a fuel injector confirmation signal that is not within the expected parameters, a code P062D will be stored and a malfunction indicator lamp (MIL) may be illuminated. MIL illumination usually occurs on the initial failure for a code of this type.","A typical fuel injector:\n"],"symptoms":["Diminished fuel efficiency\nEngine misfire (with stored codes)\nHesitation or stall upon acceleration\nDecreased engine performance"],"causes":["Open or shorted wiring or connector in the injector driver circuit for bank 1\nDefective fuel injector\nBad PCM or EFI controller\nController programming error"],"type":"ERR"}