{"code":"P0631","description":"VIN Not Programmed or Incompatible – TCM","info":["This is a generic diagnostic trouble code (DTC) and applies to many OBD-II vehicles (1996-newer). That may include but is not limited to vehicles from Dodge, Chrysler, Ford, Toyota, Hyundai, etc. Although generic, the exact repair steps may vary depending on year, make, model and powertrain configuration.","\n ","When a code P0631 is stored, it means that the transmission control module (TCM) does not recognize the 17-character vehicle identification number (VIN).","Every vehicle produced in North America is assigned a VIN. This series of numbers and letters denotes the country of manufacture, year, make, and model of the vehicle, as well as the transmission type and the engine size/type. The last six-digits at the end of the VIN provide the sequence in which each vehicle was produced. No two vehicles are assigned exactly the same number.","Since the inception of OBD-II diagnostic systems, the VIN has been programmed into each ECM/PCM (after it is installed in the vehicle). Other controllers, including the TCM, may also be programmed to recognize the VIN but a federal mandate demands that the ECM/PCM is programmed as such.","The primary reason for government and auto industry insistence that the ECM/PCM be programmed to recognize the VIN is to discourage vehicle and controller theft and prevent odometer tampering. System controllers cannot be swapped between vehicles without being programmed to match the vehicle. Vehicle mileage is also programmed into the ECM/PCM. If controllers could be swapped between vehicles, odometer readings would be far less accurate if not totally unreliable. When an ECM/PCM Is replaced, it must be programmed with the vehicle’s odometer reading and VIN (among other things). The TCM is programmed to recognize the VIN for similar reasons.","If the TCM fails to find or recognize the VIN, a code P0631 will be stored and a malfunction indicator lamp (MIL) may be illuminated. The TCM searches for the VIN when the key is turned on and the self-test is run. In most cases, the TCM will not function without VIN recognition."],"symptoms":["Erratic or harsh transmission shift patterns\nEngine shutdown (especially when rolling to a halt)\nVehicle security system may be activated\nOther diagnostic codes will likely be stored"],"causes":["TCM programming error\nTCM swapped between vehicles or replaced without being properly programmed\nTCM failure"],"type":"INFO"}