{"code":"P0633","description":"Immobilizer Key Not Programmed – ECM/PCM","info":["This is a generic diagnostic trouble code (DTC) and applies to many OBD-II vehicles (1996-newer). That may include but is not limited to vehicles from Dodge, Ram, Chrysler, Jeep, Chevy, GMC, Cadillac, etc. Although generic, the exact repair steps may vary depending on year, make, model and powertrain configuration.","\n ","When a code P0633 is stored, it means that the engine control module (ECM) or powertrain control module (PCM) has detected an immobilizer key which it does not recognize.","The immobilizer key is used to prevent vehicle theft and eliminate the need to place an actual metal key in the door lock cylinders or ignition cylinder. A transponder is integrated into the immobilizer key fob. When the key fob is within a certain distance of the vehicle, the transponder emits a signal to the ECM/PCM and other controllers. Typically, when the transponder signal is received, the doors are unlocked and the push-to-start button is activated. When the immobilizer key is moved away from the vehicle, the doors lock and the push-to-start function is automatically deactivated. The immobilizer key transponder is powered by a small battery. ","Each immobilizer key emits a unique transponder signal. In order for the on-board controllers to recognize the transponder signal, they must be programmed appropriately. The ECM/PCM and the security control module are responsible for engine starting and the body control module (BCM) is responsible for door and trunk lock/unlock related functions.   ","Obviously, when either an ECM/PCM or an immobilizer key is replaced, it will need to be programmed.","If the ECM/PCM fails to find or recognize an immobilizer key, and vehicle entry or start-up is attempted, a code P0633 will be stored and a malfunction indicator lamp (MIL) may be illuminated. The immobilizer key transponder signature is compared between the ECM/PCM and other controllers each time the security system is activated and the self-test function is energized."],"symptoms":["No start condition\nLock/unlock functions may be disabled\nVehicle security system may be activated\nOther diagnostic codes will likely be stored"],"causes":["Weak immobilizer key battery\nImmobilizer key malfunction\nImmobilizer key replaced without being programmed\nECM/PCM programming error\nECM/PCM swapped between vehicles and/or replaced without being properly programmed\nECM/PCM failure"],"type":"INFO"}