{"code":"P063F","description":"Auto Configuration Engine Coolant Temperature Input Not Present","info":["This is a generic diagnostic trouble code (DTC) and applies to many OBD-II vehicles (1996-newer). That may include but is not limited to vehicles from Nissan, Toyota, Mazda, Hyundai, Kia, etc. Although generic, the exact repair steps may vary depending on year, make, model and powertrain configuration.","\n ","If your OBD-II equipped vehicle has stored a code P063F, it means that the powertrain control module (PCM) has not detected an auto configuration engine coolant temperature input signal.","When the ignition cylinder is placed in the ON position and the various on-board controllers (the PCM included) are energized, multiple self-tests are initiated. The PCM depends upon input signals from engine sensors to automatically configure an engine start-up strategy and perform these self-tests. Engine coolant temperature is among the key input signals required by the PCM for auto configuration.","The engine coolant temperature sensor (ECT) should provide the PCM (and other controllers) with a engine coolant temperature input signal for automatic configuration purposes. The ECT is a brass, steel or plastic sensor with a thermal resistor (suspended in resin) inside the tip. The ECT is typically threaded into an engine coolant passage so that the tip is inserted into the passage. Engine coolant flows across the tip of the sensor and affects the thermal resistor inside. As engine coolant warms up, ECT sensor resistance decreases and circuit voltage increases. As engine coolant temperature decreases, ECT sensor resistance decreases and circuit voltage decreases.","If the PCM fails to detect a ECT sensor input circuit, when the ignition switch is placed in the ON position and the PCM is energized, a code P063F will be stored and a malfunction indicator lamp may be illuminated. The auto configuration system may also be deactivated; resulting in serious drivability issues.","A typical coolant temperature sensor:\n"],"symptoms":["Engine stall at idle (especially at start up)\nDelayed engine start\nDrivability issues\nOther ECT related codes"],"causes":["Defective ECT\nOpen or shorted circuit between the ECT and PCM\nCorrosion in ECT connector\nBad PCM or PCM programming error"],"type":"ERR"}