{"code":"P064B","description":"PTO Control Module","info":["This is a generic diagnostic trouble code (DTC) and applies to many OBD-II vehicles (1996-newer). That may include but is not limited to vehicles from Chrysler, Ford, General Motors, Mercedes-Benz, Toyota, etc. Although generic, the exact repair steps may vary depending on year, make, model, and powertrain configuration.","\n ","A stored code P064B means that the powertrain control module (PCM) has detected a malfunction in the power take off (PTO) control module.","The PTO control module is responsible for initiating various PTO functions. These may include activation of specified lighting, increasing engine RPM (when the PTO is engaged), as well as disengagement of drive wheels (using the transfer case) In most cases, the PTO controller is integrated into the PCM but it may also be a stand-alone module.","The PTO is a feature that is included on many hydraulically operated service vehicles such as wreckers and dump body trucks. It allows a large hydraulic pump to be driven using power from the engine. With the vehicle parked and the engine at idle, a transfer case on the transmission output shaft permits the drive wheels to be disengaged and the pump to be engaged via an auxiliary drive shaft. This system is fairly durable and provides an abundance of power for heavy duty functions such as lifting another vehicle (wrecker) or dumping heavy materials (dump body). There are many specialized applications that use a PTO system besides just wreckers and dump trucks.","Each time the ignition is turned on and the PCM is energized, multiple controller self-tests are performed. By performing controller self-tests, the PCM can monitor serial data that is carried over the controller area network (CAN) to ensure that on-board controllers are interfacing properly.","If a problem is detected in monitoring the PTO control module, a code P064B will be stored and a malfunction indicator lamp (MIL) may be illuminated."],"symptoms":["Inoperative PTO\nSlow and laborious engine starting\nEngine stall at start-up\nEngine drivability issues\nOther stored codes"],"causes":["Faulty PTO controller or PCM\nOpen PTO control module voltage supply circuit\nPCM programming error\nOpen or shorted PTO control circuit"],"type":"ERR"}