{"code":"P064F","description":"Unauthorized Software/Calibration Detected","info":["This is a generic diagnostic trouble code (DTC) and applies to many OBD-II vehicles (1996-newer). That may include but is not limited to vehicles from Acura, Audi, Buick, Cadillac, Chevrolet, Chrysler, Ford, Hyundai, Jaguar, Kia, Nissan, Scion, Toyota, etc. Although generic, the exact repair steps may vary depending on year, make, model, and powertrain configuration.","\n ","A stored code P064F means that the powertrain control module (PCM) has detected an unauthorized or unrecognized software application or a controller calibration error.","The installation of factory software and calibration of on-board controllers is frequently referred to as programming. While most programming is performed before the vehicle is delivered to the owner, on-board controllers continue to adapt to specific circumstances and effectively learn in order to meet the needs of individual drivers and geographic locations (among other things). Factors that include voltage spikes, excessive temperatures, and excessive moisture may contribute to software and calibration failure.","Installing aftermarket software programs may lead to a code P064F being stored but it is usually temporary. Once the PCM learns the software, and the code is cleared, it will usually not be reset.","Each time the ignition is turned on and the PCM is energized, multiple controller self-tests are performed. By performing controller self-tests, the PCM can monitor serial data that is carried over the controller area network (CAN) to ensure that on-board controllers are interfacing properly. Memory functions, along with software applications, are tested at this time and also tested periodically when the ignition is in the ON position.","If a problem is detected in monitoring controller software/calibration, a code P064F will be stored and a malfunction indicator lamp (MIL) may be illuminated.","A typical PCM powertrain control module, opened up:\n"],"symptoms":["Delayed or no engine start-up\nEngine drivability issues\nOther stored codes"],"causes":["PCM programming error\nFaulty controller or PCM\nInstallation of aftermarket or high performance software"],"type":"ERR"}