{"code":"P0686","description":"ECM/PCM Power Relay Control Circuit Low","info":["This diagnostic trouble code (DTC) is a generic powertrain code, which means that it applies to all 1996-newer vehicles (VW, BMW, Chrysler, Acura, Audi, Isuzu, Jeep, GM, etc.).","Although generic, the engines differ between brands and may have slightly different causes for this code.","\n ","I have discovered that, when a P0686 code is stored, it means that a low or no battery voltage condition has been detected (by the PCM or one of the other controllers) in the circuit which powers up the PCM or the circuit by which the other controllers monitor PCM power supply voltage.","Normally, OBD-II equipped vehicles use a relay to supply the PCM with battery voltage. A few manufacturers continue to use only a fused circuit but this design is becoming less common. Power relays are usually of a five-terminal design with a constant supply of battery voltage supplied to the primary input terminal. The secondary input terminal is supplied with battery voltage (via a fused circuit) when the ignition switch is placed in the “ON” position. Terminal number five is a signal wire for the controller area network (CAN). The fourth terminal is the output voltage signal for the PCM. The ground terminal is generally grounded to an engine or chassis ground but some designs are provided a ground via a controller.","In most cases, when the ignition switch is placed in the \"ON\" position, a small coil inside the relay is energized and a light clicking sound is heard. This click signifies that the contacts inside of the relay have closed - completing a circuit, providing battery voltage to the PCM output terminal and the CAN bus signal terminal. At this time the PCM should be energized and the service engine soon lamp should be illuminated, in the key-on-engine-off (KOEO) position.\n"],"symptoms":["The code P0686 is usually accompanied by a no-start condition. Ignoring it is not likely to be an option. If this code is present, and the engine will start and run, suspect a PCM programing error or a defective PCM."],"causes":["Potential causes for this code to set are:","A defective ignition switch\nFaulty PCM power relay\nA blown fusible link or fuse\nLoose or corroded battery cable ends\nCorroded or damaged wiring or wiring connectors (especially near the PCM relay)\nPartially or totally disconnected electrical terminal at the ignition switch"],"type":"WARN"}