{"code":"P0684","description":"Glow Plug Control Module to PCM Communication Circuit Range/Performance","info":["This diagnostic trouble code (DTC) is a generic powertrain code. It is considered generic because it applies to all makes and models of vehicles (1996-newer), although specific repair steps may be slightly different depending on the model.","P0684 indicates the Glow Plug Control Module to PCM Communication Circuit has a problem in the Range/Performance aspect of communications. A fault has occurred that prohibits the powertrain control module (PCM) from communicating commands to the glow plug control module. The command is essentially an 'on and off ' signal.","\n ","The codes do not indicate a specific part within the system, just the area of failure. The glow plug circuit is relatively simple and can be diagnosed and repaired with little automotive background, other than a basic knowledge of the use of a volt/ohmmeter.","What is the purpose of the glow plugs?","Comprehending their function requires a basic understanding of the operating principles of a diesel.","Unlike a gasoline engine that needs a spark to ignite the fuel, a diesel engine relies on extremely high compression. Highly compressed, air creates extreme heat. The diesel compresses the air within its cylinders to the point that the air reaches temperatures high enough for spontaneous ignition of the fuel.","When a diesel engine block is cold, it is difficult to create enough heat through compression to ignite the fuel. The reason is that the cold engine block cools the air causing a slower increase in temperature sufficient for starting.","When the vehicle powertrain control module (PCM) senses the engine is cold through signals from the oil and transmission temperature sensors, it turns on the glow plugs. The glow plugs get red hot and transfer heat to the combustion chamber to aid in starting the engine. They are on a timer and only operate for a few seconds. Any longer and they would quickly burn out.","How do they operate?","When the PCM senses the engine is cold is grounds a glow plug control module (GPCM). Once grounded, the GPCM grounds a glow plug solenoid (same as a starter solenoid) on the valve cover.","The solenoid in turn sends power to a glow plug bus bar. The bus bar has a separate wire to each glow plug. Power travels to the glow plugs where they heat the cylinder to aid startup.","The GPCM is a timer and only remains activated for a matter of seconds. This is sufficient to start the engine, but at the same time, it protects the glow plugs from overheating from prolonged activation."],"symptoms":["The check engine light will be illuminated and the above codes will be set.\nLittle if any indication will be present if only one or two glow plugs have failed. If the engine is very cold it may be a little harder to start.\nThe engine may exhibit a miss until it has sufficiently warmed up.\nIf more than two glow plugs are malfunctioning, the engine will be very difficult to start."],"causes":["The causes for this DTC may include:","Open or short in the wiring from the PCM to the GPCM, to the bus bar, or from the bus bar to the glow plug.\nFailed glow plug\nLoose or corroded connections\nFailed GPCM\nLoose or corroded connections on the glow plug solenoid\nGlow plug solenoid failure\nInsufficient battery power to solenoid\nCode P0670 may accompany this code. This code points to the wiring harness from the GPCM to the solenoid as a problem."],"type":"ERR"}