{"code":"P0685","description":"ECM/PCM Power Relay Control Circuit Open","info":["This diagnostic trouble code (DTC) is a generic powertrain code, which means that it applies to all 1996-newer vehicles (Honda, VW, Ford, Dodge, Chrysler, Acura, Audi, GM, etc.).","Although generic, the engines differ between brands and may have slightly different causes for this code.","\n ","In my personal experience, a no-start condition will most likely accompany a code P0685. When this code is stored in the powertrain control module (PCM), it means that a low or no-voltage condition has been detected in the circuit which supplies the PCM with battery voltage.","Many OBD-II equipped vehicles utilize a relay to supply the PCM with battery voltage, while a few use only a fused circuit. Relays are typically of a five-terminal design. A constant supply of battery voltage is supplied to the primary input terminal, the ground terminal is grounded to an engine or chassis ground, the secondary input terminal is supplied with battery voltage (via a fused circuit) when the ignition switch is placed in the \"ON\" position. The fourth terminal is the output for the PCM and the fifth terminal is a signal wire for the controller area network (CAN).","When the ignition switch is placed in the “ON” position, a small coil inside the relay is energized. This causes the contacts inside of the relay to close; essentially completing a circuit thus providing battery voltage to the output terminal and consequently to the PCM.\n"],"symptoms":["Since the code P0685 is usually accompanied by a no-start condition, ignoring it will not likely be an option. If this code is present and the engine will start and run, suspect a faulty PCM or a PCM programing error."],"causes":["Potential causes for this code to set are:","A defective PCM power relay\nA blown fuse or fusible link\nCorroded or damaged wiring or wiring connectors (especially near the PCM relay)\nFaulty ignition switch\nPartially or totally disconnected electrical terminal at the ignition switch\nLoose or corroded battery cable ends"],"type":"WARN"}