{"code":"P0697","description":"Sensor Reference Voltage \"C\" Circuit Open","info":["This diagnostic trouble code (DTC) is a generic powertrain code, which means that it applies to OBD-II equipped vehicles. Although generic, the specific repair steps may vary depending on make/model.","When I find a stored P0697 code, it means that the powertrain control module (PCM) has detected an open circuit for a particular sensor; designated in this case as \"C\". When diagnosing an OBD-II code, the term open could be substituted for absent.","\n ","The sensor in question is typically associated with the automatic transmission, transfer case, or one of the differentials. This code will almost always be accompanied by a more specific sensor code. The P0697 adds that the circuit is open. Consult a reliable vehicle information source (All Data DIY is a great choice) to determine the sensor location (and function) as it pertains to the vehicle in question. If the P0697 is stored alone, suspect that a PCM programming error has occurred. Obviously, you will need to diagnose and repair any other sensor codes prior to diagnosing and repairing the P0697 - but keep the open \"C\" circuit in mind.","Reference voltage (typically five-volts) is applied to the sensor in question via a switched (energized with the key on) circuit. There should also be a ground signal. The sensor is probably of either the variable resistance or electromagnetic variety and completes a particular circuit. Sensor resistance decreases as pressure, temperature, or speed is increased and vice versa. As the sensor resistance changes with conditions it provides the PCM with an input voltage signal. If this input voltage signal is not received by the PCM, the circuit is considered open and a P0697 will be stored.","A malfunction indicator lamp (MIL) may also be illuminated but keep in mind that some vehicles will require multiple drive cycles (with a failure) for a MIL to be illuminated. For this reason, you should allow the PCM to enter readiness mode before considering any repair successful. Simply clear the code, after repairs are performed, and drive the vehicle normally. If the PCM enters readiness mode, the repair was successful. If the code is reset, the PCM will not enter readiness mode and you will know that you still have a problem.\n"],"symptoms":["Failure of the transmission to shift between sport and economy modes\nTransmission shifting malfunctions\nDelayed (or no) transmission engagement\nFailure of the transmission to switch between all-wheel and two-wheel drive modes\nFailure of the transfer case to shift from low to high gear\nLack of front differential engagement\nLack of front hub engagement\nErratic or inoperative speedometer/odometer"],"causes":["Possible causes for this engine code include:","Open circuits and/or connectors\nDefective or blown fuses and/or fusible links\nFaulty system power relay\nBad sensor"],"type":"WARN"}