{"code":"P0698","description":"Sensor Reference Voltage \"C\" Circuit Low","info":["This diagnostic trouble code (DTC) is a generic powertrain code, which means that it applies to OBD-II equipped vehicles. Although generic, the specific repair steps may vary depending on make/model.","If your OBD II equipped vehicle has a stored P0698, it means that the powertrain control module (PCM) has detected a low reference voltage signal for a particular sensor that has been given the designation \"C\". The sensor in question is usually associated with the automatic transmission, transfer case, or one of the differentials.","\n ","A more specific sensor code will almost always accompany this code. The P0698 adds that sensor reference circuit voltage is low. To determine the sensor location (and function), as it pertains to the vehicle in question, consult a reliable vehicle information source (All Data DIY is a great one). Suspect that a PCM programming error has occurred if the P0698 is stored alone. You will need to diagnose and repair any other sensor codes prior to diagnosing and repairing the P0698 - but keep the low reference voltage condition in mind.","The sensor in question is supplied with reference voltage (typically five-volts) via a switched (energized with the key on) circuit. There will be a ground signal as well. The sensor is going to be of either the variable resistance or electromagnetic variety and it will complete the circuit. Sensor resistance should decrease as pressure, temperature, or speed is increased and vice versa. As the sensor resistance changes (with varying conditions) it provides the PCM with an input voltage signal.","If the input voltage signal, received by the PCM, is lower than a programmed limit, a P0698 will be stored. A malfunction indicator lamp (MIL) may be also illuminated. Some vehicles will require multiple drive cycles (with a failure) for the MIL to be illuminated. Allow the PCM to enter readiness mode before considering any repair successful. Just clear the code, after repairs are performed, and drive the vehicle normally. If the PCM enters readiness mode, the repair was successful. If the code is reset, the PCM will not enter readiness mode and you know that a malfunction still exists.\n"],"symptoms":["Failure of the transmission to shift between sport and economy modes\nTransmission shifting malfunctions\nDelayed (or no) transmission engagement\nFailure of the transmission to switch between all-wheel and two-wheel drive modes\nFailure of the transfer case to shift from low to high gear\nLack of front differential engagement\nLack of front hub engagement\nErratic or inoperative speedometer/odometer"],"causes":["Possible causes for this engine code include:","Bad sensor\nDefective or blown fuses and/or fusible links\nFaulty system power relay\nOpen circuits and/or connectors"],"type":"WARN"}