{"code":"P06B6","description":"Internal Control Module Knock Sensor Processor 1 Performance","info":["This generic powertrain diagnostic trouble code (DTC) typically applies to many OBD-II vehicles. That may include but is not limited to vehicles from Chevrolet, Subaru, Ford, Mazda, BMW, Peugeot, etc.","\n ","When a code P06B6 is stored, it means that the powertrain control module (PCM) has detected an internal processor performance error with a certain knock sensor (designated 1) circuit. Other controllers may also detect an internal PCM performance error (with the knock sensor circuit) and cause a P06B6 to be stored.","The knock sensor is typically threaded directly into the engine block. It is a piezoelectric sensor. The location of the knock sensor will vary between manufacturers but most are in the sides of the block (between water jacket freeze plugs) or in the valley beneath the intake manifold. Knock sensors that are in the sides of the engine block are often threaded directly into engine coolant passages. When the engine is warm and the engine cooling system is under pressure, removal of these sensors could result in severe burns from hot coolant. Before removing any knock sensor/s, allow the engine to cool and always dispose of coolant properly. ","A piezoelectric sensing crystal is at the heart of the knock sensor. When shaken or vibrated, the piezoelectric crystal produces a small amount of voltage. Since the knock sensor control circuit is normally a one-wire circuit, the voltage generated by the vibration is recognized by the PCM as engine noise or vibration. The severity of the vibration encountered by the piezoelectric crystal (inside the knock sensor) determines the level of voltage produced in the circuit.","If the PCM detects a degree of knock sensor voltage indicative of an engine knock or severe spark detonation; it may retard ignition timing and a knock sensor control code may be stored.","A very small amount of voltage is always produced by the knock sensor when the engine is running. This is because a slight amount of vibration is inevitable, no matter how smoothly an engine runs.","Internal control module monitoring processors are responsible for various controller self-test duties and overall internal control module accountability. Knock sensor input and output signals are subject to self-test and are monitored constantly by the PCM and other related controllers. The transmission control module (TCM), traction control module (TCSM), and other controllers also interact with the knock sensor system.","Whenever the ignition is on and the PCM is energized, knock sensor system self-tests are initiated. In addition to running internal controller self-tests, the controller area network (CAN) also compares signals from each individual module to ensure that each controller is functioning properly. These tests are performed simultaneously.","If the PCM detects an internal discrepancy in the knock sensor processor, a code P06B6 will be stored and a malfunction indicator lamp (MIL) may be illuminated. Additionally, if the PCM detects a problem between any of the on-board controllers, which would indicate an internal knock sensor system error, a code P06B6 will be stored and a malfunction indicator lamp (MIL) may be illuminated. Multiple failure cycles may be necessary for MIL illumination, depending upon the perceived severity of the malfunction.","Example photo of a PCM:\n"],"symptoms":["Loud noises from the engine area\nDiminished fuel efficiency\nA variety of engine drivability symptoms\nOther stored diagnostic trouble codes"],"causes":["Bad PCM or a PCM programming error\nDefective knock sensor/s\nDefective knock sensor control wiring and/or connectors\nA bad controller power relay or blown fuse\nOpen or shorted circuit or connectors in the CAN harness\nInsufficient control module ground"],"type":"ERR"}