{"code":"P06D1","description":"Internal Control Module Ignition Coil Control Performance","info":["This generic powertrain diagnostic trouble code (DTC) typically applies to many OBD-II vehicles. That may include but is not limited to vehicles from Ford, Chevrolet, Toyota, Jeep, etc.","\n ","When a code P06D1 is stored, it means that the powertrain control module (PCM) has detected an internal processor performance error with the ignition coil control system. Other controllers may also detect an internal PCM performance error (with the ignition coil control system) and cause a P06D1 to be stored.","Internal control module monitoring processors are responsible for various controller self-test duties and overall internal control module accountability. Ignition coil control system input and output signals are subject to self-test and are monitored constantly by the PCM and other related controllers. The transmission control module (TCM), traction control module (TCSM), and other controllers also interact with the ignition coil control system.","Ignition systems in OBD-II equipped automobiles use high intensity spark generated by battery voltage and a tightly wound induction coil. Ignition spark (coil) timing is controlled by the PCM using input signals from the crankshaft position (CKP) and camshaft position (CMP) sensors. In the coil-over-plug, distributor-less ignition system, each cylinder has its own ignition coil. Each coil is attached to the spark plug with a short plug wire or silicon boot.","A constant supply of battery voltage, and a ground pulse from the PCM (applied to a tightly wound induction coil), creates the high-intensity spark (many thousands of volts) required to fire the spark plug of each cylinder.","Other ignition systems utilize coil packs which operate in a similar manner except multiple spark plugs are fired from a single coil pack (with multiple towers). In this type of system, multiple cylinders are fired in sequential order. This type of system typically uses much longer high tension spark plug leads to transfer high-intensity spark from the coil pack towers to each spark plug at the appropriate time.","With the ignition switch on, the coils/coil pack are supplied a constant supply of battery voltage. The ignition coil releases a high-intensity spark when it receives a ground pulse from the PCM.","Whenever the ignition is on and the PCM is energized, ignition coil control system self-tests are initiated. In addition to running internal controller self-tests, the controller area network (CAN) also compares signals from each individual module to ensure that each controller is functioning properly. These tests are performed simultaneously.","If the PCM detects an internal discrepancy in the ignition coil control system processor, a code P06D1 will be stored and a malfunction indicator lamp (MIL) may be illuminated.","Example photo of a PCM:\n"],"symptoms":["Drivability issues, including one or more ignition misfires\nDiminished engine performance\nPoor fuel efficiency"],"causes":["Faulty PCM or a PCM programming error\nOpen or shorted primary/secondary ignition circuits\nDefective ignition coils or coil pack/s\nDefective crankshaft/camshaft position sensor or circuits\nOpen or shorted circuit or connectors in the CAN harness\nInsufficient control module ground"],"type":"ERR"}