{"code":"P0215","description":"Engine Shutoff Solenoid Malfunction","info":["This generic powertrain diagnostic trouble code (DTC) typically applies to OBD-II equipped vehicles that have a shutoff solenoid. Makes of vehicles may include but are not limited to Lexus, Peugeot, Citroen, VW, Toyota, Audi, Dodge, Ram, Mercedes Benz, GMC, Chevrolet, etc.","When your OBD-II equipped vehicle exhibits a code P0215, it means that the powertrain control module (PCM) has detected a malfunction in the shutoff solenoid for the engine.","\n ","Most commonly, the engine shutoff solenoid interferes with the fuel supply to the engine under certain specific circumstances. These circumstances may include (but are not limited to) a vehicle collision, vehicle roll-over, extreme engine overheating, or extreme loss of oil pressure to the engine. The engine shutoff solenoid system is most frequently utilized in diesel powered vehicles but not exclusively.","Typically, the engine shutoff solenoid is positioned in the fuel delivery system. It consists of an electronically controlled solenoid (which operates a valve type actuator), and some method for rerouting fuel back to the storage tank when the engine shutoff solenoid is activated. The PCM uses inputs from various engine and body position sensors to determine when fuel shutoff is required. When this occurs, the PCM provides a voltage signal to the engine cutoff relay (which forwards it to the solenoid) and the solenoid is activated. Once it is activated, the valve prevents fuel from reaching the engine and diverts it back to the fuel storage tank via a specially designed low pressure return line.","The PCM constantly monitors engine shutoff solenoid circuit resistance (and the resultant changes in voltage), when the ignition switch is in the ON position. If the PCM detects a level of voltage from the engine shutoff solenoid circuit that varies from what has been programmed, a code P0215 will be stored and a malfunction indicator lamp (MIL) may be illuminated. In some vehicles multiple failure cycles will be necessary for MIL illumination."],"symptoms":["There are frequently no symptoms when a P0215 is stored\nEngine won’t start\nOther fuel system codes\nLean exhaust codes"],"causes":["Possible causes for this code may include:","Defective engine cutoff solenoid\nFaulty engine shutoff relay\nMalfunctioning tilt angle indicator (if so equipped)\nOpen or shorted circuit in engine cutoff system\nBad oil pressure sending unit\nFaulty engine temperature sensor\nBad PCM or PCM programming error"],"type":"ERR"}