{"code":"P0236","description":"Generic: Turbocharger Boost Sensor A Range/Performance\nGM: Turbocharger Boost System Performance\nDodge Diesel Pickups: MAP Sensor Too High Too Long","info":["This DTC is a generic powertrain code that applies to all turbocharged vehicles. The differences in the above listed descriptions are due to the method by which the pressure in the intake manifold is measured.","\n ","The power train control module (PCM) both controls and monitors boost pressure, and if measured pressure is greater than commanded pressure, the DTC P0236 will be set and the PCM will turn on the check engine light. In order to diagnose this code, you must have a general understanding of three things:","What is boost pressure?\nHow is it controlled?\nHow is it measured?","In a normally aspirated engine (i.e. non-turbo) the downward motion of the pistons, called the intake stroke, creates vacuum in the intake manifold in the same way a syringe draws in fluid. This vacuum is how the air/fuel mixture is drawn into the combustion chamber. A turbocharger is a pump driven by exhaust gasses as they exit the combustion chamber. This creates pressure in the intake manifold. So instead of the engine having to “suck” the air/fuel mixture in, it instead is force fed a greater volume. In essence, there is already compression before the piston begins its compression stroke, as a result increasing compression and therefore increasing power. This is boost pressure.","Boost pressure is controlled by the amount of exhaust gases allowed to pass through the turbo. The greater the amount, the faster the turbo spins, the greater the boost pressure. Exhaust gas is routed around the turbo through a bypass that is known as the waste gate. The PCM controls boost pressure by regulating the opening of the bypass. It does this by opening or closing the waste gate as needed. This is accomplished by means of a vacuum motor mounted on, or near the turbo. The PCM controls the amount of vacuum going to the vacuum motor via a control solenoid.","The actual pressure in the intake manifold is measured by either a boost pressure sensor (Ford/VW) or a manifold absolute pressure sensor (Chrysler/GM). The different sensor types account for the different technical description given by each manufacturer but both perform the same function.","This particular code is one that should be addressed as soon as possible due to the increased risk of over boost and catalytic converter damage.\n"],"symptoms":["When conditions to set P0236 are present the PCM ignores actual manifold pressure readings and uses a inferred or assumed manifold pressure, limits the amount of fuel and dynamic injection timing allowed. The PCM enters what is called failure mode engine management (FMEM) and is most noticeable by a lack of power."],"causes":["Potential causes for this code to set are:","Vacuum supply\nPinched, collapsed or broken vacuum lines\nFaulty control solenoid\nFaulty PCM"],"type":"WARN"}