{"code":"P023E","description":"Manifold Absolute Pressure - Turbocharger/Supercharger Boost Sensor B Correlation","info":["This is a generic powertrain diagnostic trouble code (DTC) that typically applies to OBD-II vehicles. That may include but is not limited to vehicles from Land Rover (Range Rover, Discovery), Ford, Chevrolet, Mazda, Dodge, Peugeot, Saab, Toyota, etc.","Although generic, the exact repair steps may vary depending on year, make, model and powertrain configuration.","\n ","If your OBD-II equipped vehicle has stored a code P023E, it means that the powertrain control module (PCM) has detected a discrepancy in the correlating signals between the manifold absolute pressure (MAP) sensor and the turbocharger/supercharger boost sensor which has been designated \"B\".","The \"B\" denotes a specific boost sensor in a system which may use multiple boost sensors in different locations. Consult a reliable vehicle information source to determine precisely which sensor the B references (for the vehicle in question). This code is applicable only to vehicles that are equipped with forced air induction devices Forced air induction devices include turbochargers and superchargers.","The MAP sensor provides the PCM with a voltage signal that reflects air density or pressure in the intake manifold. The voltage signal is received (by the PCM) as either kilopascal (kPa) units or inches of mercury (Hg). In Some vehicle applications, MAP is substituted for barometric pressure and measured in similar increments.","The turbocharger/supercharger boost pressure sensor (designated B) will likely be of a similar design to the MAP sensor. It monitors air density (boost pressure) inside the turbocharger/supercharger intake pipe and provides the PCM with an appropriate voltage signal.","A code P023E will be stored, and a malfunction indicator lamp (MIL) may be illuminated, if the PCM detects voltage signals between the MAP sensor and the turbocharger/supercharger boost sensor B which differ by more than a programmed degree. Multiple ignition cycles (with a failure) may be required for MIL illumination."],"symptoms":["Decreased engine performance\nExcessive rich or lean exhaust\nDelayed engine start-up (especially when cold)\nDiminished fuel efficiency"],"causes":["Defective MAP/ turbocharger/supercharger boost sensor B\nOpen or shorted MAP/ turbocharger/supercharger boost sensor B wiring or connector\nEngine failure (insufficient vacuum production)\nRestricted intercooler\nPCM or PCM programming error"],"type":"ERR"}