{"code":"P025C","description":"Fuel Pump Module Control Low","info":["This generic powertrain diagnostic trouble code (DTC) typically applies to all OBD-II vehicles equipped with a fuel pump control module. That may include but is not limited to vehicles from Ford, Chevrolet, Dodge, Chrysler, Audi, VW, Mazda, etc.","In older systems, vehicles required very little fuel pressure . These days on the other hand, with the invention of fuel injection and other systems, our vehicles require higher fuel pressures.","\n ","The Engine Control Module (ECM) meets our fuel needs by relying on the Fuel Pump Module to regulate pressures within the fuel system. The fuel pump itself, is responsible for delivering the fuel to the engine.","A failure here is most likely extremely evident as your car may not even start. The 3 main things an internal combustion engine needs to run is : Air, Fuel and Spark. Anyone of these missing and your engine will not operate.","The ECM activates P025C and associated codes when it monitors one or multiples conditions outside a specific electrical range within the Fuel Pump Control Module or it's circuit. This can be caused by either a mechanical or an electrical problem. Working with/around such a volatile substance makes it somewhat dangerous to diagnose or repair anything here so make sure you are properly trained and are familiar with the hazards involved.","P025C Fuel Pump Module Control Low code is set when the ECM monitors a lower than desired specific electrical value within the Fuel Pump Module or it's circuit(s). It is one of four related codes, which are P025A, P025B, P025C, and P025D."],"symptoms":["Engine will not start\nHard start\nEngine stalling\nPoor fuel mileage\nInaccurate fuel level\nFuel smell\nPoor engine performance"],"causes":["Defective Fuel Pump Module\nDefective Fuel Pump\nDebris in Fuel Pump screen\nWiring Issue (i.e.: frayed wire, melted, cut/open etc.)\nConnector problem (i.e.: melted, disconnected, intermittent connections etc.)\nECM problem"],"type":"WARN"}