{"code":"P0297","description":"Vehicle Overspeed Condition","info":["This diagnostic trouble code (DTC) is a generic powertrain code, which means it applies to most OBD-II equipped vehicles including but not limited to Ford, Nissan, Suzuki, Dodge, Chevrolet, Jeep, Subaru, etc. Although generic, the exact repair steps may vary depending on make/model.","When an OBD-II equipped vehicle has stored a code P0297, it means that the powertrain control module (PCM) has detected a signal from the vehicle speed sensor (VSS) indicating that actual vehicle speed has exceeded the maximum allowable limit.","\n ","The PCM, in most production vehicles sold in North America, is programmed to limit actual vehicle speed to 100 mph. When a VSS signal is received that indicates the vehicle has reached this speed, the PCM is programmed to discontinue the fuel injector pulse signal to all cylinders. This causes an immediate loss of momentum and vehicle speed is decreased. Once vehicle speed returns to an acceptable level, the injector pulse signal is restored and acceleration is enabled.","Typically, the VSS is an electromagnetic sensor that uses a rotating reluctor ring to complete an input circuit to the PCM. The VSS is mounted in the transmission housing at such a position as to allow the reluctor ring to pass by it; in close proximity. The reluctor ring is attached to the output shaft of the transmission so that it spins along with it. As the reluctor ring passes by the electromagnetic tip of the VSS, notches and grooves serve to complete and interrupt the circuit rapidly. These circuit manipulations are recognized by the PCM as transmission output speed or vehicle speed.","A typical VSS or vehicle speed sensor:\n","If the PCM detects a VSS reading that indicates the vehicle has exceeded the maximum allowable speed, a code P0287 will be stored (on some vehicles) and a malfunction indicator lamp (MIL) may be illuminated. In some cases, multiple failure cycles will be required for a MIL to be illuminated. This code belongs in the P0200-P02FF batch of diagnostic codes."],"symptoms":["Most commonly, no symptoms will accompany a P0297\nOther transmission control codes\nTransmission shifting irregularities\nAntilock Brake System (ABS) codes"],"causes":["Possible causes for this P0297 code may include:","The vehicle has been operated in excess of the maximum allowable speed\nDefective VSS or VSS reluctor ring\nMechanical transmission failure\nVSS system circuits shorted to voltage"],"type":"ERR"}