{"code":"P0299","description":"Turbocharger/Supercharger A Underboost Condition","info":["This diagnostic trouble code (DTC) is a generic powertrain code, which means that it applies to OBD-II equipped vehicles that have a turbocharger or supercharger. Brands of vehicles affected may include but are not limited to Ford, GMC, Chevy, VW, Audi, Dodge, Hyundai, BMW, Mercedes-Benz, Ram, Fiat, etc. Although generic, the specific repair steps may vary depending on make/model.","The P0299 DTC code refers to a condition where the PCM/ECM (powertrain/engine control module) has detected that the bank \"A\" or single turbocharger or supercharger is not providing a normal amount of boost (pressure).","That could be due to a variety of reasons, which we detail below. On a normally operating turbocharged or supercharged engine the air going into the engine is pressurized and that's part of what makes so much power for an engine of it's size. If this code is set, you will likely notice reduced power output. Turbochargers are driven from the exhaust exiting the engine to use a turbine to force air into the intake. Superchargers are mounted on the intake side of the engine and are typically belt driven to force more air into the intake, with no connection to the exhaust.","In the case of Ford vehicles, this may apply: \"The PCM checks for a minimum throttle intake pressure (TIP) PID reading during engine operation, which indicates an underboost condition. This DTC sets when the PCM detects that the actual throttle intake pressure is less than the desired throttle intake pressure by 4 psi or more for 5 seconds.\"","In the case of VW & Audi vehicles, the code definition is slightly different, it is \"Boost Pressure Regulation: Control Range Not Reached.\" As you can probably tell that's basically just another way of stating an underboost condition.","A typical turbocharger and related components:\n"],"symptoms":["MIL (Malfunction indicator lamp) illumination\nReduced power output from engine, possibly in a \"limp\" mode\nUnusual sounds from the engine/turbo","There would likely be no other symptoms."],"causes":["Potential causes of a P0299 turbo underboost code include:","Intake (induction) air restriction or leak\nFailed or damaged turbocharger (sticking, binding, etc.)\nFaulty boost/charge pressure sensor\nFaulty wastegate bypass regulator valve (VW)\nLow fuel pressure condition (Isuzu)\nSticking turbo nozzle control solenoid (Isuzu)\nFaulty injector control pressure (ICP) sensor (Ford)\nLow oil pressure (Ford)\nEGR system fault (Ford)\nVariable geometry turbocharger (VGT) actuator (Ford)\nVGT vanes sticking (Ford)"],"type":"ERR"}