{"code":"P02B6","description":"Cylinder 8 Fuel Trim at Max Limit","info":["This is a generic powertrain diagnostic trouble code (DTC) and typically applies to all gasoline OBD-II vehicles. That may include but is not limited to vehicles from Land Rover, Mazda, Jaguar, Ford, Mini, Nissan, GM, etc. Although generic, the exact repair steps may vary depending on year, make, model and powertrain configuration.","A stored P02B6 code means that the powertrain control module (PCM) has detected an extremely lean condition in a specific engine cylinder, in this case it's cylinder #8.","\n ","The PCM utilizes the fuel trim system to increase or decrease fuel delivery as required. Input signals from the oxygen sensors provide the PCM with the data required to adjust fuel trim. The PCM uses variations in fuel injector pulse width modulation to effect air/fuel ratio changes.","Short term fuel trim is calculated constantly by the PCM. It fluctuates rapidly and is one of the key factors in calculating long term fuel trim. Every vehicle has minimum and maximum fuel trim percentage parameters programmed into the PCM. The parameters for short term fuel trim are much broader than the parameter specifications for long term fuel trim.","Small variations in fuel trim, typically measured in positive or negative percentage, are normal and will not cause a code P02B6 to be stored. Maximum fuel trim parameters (positive or negative) are normally in the twenty-five-percent range. Once this maximum threshold has been exceeded, a code of this type will be stored.","When the engine is functioning at optimum efficiency and there is little need to increase or decrease the amount of fuel delivered to each cylinder, fuel trim should reflect between zero and ten percent. When lean exhaust conditions are detected by the PCM, fuel must be increased and fuel trim will reflect a positive percentage. If the exhaust is too rich, the engine needs less fuel and fuel trim should reflect a negative percentage.","See also: Everything you want to know about fuel trims.","OBD-II vehicles will need to establish a pattern for long term fuel trim strategy and this will require multiple ignition cycles.","Fuel trim graphs as shown by OBD-II scan tool:\n"],"symptoms":["Diminished engine performance\nDelayed engine startup\nThe presence of stored lean exhaust codes\nMisfire codes may also be stored"],"causes":["Defective/leaking fuel injector\nBad fuel pump\nEngine vacuum leak (including EGR valve failure)\nFaulty oxygen sensor\nMass air flow (MAF) or Manifold Air Pressure (MAP) sensor failure"],"type":"ERR"}