{"code":"P02D1","description":"Cylinder 3 Fuel Injector Offset Learning At Max Limit","info":["This is a generic powertrain diagnostic trouble code (DTC) and typically applies to all gasoline OBD-II vehicles. That may include but is not limited to vehicles from Ford, Mazda, GMC, Chevrolet, BMW, etc. Although generic, the exact repair steps may vary depending on year, make, model and powertrain configuration.","Whenever you see learn in a code's description, like this one, it is referring to the process of the ECM (Engine Control Module) learning and/or adapting a system to constantly varying factors.","\n ","To relate, the human body \"learns\" to limp after hurting a foot, to adapt to the current situation. This is very similar to the learning process when the ECM (Engine Control Module) and the engine is concerned. In this code's case however, it is referring to the cylinder #3 fuel injector offset learning parameters. As engine parts wear out, weather changes, driver's needs change, among countless other variables, the fuel injectors' output needs to adapt to these. It has a certain range it can work within to adapt to your and your vehicle's needs but, that being said, if your engine's needs exceed the injectors's learnability, the ECM (Engine Control Module) will activate this code to let you know it can no longer adapt to the current situation.","When the ECM monitor the fuel injectors learning values are beyond normal operating parameters, it activates P02D1. Most times, this code is being set because something has caused the injector to have to exhaust it's adaptability. This usually means there is another factor causing this. For one reason or another, the ECM is trying to modify the fuel mixture according to driver's needs but something is causing it to adapt to it's maximum limit.","The P02D1 Cylinder 3 Fuel Injector Offset Learning At Max Limit code is set when the ECM monitors the cylinder #3 fuel injector adapting to it's maximum limit.","A cross section of a typical gasoline engine fuel injector:\n"],"symptoms":["Reduced fuel economy\nEngine misfire\nDegrading overall engine performance\nFuel smell\nCEL (Check Engine Light) illuminated\nEngine performing abnormally\nExcessive exhaust smoke on load\nReduced throttle response"],"causes":["Vacuum leak\nPlugged air filter\nCracked intake tube\nHead gasket defective\nECM issue\nCylinder 3 fuel injector defective\nWorn/cracked piston rings\nCracked intake manifold\nLeaking intake, PCV, EGR gaskets"],"type":"ERR"}