{"code":"P02E9","description":"Diesel Intake Air Flow Position Sensor Circuit High","info":["This generic powertrain/engine diagnostic trouble code (DTC) can typically apply to all diesel OBD-II equipped engines, but shows up more often in certain Chevy, Dodge, Ford and GMC trucks.","Although generic, the exact repair steps may vary depending on year, make, model and powertrain configuration.","\n ","The Diesel Intake Air Flow Position Sensor (DIAFPS) is usually bolted to the throttle body mounted to the intake manifold or in a tube in the intake air stream. The DIAFPS sensor converts the incoming airflow volume into an electrical signal for the Powertrain Control Module (PCM).","The PCM receives this voltage signal to determine how much clean, filtered air is entering the engine versus how much is entering through the exhaust system via the Exhaust Gas Recirculation System, or EGR System. When the EGR system is activated, the PCM should note a change in airflow. If not, then there may be something wrong with the EGR system, or there may be something wrong with the DIAFPS, also known as a MAF sensor. This code is set if this input does not match normal engine operating conditions stored in the PCM’s memory, even for a second, as these diagnostic trouble codes demonstrate. It also looks at the voltage signal from the DIAFPS to determine if it is correct at initial Key On.","The code P02E9 Diesel Intake Air Flow Position Sensor Circuit High is set when the voltage at the sensor stays above a set level (usually over 4.8V) for too long a period. This code is usually considered to be an electrical circuit issue.","Troubleshooting steps may vary depending upon manufacturer, type of DIAFCS motor/control and wire colors."],"symptoms":["Malfunction Indicator Light On\nPossible low idle speed only\nNo EGR System operation\nNo Regeneration of the diesel particulate filter to burn off the soot build up (won’t burn off soot out of the DPF catalyst)"],"causes":["Short to power in the signal circuit to the DIAFPS sensor – possible\nFailed DIAFPS Sensor – possible\nFailed PCM - unlikely"],"type":"WARN"}