{"code":"P2BAC","description":"NOx Exceedance - Deactivation of EGR","info":["This diagnostic trouble code (DTC) is a generic powertrain code, which means that it applies to all 1996-newer diesel vehicles (Ford, Dodge, Chevrolet, GMC, Ram, VW, etc.). Although generic, the specific repair steps may vary depending on make/model.","The P2BAC code differs from many other codes in that it is an information only code. It is not meant to be diagnosed but to make you aware that another problem exists and the exhaust gas recirculation (EGR) system has been deactivated. A P2BAC should always be accompanied by other exhaust or EGR related codes. The other codes must be diagnosed and repaired before this code is diagnosed, as this code will almost always be rectified by repairing the conditions that caused the other codes to be stored. Obviously, this type of code should be exhibited in diesel powered vehicles only.","\n ","When this code is stored, it means that the PCM has detected a level of nitrogen oxide (NOx) that exceeds a programmed limit. This detection may have taken place in the NOx trap or the diesel particulate filter (DPF). It may also be due to a defective DPF pressure sensor or NOx sensor.","As an added note: Some diesel powered 2007 through 2012 Dodge and Ram trucks are equipped with catalytic converters and oxygen (O2) sensors. These vehicles have proven particularly vulnerable to these types of codes. In these vehicles, the P2BAC usually accompanies an O2 sensor code. Diagnose and repair the O2 sensor code and the P2BAC will literally disappear.","Most late model diesel powered vehicles are equipped with DPF systems that reduce soot particles and the resultant black smoke. The DPF is part of the exhaust system and it is equipped with pressure sensors that are monitored by the powertrain control module (PCM). When DPF pressure exceeds a programmed level, the filtration element should be rejuvenated. Filtration element rejuvenation methods include active and passive. Active filtration occurs when the vehicle is being operated and is automatic. Passive rejuvenation typically occurs after the vehicle has been parked and requires manual activation. Consult a reliable vehicle information source to find out the type of system with which your vehicle is equipped.","If the rejuvenation process is not fully completed, or if the process isn’t taking place at regular intervals, DPF pressure codes will be stored; they may also be accompanied by a P2BAC.","Other diesel powered vehicles use NOx trap systems as an added emission reduction measure. A few vehicles even use both a PDF and a NOx trap to really clean up emissions. The NOx trap is another in-line exhaust component that catches NOx particles and must be rejuvenated regularly. Just like with the DPF, if the NOx trap isn’t rejuvenated regularly, exhaust pressure is elevated and a NOx trap code will be stored. Also like the DPF system, a code P2BAC may also accompany NOx system codes.","The EGR system is designed to supply the engine induction system with a portion of spent exhaust gases. In the engine, excessive fuel is burned from the exhaust, reducing the amount of NOx that is produced by exhaust emissions. When the PCM detects a level of exhaust pressure that is indicative of an unacceptably high level of NOx (in the DPF, NOx trap, or catalytic converter), the EGR system will be deactivated in order to reduce stress on the affected component and diminish exhaust pressure. In this case, the P2BAC will be stored. An illuminated malfunction indicator lamp (MIL) will not be illuminated just because the P2BAC is stored. MIL illumination will take place because of the accompanying DPF, NOx, and O2 sensor codes that are stored."],"symptoms":["Diminished engine performance\nIncreased black smoke from exhaust\nDecreased fuel efficiency"],"causes":["Possible causes for this engine code include:","Improper DPF or NOx trap rejuvenation fluid\nNot enough rejuvenation fluid\nInefficient DPF or NOx trap rejuvenation due to driving habits\nDefective catalytic converter (if applicable)\nFaulty DPF, NOx trap, or O2 sensor/s"]}