{"code":"P033E","description":"Knock Sensor 4 Circuit Intermittent (Bank 2)","info":["This diagnostic trouble code (DTC) is a generic powertrain code, which means that it applies to OBD-II equipped vehicles (Dodge, Ram, Ford, GMC, Chevrolet, VW, Toyota, etc.). Although generic, the specific repair steps may vary depending on make/model.","In the times that I have been faced with the diagnosis of a stored code P033E, it has been indicative of the powertrain control module (PCM) detecting an intermittent knock sensor signal for engine bank two. The designation of knock sensor 4 can denote a particular sensor (in a multiple sensor configuration) or it can point to a specific cylinder. Bank 2 refers to the bank of the engine which does not contain the number one cylinder. Consult a reliable vehicle information source for the configuration of the knock sensor system for the vehicle in question.","\n ","Typically threaded directly into the engine block, the knock sensor is a piezoelectric sensor. The location of the sensors in a multi-sensor system may vary between manufacturers but most are in the sides of the block (between water jacket freeze plugs). Knock sensors that are in the sides of the engine block are often threaded directly into engine coolant passages. When the engine is warm and the engine cooling system is under pressure, removal of these sensors could result in severe burns from hot coolant. Before removing any knock sensor/s, allow the engine to cool and always dispose of coolant properly.","A piezoelectric sensing crystal is at the heart of the knock sensor. When shaken or vibrated, the piezoelectric crystal produces a small amount of voltage. Since the knock sensor control circuit is normally a one-wire ground circuit, the voltage generated by the vibration is recognized by the PCM as engine noise or vibration. The severity of the vibration encountered by the piezoelectric crystal (inside the knock sensor) determines the level of voltage produced in the circuit.","If the PCM detects a degree of knock sensor voltage indicative of a spark detonation; it may retard ignition timing and no knock sensor control code may be stored. If the PCM detects a level of knock sensor voltage that indicates a more severe engine noise (such as a connecting rod contacting the inside of the engine block), it may discontinue fuel delivery and ignition spark to the affected cylinder and a knock sensor code will be stored.","A very small amount of voltage is always produced by the knock sensor when the engine is running. This is because a slight amount of vibration is inevitable, no matter how smoothly an engine runs. If the PCM detects an unexpected signal from knock sensor 4, like battery voltage, complete battery ground, or pulsing voltage, a code P033E will be stored and a MIL may be illuminated.","Related knock sensor / circuit trouble codes include P0324, P0325, P0326, P0327, P0328, P0329, P0330, P0331, P0332, P0333, and P0334.\n"],"symptoms":["Diminished engine performance\nHesitation upon acceleration\nLoud noises from the engine area\nDecreased fuel efficiency"],"causes":["Potential causes for this code to set are:","Defective knock sensor/s\nInternal engine malfunction\nIgnition misfire/s\nContaminated or substandard fuel\nDefective knock sensor control wiring and/or connectors\nBad PCM or a PCM programing error"],"type":"ERR"}