{"code":"P0338","description":"Crankshaft Position Sensor A Circuit High Input","info":["This diagnostic trouble code (DTC) is a generic powertrain code, which means that it applies to OBD-II equipped vehicles (Jeep, Nissan, Dodge, Ram, BMW, Ford, GM, etc.). Although generic, the specific repair steps may vary depending on make/model.","In the past, when I have diagnosed a stored code P0338, it was due to the powertrain control module (PCM) detecting a high input voltage signal from the crankshaft position (CKP) sensor.","\n ","CKP sensors monitor engine speed (RPM) and crankshaft position. The position of the crankshaft is used by the PCM to calculate ignition spark timing. The camshafts turn at half the speed of the crankshaft, so it is important that the PCM is able to distinguish between engine intake and exhaust stokes (rotations). The CKP sensor and each camshaft position (CMP) sensor have one or more circuits dedicated to providing the PCM with an input signal, a 5-volt reference signal, and a ground.","CKP sensors are typically of the electro magnetic, hall-effect variety and are mounted to the exterior of the engine. They are placed in very close proximity (usually only several thousandths of an inch) to a circuit completing engine ground. This engine ground is usually a reluctor ring (with precisely machined teeth) affixed to either end of the crankshaft or integrated into the crankshaft itself. Systems with multiple CMP sensors may use a reluctor ring on one end of the crankshaft and another machined into the center of the crankshaft.","Typically, the CKP sensor is mounted so that the crankshaft reluctor ring passes within several thousandths of an inch of its magnetic tip. As the crankshaft rotates, raised areas of the reluctor ring complete an electromagnetic circuit with the sensor. The indentations (between the raised areas) interrupt the circuit briefly. The PCM perceives these rapid circuit completions and interruptions as a waveform pattern representing voltage fluctuations.","The PCM constantly compares input signals from the crankshaft position and camshaft position sensor circuits. If CKP input voltage is too high over a set period of time, a P0338 code will be stored and a MIL may be illuminated.","Other crankshaft position sensor trouble codes include P0335, P0336, P0337, and P0339.\n"],"symptoms":["The engine will not start\nThe tachometer (if equipped) does not register RPM when the engine is cranked\nHesitation upon acceleration\nPoor engine performance\nDiminished fuel efficiency"],"causes":["Potential causes for this code to set are:","Defective CKP sensor\nOpen or shorted wiring to the CKP sensor\nCorroded or fluid soaked connector at the CKP sensor\nFaulty PCM or PCM programming error\nAlternator overcharging and affecting PCM operation"],"type":"WARN"}