{"code":"P0347","description":"Camshaft Position Sensor \"A\" Circuit Low (Bank 2)","info":["This is a generic powertrain diagnostic trouble code (DTC), which means it covers all makes/models, 1996-newer. However, specific troubleshooting steps will vary depending on the vehicle.","The automotive trouble code P0347 is one of several generic malfunction codes relating to the camshaft position sensor (CPS). Trouble codes P0335 through P0349 are all generic codes related to the CPS inferring different reasons for the failure.","\n ","In this instance, code P0347 infers the sensor's signal is to low, or not strong enough. The signal is low enough to be vague and difficult to interpret. P0347 refers to the Bank 2 \"A\" sensor. Bank 2 is the side of the engine that does not contain cylinder #1.","Description and correlation of the crankshaft and camshaft position sensors","It's important in today's vehicles to understand what these sensors are and how they interact. All distributorless ignition vehicles use a crank and cam sensor to take the place of the module and trigger wheel found in an electronic distributor.","The crankshaft position sensor (CPS) signals the engine control module the location of the pistons relative to top dead center in preparation for injecting fuel and firing the spark plugs.","The camshaft position sensor (CMP) signals the position of the camshaft intake lobe relative to the CPS signal and the opening of the intake valve for fuel injection on each cylinder.","Description and location of sensors","The crank and cam sensors provide an \"on and off\" signal. Both are either hall effect or magnetic in function.","A hall effect sensor uses an electro-magnetic sensor and a reluctor. The reluctor is shaped like small cups with squares cut out of the sides making it resemble a picket fence. The reluctor spins while the sensor is stationary and mounted very close to the reluctor. Every time a post passes in front of the sensor a signal is produced, and when the post passes, the signal is off.","A magnetic pickup uses a stationary sensor and a magnet attached to the rotating part. Every time the magnet passes in front of the sensor a signal is produced.","Locations","A hall effect crank sensor is located on the harmonic balancer in the front of the engine. The magnetic pickup can be in the side of the engine block where it uses the center of the crankshaft for a signal, or it can be in the bellhousing where it uses the flywheel as a trigger.","The camshaft sensor mounts in the front or rear of the camshaft."],"symptoms":["Check engine light (malfunction indicator lamp) illumination and code P0347 set\nLack of power\nStalling\nHard starting"],"causes":["The causes for this DTC may include:","Faulty camshaft position sensor\nSensor harness is open or shorted\nPoor electrical connections\nFaulty starter\nPoor wiring to the starter\nBad battery"],"type":"WARN"}