{"code":"P0350","description":"Ignition Coil Primary/Secondary Circuit Malfunction","info":["This diagnostic trouble code (DTC) is a generic powertrain code, which means that it applies to OBD-II equipped vehicles (Hyundai, Toyota, Chevy, Ford, Dodge, Chrysler, etc.). Although generic, the specific repair steps may vary depending on make/model.","If your OBD-II vehicle has stored a code P0350, it means that the powertrain control module (PCM) has detected a problem with the primary and/or secondary circuits for one or more ignition coils or ignition coil packs.","\n ","Most OBD-II equipped vehicles utilize a coil-over-plug, distributor less ignition system. In this type of system, each cylinder is outfitted with its own ignition coil which is attached to the spark plug using a short plug wire or silicon boot. Battery voltage, and a ground pulse from the PCM applied to a tightly wound induction coil, create the high-intensity spark (thousands of volts) that is required to fire the spark plug for each cylinder.","Systems which use coil packs function in a similar manner, except multiple spark plugs are fired from a coil pack which fires multiple cylinders in sequential order. This type of system typically uses longer high tension spark plug leads to transfer the high-intensity spark from the coil pack towers to the spark plugs.","Regardless of the type of ignition system with which the vehicle in question is equipped, spark timing and function are controlled by the PCM. Provided with a constant supply of switched battery voltage (with the ignition switch on), the ignition coil releases a high-intensity spark when it receives a ground pulse from the PCM.","If the PCM detects that any of the ignition coil circuits are not being completed when the ground pulse is applied, a code P0350 will be stored and a malfunction indicator lamp (MIL) may be illuminated.\n"],"symptoms":["Drivability issues, including one or more ignition misfires\nPoor engine performance\nDiminished fuel efficiency\nCylinder misfire codes will likely accompany a code P0350 (e.g. P0301, P0302, P0303, P0304, etc.)"],"causes":["Potential causes for this code to set are:","Open or shorted primary/secondary circuits\nDefective ignition coils or coil pack/s\nBad ignition system relay\nBlown fuses or fusible links\nFaulty PCM or a PCM programming error"],"type":"ERR"}