{"code":"P0363","description":"Misfire Detected - Fueling Disabled","info":["This diagnostic trouble code (DTC) is a generic powertrain code, which means that it applies to OBD-II equipped vehicles (BMW, Mini, Mazda, Ford, Hyundai, Chevrolet, etc.). Although generic, the specific repair steps may vary depending on make/model.","When I discover a stored code P0363, I immediately know that the powertrain control module (PCM) has detected an ignition misfire and disabled the fuel injector for the affected cylinder. I can also figure - with relative certainty - that the vehicle in question is of European descent.","\n ","The PCM monitors variations in the input signals from the crankshaft position sensor (CPS) and camshaft position sensor/s (CMPS) to determine if an ignition misfire is present, as well as which cylinder is misfiring. Initially, when an ignition misfire is detected, the malfunction indicator lamp (MIL) may flash rapidly for a period of time and stop (instead of remaining illuminated). The purpose of the flashing MIL is to make the driver aware that current driving conditions, combined with a cylinder misfire, might lead to catalytic converter damage. Regardless of the flashing MIL, a misfire code should be stored; though it may be stored as a pending code.","In some vehicles (usually of the European variety), when the PCM detects several ignition cycles with a misfire code, it will disable fuel delivery to the affected cylinder. This is typically accomplished by disabling the ground pulse to the fuel injector for that particular cylinder. It is a good idea to discontinue fuel delivery to the particular cylinder because the excessive fuel can cause catalytic converter failure. However, for the novice technician it can also lead to confusion when testing. Learn more about the reason for that in the troubleshooting section.","When an ignition misfire has been detected, a cylinder misfire code has been stored, and fuel delivery to the affected cylinder has been disabled, a code P0363 will be stored and a MIL may be illuminated. One or more cylinder misfire code/s usually accompany this code.","Other misfire codes includ P0300, P0301, P0302, P0303, P0304, etc.\n"],"symptoms":["Rough or choppy engine operation, especially under acceleration\nDiminished engine performance\nOther misfire related codes will likely be stored\nFlashing MIL is a possibility"],"causes":["Potential causes for this code to set are:","Defective spark plug(s)\nFaulty ignition coil/s or coil pack(s)\nMoisture or oil in spark plug galley/s\nCracked or torn spark plug wire(s) or spark plug boot(s)\nBad fuel injector(s)"],"type":"ERR"}