{"code":"P037F","description":"Glow Plug Sense Circuit High","info":["This diagnostic trouble code (DTC) is a generic powertrain code, which means that it applies to OBD-II equipped vehicles that have glow plugs (diesel engine vehicles). Brands of vehicles may include but are not limited to Ford, Dodge, Mazda, VW, Ram, GMC, Chevy, etc. Although generic, the specific repair steps may vary depending on make/model/engine. Anecdotally this code seems more common on Ford vehicles.","The glow plugs and their associated harnesses and circuits are part of a system that is responsible for generating heat in the combustion chamber prior to cold startups.","\n ","Essentially , the glow plug is similar to an element on a stove-top. These are incorporated in diesel engines because diesel engines do not use a spark plug to ignite the fuel/air mixture. Rather, they use compression to generate enough heat to ignite the mixture. For this reason, diesel engines need the glow plugs' help on cold starts.","The ECM throws P037F and associated codes when it monitors a condition outside of a specific range within the glow plug circuit. Most of the time, I would say this would be an electrical issue but some mechanical problems could affect your glow plug circuit on some makes and models. P037F Glow Plug Sense Circuit High code is set when the ECM monitors one or more high electrical value within the circuit.","An example of a glow plug:\n","NOTE: If other dash lights are currently illuminated (e.g.: traction control, ABS, etc.), this may be a sign of another potentially bigger problem. In this case, you should bring your vehicle to your reputable shop where they can plug in with a proper scan tool to avoid doing any unnecessary harm.\n","This trouble code is closely related to P037D and P037E."],"symptoms":["Hard starts in the morning or when cold\nAbnormal engine noises on start-up\nPoor performance\nEngine misfiring\nPoor fuel mileage"],"causes":["Broken or damaged wiring harness\nFusible link burnt/defective\nGlow plug defective\nECM issue\nPin/connector problem. (e.g. corrosion, overheating, etc.)"],"type":"WARN"}