{"code":"P0386","description":"Crankshaft Position Sensor B Circuit Range/Performance","info":["This diagnostic trouble code (DTC) is a generic powertrain code. It is considered generic because it applies to all makes and models of vehicles (1996-newer), although specific repair steps may be slightly different depending on the model.","The crankshaft position sensor (CKP) is usually a two wire sensor: a signal and a ground. The CKP sensor consists of (usually) a permanent magnent sensor that is mounted in front of a reluctor (toothed) wheel mounted to the crankshaft.","\n ","As the reluctor wheel passes in front of the crank sensor, an A/C signal is produced that varies according to engine speed. The PCM (powertrain control module) uses this A/C signal to interpret engine RPM. Some crank sensors are hall-effect sensors instead of permanent magnent sensors. These are three wire sensors, provided with voltage, ground, and signal. They too have a reluctor wheel with vanes and \"windows\" that change the voltage signal to the PCM, providing a RPM signal. I will focus on the former, since they are simpler design and more common.","The crankshaft reluctor has a specific number of teeth and the PCM can determine the position of the crankshaft using only this sensor's signature pattern. The PCM uses this sensor to also determine cylinder misfires by measuring the reluctor teeth locations in the CKP sensor signal. In conjunction with the Camshaft position sensor (CMP) the PCM can determine timing of spark and fuel injection. If the PCM senses a loss of CKP sensor signal (RPM signal) even momentarily, P0386 may set.","Note: This DTC refers to the \"B\" sensor. Refer to a vehicle specific repair manual to confirm the location of your \"B\" crankshaft position sensor. In the case of some GM (Cadillac) engines, the \"B\" sensor is the upper while the \"A\" sensor is the lower, but check to be sure. This code is basically the same as P0336 but refers to the \"B\" sensor.","Related crank position sensor B trouble codes:","P0385 Crankshaft Position Sensor B Circuit Malfunction\nP0387 Crankshaft Position Sensor B Circuit Low Input\nP0388 Crankshaft Position Sensor B Circuit High Input\nP0389 Crankshaft Position Sensor B Circuit Intermittent"],"symptoms":["Intermittent stalling & no start\nNo start\nMIL (Malfunction Indicator Lamp) illumination\nIntermittent misfire"],"causes":["Potential causes of a P0386 code include:","Bad crank sensor\nBroken reluctor ring (missing teeth, debris lodged in ring)\nReluctor ring dislodged/stripped from it's stationary location\nWiring harness chafing causing short\nWiring open in CKP circuit"],"type":"ERR"}