{"code":"P0384","description":"Glow Plug Control Module Circuit High","info":["The OBD (on board diagnostics) code P0384 is generic and encompasses all brands of late model diesel engines, including those diesels found in Ford, Dodge, Chevrolet, GMC, and VW Volkswagen vehicles. To understand the significance of this code, its ramifications and symptoms, it is important to understand the dynamics at work.","Unlike a conventional gas engine, a diesel doesn't rely on a compressed fuel mixture and an electrical source of ignition to operate. Diesels have much higher compression than gas engines.","\n ","This high compression causes the air in the cylinder to reach over 600 degrees - sufficient to ignite the diesel fuel. When the piston reaches top dead center of the cylinder, high-pressure fuel sprays into the cylinder. It immediately ignites when it encounters the super-heated air and the expanding gases drive the piston down.","Glow Plug","Since the diesel engine requires super-heated air to ignite the fuel, a problem arises when the engine is cold. When starting a cold engine, it is difficult to super-heat the air when its heat is quickly lost to the cold cylinder head.","The glow plug is the solution. Installed in the cylinder head, the pencil shaped plug heats up until it glows for up to ten seconds. This results in the surrounding cylinder wall temperature to rise allowing the heat of compression to rise sufficiently for ignition.","A typical diesel engine glow plug:\n","Glow Plug Circuit","The circuit is common on all diesels with the exception of the component used to time the glow plug operation. Either the vehicle will have a glow plug control module or the PCM will do this. In lieu of a service manual, just call an auto parts store and ask if they sell a control module. If not, then the computer controls the timing.","Batteries - Check the batteries for a full charge. The compressed air in the cylinders only retains its heat for a faction of a second so the engine must turn over rapidly\nGlow Plug Relay - Appears similar to a remote starter relay and is usually located next to the starter relay. The two are not interchangeable because the glow plug relay - by design - handles much higher amperage\nOil Temperature Sensor - This is used by the PCM to sense when and how long to operate the glow plugs\nGlow Plug Fuse - The ignition switch supplies the power to the glow plug relay while the PCM computer supplies the ground to actuate it, or in the case of a module, it will supply the ground\nGlow Plug Control Module or PCM","Operating Principals","When the ignition is on it supplies power to the glow plug relay. The computer or control module will supply the relay with a ground to actuate it. The deciding factor is the oil temperature sensor. When the computer senses a cold engine it will either actuate the control module or relay by supplying the ground.","When activated, the relay supplies the power to the glow plugs for the length of time determined by the computer or control module.","If the vehicle has a control module, all that it does is simply supply a timed ground to the relay. It will have a fused power source and the computer supplies the ground to turn it on.","A P0384 code is set when the PCM (powertrain control module) detects a high circuit condition with the glow plug control module electrical circuit."],"symptoms":["The glow plug warning light will illuminate and the engine will be slow to start in warm weather, or fail to start in cold weather.","If the engine does start there will be a pronounced knocking noise until the engine warms up to operating temperature. White smoke will be visible from the exhaust as the excess fuel from the hard start burns off. The engine will have a noticeable miss until the cylinder head temperatures rise sufficiently to support complete combustion.","Glow plug warning lamp illuminated:\n"],"causes":["They have a life expectancy of 30,000 - 40,000 miles and have reached their useful life and need replacement. Poor injection timing will cause undue wear on the glow plug. Next to the time replacement, a stuck glow plug relay or timer module will burn them out faster than a flea can jump on a slow moving dog."],"type":"WARN"}