{"code":"P0381","description":"Glow Plug/Heater Indicator Circuit Malfunction","info":["This diagnostic trouble code (DTC) is a generic powertrain code, which means that it applies to all 1996-newer vehicles (Volkswagen, Audi, Isuzu, Dodge, Ford, etc.). Although generic, the specific repair steps may vary depending on make/model.","When I encounter a stored code P0381, I know that the powertrain control module (PCM) has detected a malfunction in the glow plug heater indicator circuit. This code is used exclusively in diesel powered vehicles. Diesel engine glow plugs are used to increase cylinder temperatures in diesel engines, specifically during cold start conditions.","\n ","High compression is used to cause fuel to combust in diesel engines. Since compression ratios are so extreme, diesel engine blocks are typically more dense and heavy than engine blocks of gasoline fueled engines. This can lead to reduced cylinder temperatures which make the diesel engine more difficult to start, especially during cold weather conditions. Since diesel engines generate combustion without spark, cylinder temperature is crucial to cold start efficiency.","Cylinder temperature is increased when voltage is applied to the glow plugs and they literally begin to glow red hot. Most OBD-II equipped vehicles use one glow plug per cylinder, but some applications use fewer plugs, placed strategically within the intake manifold or cylinder head.","Glow plug heater voltage is normally controlled by the PCM but some vehicles are also equipped with a stand-alone glow plug heater controller. Others have a glow plug heater controller integrated within the PCM. The glow plug controller uses input signals from the engine coolant temperature sensor and the ambient air temperature sensor to calculate glow plug activation strategy. When the controller recognizes that conditions warrant glow plug activation, an output signal is sent to a glow plug timer relay which allows battery voltage to reach the glow plugs. Since the glow plugs are grounded by the engine block (or cylinder head) they become very hot and begin to glow when battery voltage is applied. Glow plug operation only takes place when the engine temperature is below a programmed temperature.","A typical diesel engine glow plug:\n","Included in the glow plug heater control circuit is the glow plug indicator. The glow plug indicator is an instrument panel integrated warning lamp that is illuminated when the glow plugs/heater are in operation. During cold start conditions, the glow plug indicator is typically illuminated after the ignition switch is turned to the ON position, and it goes off prior to starting the engine. This short period of time allows the energized glow plugs to heat the cylinders before attempting to start the engine. The glow plug indicator is designed to alert the driver that the glow plugs are in operation.","If the PCM detects a problem in the circuit that controls the glow plug/heater indicator, a P0381 will be stored and a malfunction indicator lamp may be illuminated."],"symptoms":["Delayed engine start up, especially during periods of extremely cold weather\nExcessive smoke from the exhaust\nNo glow plug indicator illumination\nConstant glow plug indicator illumination"],"causes":["Possible causes for this engine code include:","Defective glow plug indicator lamp bulb\nFaulty glow plug/heater relay\nGlow plug/heater controller malfunction\nOpen or shorted glow plug/heater indicator circuit\nBad instrument panel circuit board"],"type":"ERR"}