{"code":"P050A","description":"Cold Start Idle Air Control System Performance","info":["This generic powertrain diagnostic trouble code (DTC) typically applies to many OBD-II vehicles. That may include but is not limited to vehicles from Hyundai, Subaru, Suzuki, Mazda, VW, Honda, Kia, Cadillac, Nissan, Audi, etc.","\n ","A stored code P050A means that the powertrain control module (PCM) has detected a problem with the idle air control (IAC) system. The term cold start refers to an engine drivability strategy that is implemented only when the engine is at (or below) ambient temperature.","Controlled by the PCM, the IAC valve is responsible for regulating air flow through the throttle body and into the engine intake manifold when the engine is at idle.","With the throttle plate closed, very little air is allowed to enter the engine through the throttle bore. The engine will not idle smoothly with this miniscule amount of air. A steady supply of vacuum would be ineffective at promoting a smooth idle because variations in atmospheric pressure and engine temperature require varying degrees of intake air. An automatically adjustable method for varying idle air is required. The IAC valve meets this requirement.","The IAC is an electronically controlled valve that is mounted on the throttle body. It consists of a single housing with an electric motor and a pair of small air chambers. The two open chambers have a cone-shaped valve and seat between them. The IAC is mounted near the throttle bore so that one chamber is aligned with an intake opening outside the throttle plate. This chamber is called the inlet chamber. The second chamber (outlet chamber) is positioned so that it is aligned with an intake opening inside the throttle plate. When the valve is pushed flush into the seat, no air may pass between the two chambers. As the valve is lifted off the seat by the electric motor, ambient air can be drawn through the inlet and outlet chambers and into the intake manifold.","Idle Air Control (IAC) Valve:\n","The PCM uses input data from the crankshaft position sensor and camshaft position sensor to calculate engine RPM. Engine idle speed is programmed for a specific RPM level and the PCM uses the IAC motor to realize it. If actual engine RPM is higher than desired RPM, a voltage signal is output from the PCM to the IAC motor. The motor extends the valve into the seat and air flow to the engine is restricted; RPM level decreases accordingly. By the same token, if actual engine RPM is lower than desired RPM, the PCM emits the opposite voltage signal. The motor retracts the valve from the seat and more air is allowed to enter the intake; the RPM level is increased. Since desired RPM level is precisely and aggressively targeted by the PCM, the valve is moved in very small increments, continuously.","If the PCM cannot effectively control the engine RPM level at cold start, a code P050A will be stored and a malfunction indicator lamp (MIL) may be illuminated. Multiple failures will likely be required for MIL illumination."],"symptoms":["High or low engine RPM level\nEngine may stall at idle\nThe accelerator pedal may have to be depressed for the engine to start\nUnusual tapping or popping noise from IAC motor","Cold car:\n"],"causes":["Defective or dirty IAC valve\nVacuum leak\nOpen or shorted circuits or connectors\nDefective electronic coolant temperature (ECT) sensor"],"type":"ERR"}