{"code":"P050D","description":"Cold Start Rough Idle","info":["This generic powertrain diagnostic trouble code (DTC) typically applies to many OBD-II vehicles. That may include but is not limited to vehicles from Chevrolet, GMC, Dodge, Cadillac, Chrysler, Jeep, etc.","\n ","So, you are faced with diagnosing a stored a code P050D. It means that the powertrain control module (PCM) has detected a rough engine idle during cold start. Cold start is a term used to describe an engine drivability strategy that is implemented only when the engine is at (or below) ambient temperature.","Engine RPM is monitored (by the PCM) using data input signal voltage from the crankshaft position (CKP) sensor and the camshaft position (CMP) sensor.","The idle RPM level is also controlled by the PCM. To accomplish this ongoing task, intake airflow must be regulated during closed throttle conditions. The PCM regulates engine intake air at idle with an electronically controlled device called an idle air control (IAC) valve. If air is introduced to the engine that is not regulated by the PCM, it may result in a rough engine idle at cold start and a code P050D being stored. If lean exhaust codes or IAC related codes accompany the P050D, diagnose and repair those before attempting to diagnose the P050D.","Engine misfire can also be a contributor to rough idle under cold start conditions. If there are misfire codes stored, you will also want to diagnose and repair those prior to diagnosing a P050D. Chances are that if you fix the misfire; you’ll also repair the rough idle at cold start.","If the rough idle occurs only under cold start conditions, a malfunctioning engine coolant temperature (ECT) sensor may be at the root of your problem. Engine drivability strategy is much different under cold start conditions. If the PCM receives an inaccurate engine temperature signal at cold start-up, a rough idle may be created from insufficient fuel delivery or improper timing advance. An ECT sensor code may also be stored. As you have probably guessed, you will need to diagnose and repair any ECT sensor related codes before the P050D.","If, under cold start conditions the PCM detects a rough idle that cannot be stabilized within the programmed parameters, a code P050D will be stored and a malfunction indicator lamp (MIL) may be illuminated. Multiple ignition cycles (with a failure) may be required for MIL illumination.","Idle Air Control (IAC) Valve:\n"],"symptoms":["Rich/lean exhaust\nCold start drivability issues\nOther drivability related codes\nHissing or sucking noise from engine","Cold car:\n"],"causes":["Vacuum or air intake leaks\nBad spark plugs, plug boots, or ignition coils\nInsufficient fuel pressure/volume\nDefective ECT sensor\nShorted or open circuits or connectors"],"type":"ERR"}