{"code":"P051F","description":"Positive Crankcase Ventilation Filter Restriction","info":["This generic powertrain diagnostic trouble code (DTC) typically applies to many OBD-II vehicles. That may include but is not limited to vehicles from Ford, Dodge, Ram, Volvo, etc.","\n ","If you have a code P051F stored in your OBD-II vehicle, it means that the powertrain control module (PCM) has detected a signal from the crankcase pressure sensor that indicates an over pressure condition exists.","Air density (pressure) in the engine crankcase is monitored by the PCM using an input voltage signal from the crankcase pressure sensor. Crankcase pressure sensor input voltage is received (by the PCM) as actual units of pressure. Either kilopascal (kPa) units or inches of mercury (Hg) are used to measure crankcase pressure. The crankcase pressure sensor is typically located in or near one of the valve covers.","Because the lower end of the internal combustion engine must be sealed to prevent oil leaks, a certain amount of pressure is created there. This pressure is caused by drastic changes in temperature, the vapors created by engine oil, and the rapid centrifugal motion of the crankshaft, connecting rods, etc.","The positive crankcase ventilation (PCV) system uses carefully controlled intake vacuum to draw pressure from the crankcase through a specially designed valve (PCV valve) that only allows a single direction of flow. In the vast majority of vehicle applications, the PCV valve itself is responsible for filtering unwanted oil and debris and preventing it from entering the intake manifold. In this particular application, a PCV filter has been added as a precautionary measure for protecting the engine air delivery system from excess oil and debris.","If the PCM detects a level of pressure from the crankcase pressure sensor that exceeds maximum parameters, a code P051F will be stored and a malfunction indicator lamp (MIL) may be illuminated."],"symptoms":["Engine oil leaks\nSmoke (steam) from underhood area\nHissing (sucking) noise from engine area\nDrivability issues created by a vacuum leak"],"causes":["Clogged (bad) PCV filter\nFaulty PCV valve\nDefective crankcase pressure sensor\nOpen or shorted crankcase pressure sensor wiring\nPCM malfunction or PCM programming error","Photo example of a crankcase pressure sensor:\n"],"type":"ERR"}