{"code":"P0519","description":"Idle Air Control System Performance","info":["This diagnostic trouble code (DTC) is a generic powertrain code, which means that it applies to all 1996-newer vehicles (Dodge, Chrysler, Hyundai, Jeep, Mazda, etc.). Although generic, the specific repair steps may vary depending on make/model.","When your OBD-II equipped vehicle exhibits a malfunction indicator lamp (MIL) and a stored code P0519, it means that the powertrain control module (PCM) has detected a problem with the system performance of the intake idle air control (IAC) system. If there are other, more specific, IAC codes these must be diagnosed and repaired first.","\n ","The IAC system revolves around a linear servomotor that controls a plunger which regulates the amount of air allowed to bypass the throttle plate and enter the intake manifold. Controlling the amount of air allowed to bypass the throttle plate is conducive to controlling engine RPM at idle. When the throttle plate is closed (at idle), very little air is allowed to enter the engine through the throttle body. The engine cannot continue to idle with this small amount of air and would certainly stall. An auxiliary air (vacuum) source must be provided so that the engine can continue to idle with the throttle plate closed. Of course, the auxiliary vacuum source would be detrimental to engine performance and fuel efficiency when the throttle plate is opened (upon acceleration). Hence the need for a fully adjustable vacuum source that is controlled by the PCM.","The IAC valve plunger housing is manufactured with two separate openings that allow air to pass through them. The IAC valve is usually bolted to the intake manifold, on or near the throttle body. It is positioned so that, when it is open (the plunger moves out of the opening), ambient air is allowed to flow through it and into the manifold and when it is closed (the plunger fills the opening) ambient air cannot flow through it.","An example of an Idle Air Control (IAC) valve:\n","The IAC is seldom completely open or closed but remains constantly in motion; controlled by the PCM. The PCM uses input signals from the oxygen sensors, the throttle position sensor, and various other sensors to determine how much air should be allowed to bypass the throttle plate. As voltage and ground signals to the IAC valve are adjusted (by the PCM) the valve reacts accordingly. If the engine RPM levels fail to coincide with programmed desired limitations, a code P0519 will be stored and a MIL may be illuminated.","Related idle air control system circuit trouble codes include:","P0508 Idle Air Control System Circuit Low\nP0509 Idle Air Control System Circuit High\nP0511 Idle Air Control Circuit\nP0518 Idle Air Control Circuit Intermittent"],"symptoms":["High engine RPM level\nEngine stall, especially at idle\nUnusual noises from the throttle body area\nOther IAC related codes"],"causes":["Possible causes for this code include:","Defective IAC motor/valve\nEngine vacuum leak\nOpen or shorted IAC control wiring or connectors\nCarbon buildup in throttle body or IAC valve\nFaulty PCM or PCM programming error"],"type":"ERR"}