{"code":"P0513","description":"Incorrect Immobilizer Key","info":["This diagnostic trouble code (DTC) is a generic powertrain code, which means that it applies to all 1996-newer vehicles (Dodge, Chrysler, Hyundai, Jeep, Mazda, etc.). Although generic, the specific repair steps may vary depending on make/model.","If your OBD II equipped vehicle has exhibited an illuminated malfunction indicator lamp (MIL) accompanied by a stored code P0513, it means that the PCM has detected the presence of an immobilizer key that is does not recognize. This, of course, refers to the ignition key. If the ignition cylinder is turned on, the engine is cranked (not started), and the PCM does not detect any immobilizer key, a P0513 may also be stored.","\n ","If your vehicle is equipped with a certain kind of security system, it will require the presence of a microprocessor chip, which is manufactured into the (immobilizer) key or key fob, before the engine will start and run. Even if the ignition cylinder is turned to the start position and the engine cranks, it will not start because the fuel and ignition systems will have been disabled by the PCM.","With the microchip and circuit board integrated into the key (or key fob), it becomes a type of transponder. When the correct key/fob draws near the vehicle, an electromagnetic field (generated by the PCM) activates the microprocessor and makes certain functions possible. Once the correct key is activated, functions like door lock/unlock, trunk open, and push-to-start become operational on some models. Other models require a conventional metal key accompanied by a microchip for operation of these and other important functions.","After the microprocessor key/fob is activated, the PCM seeks to recognize a cryptographic signature from the key/fob. If the key/fob signature proves to be current and valid, fuel injection and ignition sequences are activated so that the engine will start. If the PCM fails to recognize the signature of the key/fob, a code P0513 may be stored, the security system will be activated, and fuel injection/ignition will be suspended. A malfunction indicator lamp may also be illuminated."],"symptoms":["Engine no start condition\nFlashing security light in instrument panel\nEngine may start after delayed reset period\nService engine lamp illumination"],"causes":["Possible causes for this code include:","Defective microprocessor key or key fob\nFaulty ignition cylinder\nBad PCM or a PCM programming error"],"type":"ERR"}