{"code":"P0514","description":"Battery Temperature Sensor Circuit Range/Performance","info":["This generic powertrain diagnostic trouble code can typically apply to all OBD-II equipped vehicles, but shows up more often in certain Chrysler, Dodge, Jeep, Mitsubishi and Toyota vehicles.","Although generic, the exact repair steps may vary depending on year, make, model and powertrain configuration.","\n ","The Battery Temperature Sensor (BTS) is usually located close to the battery /mounted inside the PCM (powertrain control module). The BTS sensor converts the temperature of the air surrounding the battery into an electrical signal for the Powertrain Control Module (PCM).","The PCM receives this voltage signal to determine how much voltage the battery will receive while charging the battery based upon localized temperatures. This code is set if this input does not match normal engine operating conditions stored in the PCM's memory, even for a second, as this diagnostic trouble code demonstrates. It also looks at the voltage signal from the BTS sensor to determine if it is correct at initial Key On.","Code P0514 indicates a range or performance problem in the circuit, and could have been set because of mechanical (physical damage to the sensor itself, thereby causing an electrical fault) or electrical (BTS sensor circuit) issues. These cannot be overlooked in the troubleshooting stage, especially when dealing with an intermittent problem.","P0516 is set when the voltage at the sensor stays below a set level (usually under 0.3V) for too long a period. This code is usually considered to be an electrical circuit issue.","P0517 is set when the voltage at the sensor stays above a set level (usually over 4.8V) for too long a period. This code is usually considered to be an electrical circuit issue.","Troubleshooting steps may vary depending upon manufacturer, type of BTS sensor and wire colors. An example of a battery temperature sensor is shown here:"],"symptoms":["Malfunction Indicator Lamp (MIL) on\nPossible low indicated charging voltage\nCharge indicator light on"],"causes":["14 15 Open in the signal circuit to the BTS sensor - possible\n14 15 Short to voltage in the signal circuit to the BTS sensor - possible\n14 15 16 Short to ground in the signal circuit to the BTS sensor - possible\n17 Short to power in the signal circuit to the BTS sensor - possible\n14 15 Failed BTS Sensor - likely\n16 17 Failed BTS Sensor - possible\nFailed PCM - unlikely"],"type":"ERR"}