{"code":"P0536","description":"A/C Evaporator Temperature Sensor Circuit Range/Performance","info":["This is a generic diagnostic trouble code (DTC) and applies to OBD-II vehicles. That may include but is not limited to vehicles from Ford, Chevrolet, Dodge, Ram, etc. Although generic, the exact repair steps may vary depending on year, make, model and powertrain configuration.","Essentially, the air conditioning evaporator operates in the opposite sense as a condenser. The condenser converts gas to fluid and the evaporator converts fluid to gas while absorbing heat from the fan air flowing through it in the process.","\n ","It's purpose is to remove heat from the air inside the cabin, in turn reducing the temperature inside the car. The functionality of the A/C evaporator temperature sensor is crucial to the proper operation of your HVAC (Heating, Ventilation and Air Conditioning) system. The ECM (Engine Control Module) uses electrical values from this sensor to adjust the temperature inside according to your needs, in coordination with your evaporator among other A/C components.","The ECM activates P0536 and associated codes (P0535, P0537, P0538, and P0539) when it detects an outside of desired electrical range condition within the A/C evaporator temperature sensor or it's circuits. This could equally be mechanical or an electrical problem, Always keep in mind the environment of the sensor (any sensor for that matter), it could be subjected to an environment posed with unique issues.","P0536 A/C Evaporator Temperature Sensor Circuit Range/Performance code is set when the ECM detects a range or performance problem within the A/C evaporator temperature sensor or it's circuit(s)."],"symptoms":["No cold air blowing from the air vents\nFan air temperature erratic/fluctuating\nA/C compressor clutch not engaging\nHVAC system not functioning as desired"],"causes":["Defective or damaged A/C Evaporator core\nDefective A/C Evaporator Temperature sensor\nDefective ECM ( Engine Control Module)\nWiring issue within the sensor's circuit\nWiring harness connector issue\nIntermittent electrical connection\nInternal resistance (corrosion, damaged harness, overheated circuit, etc..)"],"type":"ERR"}