{"code":"P0533","description":"A/C Refrigerant Pressure Sensor A Circuit High","info":["This is a generic diagnostic trouble code (DTC) and typically applies to OBD-II vehicles. Vehicle makes may include but aren't limited to Chevrolet / Chevy, Ford, Volvo, Dodge, Hyundai, Vauxhall, Honda, Nissan, Renault, Alfa Romeo, etc.","The air conditioning (A/C) refrigerant pressure sensor aids in assisting the HVAC (Heating, Ventilation and Air Conditioning) system in regulating the temperature inside the vehicle according to your demands.","\n ","The BCM (Body Control Module) or the ECC (Electronic Climate Control) Module monitors the sensor to determines system pressures, in turn can engage/disengage the compressor accordingly.","The A/C refrigerant pressure sensor is a pressure transducer, it converts refrigerant system pressure to analog electrical signal to allow for monitoring by the vehicle's modules. Typically, it does this using 3 wires: a 5 volt reference wire, signal wire and a ground wire. The modules compare the signal wire's values to the 5 volt reference, and can instantly calculate system pressures with this info.","The ECM (Engine Control Module) illuminates the MIL (Malfunction Indicator Lamp) with P0533 and associated codes (P0530, P0531, P0532, and P0533) when it detects a fault within the A/C refrigerant pressure sensor or it's circuits. Before doing any kind of diagnosing and/or repairing within the A/C, you must make sure you are aware of the numerous hazards involved in working with pressurized refrigerant. Most times, you can diagnose this type of code without opening the refrigerant system.","The code P0533 A/C Refrigerant Pressure Sensor A Circuit High is set when one of the modules monitors a high electrical value within the A/C refrigerant pressure sensor A or it's circuit. An example of an A/C refrigerant pressure sensor:"],"symptoms":["Inaccurate temperatures coming from fan air\nLimited HVAC use\nFan air temperature erratic/fluctuating\nA/C compressor not engaging when needed\nHVAC system operating abnormally"],"causes":["Defective or damaged A/C refrigerant pressure sensor\nA/C refrigerant pressure sensor leaking\nLow or incorrect refrigerant pressures/refrigerant level\nDamaged wire(s) (open,short to +, short to -, etc.)\nDamaged connector\nECC (Electronic Climate Control) or BCM (Body Control Module) issue\nPoor connections"],"type":"WARN"}