{"code":"P0571","description":"Cruise Control/Brake Switch A Circuit Malfunction","info":["This is a generic powertrain diagnostic trouble code (DTC) and typically applies to OBD-II vehicles. Vehicle makes may include but aren't limited to Chevrolet, GMC, VW, Audi, Dodge, Jeep, Volkswagen, Volvo, Peugeot, Ram, Chrysler, Kia, Mazda, Harley, Cadillac, etc.","The ECM (engine control module), among many other modules, don't only monitor different sensors and switches involved with the proper functionality of the engine but they also make sure to keep our creature comforts up and running (e.g. cruise control).","\n ","There are numerous factors that can alter the speed of your vehicle while you are driving down the road. Some of the new adaptive cruise control (ACC) systems actually adjusts vehicle speeds according to surroundings (e.g. passing, slowing for traffic, lane departure, emergency maneuvers, etc.).","That is beyond the point, with this fault, they are referring to the cruise control/brake switch \"A\" circuit malfunction. The proper operation of the brake switch is integral in the operation of your cruise control system. Given the fact that, one of many ways to disable or turn off cruise control is to depress the brake pedal, you will want to take care of this. Especially if you use cruise control in your day-to-day commuting. The letter designation in this case -- \"A\" -- may be referring to a specific wire, connector, harness, etc. To determine which one this code refers to, you will need to check out the appropriate manufacturer-specific service manual. If you are having a hard time finding what you need, it's always a good idea to look for a wiring diagram for the cruise control system. These diagrams, a lot of time, can provide you with valuable information (sometimes location, specifications, wire colors, etc.)","The P0571 Cruise Control/Brake Switch A Circuit Malfunction and related codes (P0572 and P0573) are set when the ECM (engine control module) detects a malfunction within the cruise control/brake switch \"A\" circuit.","Example of a brake switch and it's location:\n"],"symptoms":["Cruise control completely inoperative\nErratic cruise control operation\nCertain functions not operating as they should (e.g. set,resume, accel., etc.)\nCruise control turning on but not engaging\nNo brake lights if the brake light switch is faulty"],"causes":["Cruise control/Brake switch defective\nWiring issue (e.g. pinched on brake pedal, chafed, etc.)\nECM (engine control module) issue (i.e. internal short, open, etc.)\nDebris/dirt mechanically hindering brake switch operation\nBrake switch not adjusted properly\nBrake switch out of it's mount"],"type":"ERR"}