{"code":"P0584","description":"Cruise Control Vacuum Control Circuit High","info":["This is a generic powertrain diagnostic trouble code (DTC) and typically applies to OBD-II vehicles. Vehicle makes may include but aren't limited to Dodge, Chrysler, Jeep, Chevy, Hyundai, Ram, Ford, etc.","There are numerous possible ways your vehicle goes about controlling your cruise control system. One of the avenues manufacturers tend to use to control the cruise control, is a vacuum controlled and operated system.","\n ","Most times, they use vacuum as an efficient way of controlling a cruise control servo or a similar diaphragm-type control. The vacuum control circuit is integral to the proper operation of this system. The ECM (Engine control module) monitors/adjusts the vacuum control side accordingly, depending on the operator's cruise control demands. If the ECM loses it's monitoring capabilities to the cruise control vacuum control circuit, it will most likely cause your cruise control to stop functioning as it should. A lot of times, these systems will include a vacuum solenoid, which is in charge of controlling the vacuum flow to the control side of the system (i.e. it controls the speed of the vehicle, when cruise is active), that said, in other systems, the vacuum responsibilities are consolidated to solely the cruise control servo. As with many faults, this could be strictly an electrical issue caused by a mechanical issue, vice versa or both.","While monitoring your cruise control sensors, circuits, switches, etc., not to mention all the other systems in your vehicle, the ECM has detected a fault within the cruise control vacuum control circuit. Most likely one or more of the electrical values being monitored has gone out of range (i.e. beyond manufacturer specific-desired values).","For P0584, it indicates a high voltage situation from within the cruise control vacuum electrical circuit."],"symptoms":["Cruise control inoperative\nCEL (Check engine light) illuminated\nCertain functions not operating as they should (e.g. set,resume, accel., etc.)\nVehicle speed erratic, even with cruise set to specific speed\nCruise control light on permanently in instrument cluster\nOne or more cruise control functions not working properly\nWhistling noises from engine bay"],"causes":["Vacuum solenoid defective\nCruise control servo defective\nVacuum lines broken/cracked/disconnected/kinked\nMechanical obstruction in the cruise control servo's operating range\nWiring issue (e.g. short, open, corrosion, resistance, chafe, etc.)\nECM (Engine control module) issue\nMechanical obstruction in vacuum passageways\nSeized cruise control servo cable\nEngine vacuum system leak\nConnector issue (e.g. broken tabs, corroded pins, melted housings, insulation missing, etc.)"],"type":"WARN"}