{"code":"P0598","description":"Thermostat Heater Control Circuit Low","info":["This is a generic powertrain diagnostic trouble code (DTC), which means it covers all makes/models, 1996-newer. However, specific troubleshooting steps will vary depending on the vehicle.","The codes P0597, P0598 and P0599 all refer to an electronically controlled engine thermostat. They are generic codes, meaning they pertain to all vehicles using this type of thermostatic control, however, only a small number of manufacturers employ this type of system. Therefore, this trouble code article is basically identical for all three codes.","\n ","The P0598 diagnostic trouble code indicate a fault has occurred with this system where the control voltage is low. For the most part, German manufactured vehicles such as BMW, Mercedes, Audi, Mini, Volkswagen, Opel and Jaguar use this system.","The electronically controlled thermostat consists of various temperature and load sensors, a computer program and the control housing with a built-in thermostat.","Concept","By controlling the coolant flow or engine temperature electronically, part throttle increases fuel economy and reduces emissions, whereas reducing the temperature under load increases power."],"symptoms":["The check engine light will illuminate and one of the above codes will be set\nThe temperature gauge may read abnormally high if the thermostat failed in the partially closed position, conversely, it will read lower than normal if the thermostat failed in the full open position"],"causes":["Experience dictates that the problem usually lies in a loose or corroded electrical connector or the electrically operated thermostat itself is at fault. Occasionally, the Motronic (engine management) computer fails, but is the least likely cause.","A loose or corroded connector on the thermostat\nA coolant leak will cause the code to set\nThe thermostat itself has failed\nA short or open has occurred in the wiring harness between the computer and thermostat\nThe Motronic computer has failed"],"type":"WARN"}