{"code":"P0030","description":"Generic: HO2S Heater Control Circuit (Bank 1 Sensor 1)\nGM: HO2S Healer Control Circuit Conditions","info":["This diagnostic trouble code (DTC) is a generic powertrain code, which means that it applies to OBD-II equipped vehicles, including but not limited to Toyota, VW, Ford, Dodge, Honda, Chevrolet, Hyundai, Audi, Acura, etc. Specific repair steps may vary depending on the model.","For an engine to run properly, there needs to be a very specific air:fuel ratio of 14.7:1. To accomplish this the ECM (Engine control module) relies on the the Heated Oxygen sensors (HO2S). The HO2S detect oxygen content in the exhaust.","\n ","This information is then relayed to the ECM. The ECM uses this information to adjust the fuel delivered to the engine. A Heated Oxygen sensor contains a circuit dedicated to operating a heater that warms up the Oxygen sensor faster than the exhaust gasses could. This shortens the time the engine needs to achieve closed loop, which decreases emissions.","On some vehicles the O2 sensor heater is fed a 12V fused supply voltage and a computer controlled ground. The 12V supply voltage is supplied to the heater anytime the key is in the on position. The computer activates the heater under certain circumstances by completing the ground to the oxygen sensor heater. On other vehicles the O2 sensor heater may be supplied a computer controlled 12 volts feed and continuous ground. If the ECM detects a fault on the Bank 1, sensor 1 heater circuit a P0030 may set."],"symptoms":["Lengthened time needed to achieve closed loop\nMIL (Malfunction indicator lamp) illumination\nPossibly decreased fuel mileage depending on fault"],"causes":["Potential causes of a P0030 trouble code may include:","Failed or damaged heater circuit element inside the HO2S\nOpen on the O2 sensor heater's ground circuit\nOpen or short on O2 sensor heater's B+ battery feed (on some vehicles this may be the control circuit)\nPossible ECM failure (less likely)"],"type":"ERR"}