{"code":"P0039","description":"Turbo Charger Bypass Valve Control Circuit Range Performance","info":["This diagnostic trouble code (DTC) is a generic OBD-II powertrain code. It is considered generic because it applies to all makes and models of vehicles (1996-newer), although specific repair steps may vary depending on the make and model.","Owners of these these brands may include but are not limited to VW, Dodge, Saab, Pontiac, Ford, GM, etc.","\n ","A code P0039 Turbo/Super Charger Bypass Valve Control Circuit Range/Performance is stored in turbocharged and supercharged vehicles when the powertrain control module (PCM) has detected a turbocharger or supercharger boost pressure bypass valve control circuit malfunction. A service engine soon lamp may also be illuminated. If this code is exhibited in a vehicle that is not turbocharged or supercharged, suspect a PCM programming error.","The boost pressure bypass valve is an electronically controlled valve that is constructed to relieve turbo/supercharger boost pressure before it exceeds the manufacturer’s specified limit (usually between nine and fourteen-pounds). This is necessary in order to relieve potentially harmful (to the engine) boost pressure levels in the event of a turbo/supercharger malfunction. The boost pressure bypass valve is controlled by the powertrain control module (PCM) or a separate boost pressure control module. More often than not, the boost controller is an integrated part of the PCM. The boost controller gathers input signals from various engine sensors and uses them to calculate the optimum degree of turbo/supercharger boost pressure. The boost pressure bypass valve is then activated, using an electronic solenoid, electric motor, or vacuum control valve to achieve the desired amount of boost pressure. If the boost pressure sensor delivers an input signal to the PCM that indicates an inability to successfully control boost pressure, this code will be stored. Additionally, if the PCM detects an input voltage signal that is not within programmed limits, for a specified amount of time and under certain circumstances, a P0039 Turbo/Supercharger Bypass Valve Control Circuit Range/Performance code may be stored.","Turbo/supercharger bypass control valve operation is normally accomplished using a solenoid or a small electric motor. Vacuum operated valves are used on some models but this is design is much less common. The PCM supplies a direct voltage signal in order to activate electronically controlled valves but vacuum actuated valves are controlled using a vacuum control (or vacuum service) solenoid. The vacuum service solenoid is usually supplied with constant voltage and the PCM outputs a ground signal when the valve must be opened to relieve boost pressure. The valve closes automatically when the ground signal is stopped by the PCM. The vacuum actuated bypass valve is controlled using a voltage signal from the PCM applied to a vacuum service solenoid. Opening and closing the solenoid permits engine vacuum to the reach the valve (as required) to actuate opening. Consult the manufacturer’s service manual (or equivalent) for turbo/supercharger bypass control system specifications before beginning a diagnosis.\n"],"symptoms":["A significant reduction in engine performance\nHissing noises from the turbocharger (and/or hoses) or the supercharger\nEngine and/or transmission temperatures could be higher than normal\nExcessive exhaust system smoke\nSpark plug fouling\nCylinder detonation, caused by hotter engine temps, are also a possibility\nOther turbocharger boost related codes, engine misfire codes, or knock sensor codes may also be stored"],"causes":["Potential causes for this code include:","A shorted/open circuit in the turbocharger bypass control sensor circuit\nThe most common cause of a stored P0039 turbo/supercharger bypass valve control circuit range/performance code is probably a defective boost pressure sensor\nA defective turbo/supercharger bypass valve actuator\nTurbo/supercharger bypass valve failure is also fairly common\nCollapsed, disconnected, or split vacuum lines are a possibility (where a vacuum actuated bypass valve is used)\nLoose, corroded, or disconnected electrical wiring/connectors in the turbo/supercharger bypass control/boost pressure sensor reference circuit\nA bad PCM or boost controller"],"type":"ERR"}