{"code":"P0033","description":"Turbo Charger Bypass Valve Control Circuit","info":["This diagnostic trouble code (DTC) is a generic OBD-II powertrain code. It is considered generic because it applies to all makes and models of vehicles (1996-newer), although specific repair steps may vary depending on the make and model.","Owners of these these brands may include but are not limited to VW, Dodge, Saab, Pontiac, Ford, GM, etc.","\n ","If this code has been stored it means that the powertrain control module (PCM) has received an input signal from the turbocharger bypass valve control circuit that is not within programmed specifications.","The turbocharger bypass valve is usually controlled by the PCM or boost controller. The boost controller is sometimes a stand-alone controller but more frequently it is an integrated part of the PCM. Input data from various turbocharger and engine control sensors is calculated by the PCM to determine the desired position of the turbocharger bypass valve. The turbocharger bypass valve is used to (electronically) regulate boost pressure before it enters the engine intake manifold.","The bypass control valve is actuated using a small electronic motor (or vacuum control valve). The motor receives output voltage/ground signals from the boost controller or PCM. The signal wire of the turbo boost control circuit enables the PCM to monitor system voltage. If voltage is not within a predetermined range, the PCM detects it and this code is stored. A service/check engine lamp may also be illuminated.","Since the conditions for causing this code to be stored could lead to excessive turbocharger boost pressure, it should be addressed with some degree of urgency.\n"],"symptoms":["Reduced engine performance\nWhining or rattling noises from the turbocharger or turbo pipes\nExcessive smoke from the exhaust\nFouled spark plugs\nElevated engine and/or transmission temperature\nAbnormal hissing noises from the turbocharger wastegate and/or hoses\nAdditional codes may also be stored, including turbocharger boost related codes, engine misfire codes, or knock sensor codes\nDue to elevated engine temperatures, cylinder detonation is also a distinct possibility\nIf applicable, the boost pressure gauge may also exhibit abnormal levels of boost pressure."],"causes":["Potential causes for this code to set are:","Bad turbocharger bypass valve actuator\nDefective turbocharger bypass valve\nDisconnected, cracked, or collapsed vacuum line (vacuum actuated bypass valve)\nFaulty boost pressure sensor\nShorted or open wiring in the boost sensor circuit\nLoose, corroded, or disconnected electrical connectors in the boost sensor reference circuit\nDefective PCM or boost controller."],"type":"ERR"}