{"code":"P0054","description":"HO2S Heater Resistance (Bank 1 Sensor 2)","info":["This diagnostic trouble code (DTC) is a generic powertrain code, which means that it applies to all 1996-newer vehicles (Chevrolet, Ford, GMC, Mazda, Pontiac, Isuzu, etc.). Although generic, the specific repair steps may vary depending on make/model.","If your OBD-II equipped vehicle has stored a code P0054, it means that the powertrain control module (PCM) has detected a malfunction in the heater circuit of the downstream (or post catalytic converter) oxygen (O2) sensor for engine bank one. Bank 1 indicates the malfunction involves the bank of the engine that contains the number one cylinder. Sensor 2 means that the problem is related to the downstream sensor.","\n ","A zirconium dioxide sensing element protected by a vented steel housing makes up the business end of your O2 sensor. Platinum electrodes are used to connect the sensing element to wire leads in the O2 sensor wiring harness. The controller area network (CAN) allows the PCM to receive data from the O2 sensor. Data regarding the percentage of oxygen particles in the engine exhaust, as compared to the oxygen content of ambient air, is provided to the PCM by the O2 sensor. The PCM uses this data to calculate fuel delivery and ignition timing.","The heated O2 sensor uses battery voltage as a means to preheat during cold start conditions. In the heated O2 sensor, O2 sensor signal circuits are accompanied by a circuit dedicated to heating the sensor. The heater circuit usually carries battery voltage (12.6-volts minimum) and may be equipped with an in-line fuse. During low engine coolant temperature conditions, the PCM takes measures so that battery voltage is applied to the O2 sensor heater. This should occur until the engine reaches normal operating temperature and the PCM enters closed loop operation. Voltage is usually routed through the PCM, sometimes with help from a relay and/or fuses, and is initiated when the ignition switch is turned on during cold start conditions. The PCM is programmed to discontinue battery voltage to the O2 heater circuit once the engine reaches normal operating temperature, and it should take measures to do so.","Should the PCM detect a level of resistance from the O2 sensor heater circuit that is greater than programmed limitations allow, a code P0054 will be stored and a malfunction indicator lamp (MIL) may be illuminated. Certain models will require multiple ignition cycles (with a failure) for the MIL to be illuminated. Because of this, you will need to use the OBD-II readiness mode in order to make sure that your repairs are successful. Once you have performed repairs, drive the vehicle until the PCM enters readiness mode or the code is reset."],"symptoms":["Delayed start up due to a lean cold start condition\nDiminished fuel efficiency\nBlack smoke from exhaust due to a rich cold start condition\nOther related diagnostic trouble codes may also be stored"],"causes":["Potential causes of a P0054 trouble code may include:","Burnt, broken, or disconnected wiring and/or connectors\nA faulty O2 sensor\nBlown fuse or burnt fusible link\nDefective engine control relay"],"type":"ERR"}