{"code":"P0058","description":"Generic: HO2S Heater Control Circuit High (Bank 2 Sensor 2)\nNissan: Heated oxygen sensor (HO2S) 2 Bank 2 - heater voltage high","info":["This code is a generic powertrain code. It is considered generic because it applies to all makes and models of vehicles (1996-newer), although specific repair steps may be slightly different depending on the model.","Oxygen sensors with a heating element are common on today's engines. Heated Oxygen sensors (HO2S) are inputs used by the PCM (Powertrain Control Module) to determine oxygen content in the exhaust system.","\n ","The PCM uses the information gained from the Bank 2,2 HO2S mainly to monitor the efficiency of the catalytic converter. Integral to this sensor is a heater element. While in pre-OBD II vehicles an Oxygen sensor was a one wire sensor, now they are more commonly 4 wire sensors: Two dedicated to the oxygen sensor and two dedicated to the heater element. The oxygen sensor heater basically decreases the time needed to achieve closed loop. The PCM controls the heater on-time. The PCM also continuously monitors the heater circuits for abnormal voltages or in some cases, even abnormal amperages.","Depending on the make of vehicle, the Oxygen sensor heater is controlled one of two ways. (1) The PCM directly controls the voltage feed to the heater either directly or via a HO2S relay and a ground is supplied from the vehicle's common ground. (2) There is a fused 12 volt Battery feed (B+) that feeds 12 volts to the heater element anytime the ignition is on and the control of the heater is done by a driver in the PCM which controls the ground side of the heater circuit. Finding out which one you have is important because the PCM activates the heater under various circumstances. If the PCM detects an abnormally high voltage condition on the heater circuit, P0058 may set. This code is only referring to the heating circuitry half of the Oxygen sensor. Bank 2 is the side of the engine that does not contain cylinder #1."],"symptoms":["MIL (Malfunction indicator lamp) illumination","There would likely be no other symptoms."],"causes":["Potential causes of a P0058 code include:","Faulty Bank 2,2 HO2S (Heated Oxygen sensor)\nOpen in the heater control circuit (12 volt PCM controlled systems)\nShort to B+ (battery voltage) in the heater control circuit (12 volt PCM controlled systems)\nOpen ground circuit (12 volt PCM controlled systems)\nShort to ground on heater control circuit (On PCM ground controlled systems)"],"type":"WARN"}