{"code":"P0053","description":"HO2S Heater Resistance (Bank 1 Sensor 1)","info":["This diagnostic trouble code (DTC) is a generic powertrain code, which means that it applies to all 1996-newer vehicles (Chevrolet, Ford, GMC, Mazda, Pontiac, Isuzu, etc.). Although generic, the specific repair steps may vary depending on make/model.","When I discover a stored P0053 code, I know that the powertrain control module (PCM) has detected a malfunction in the heater circuit of the upstream (or pre catalytic converter) oxygen (O2) sensor. Bank 1 indicates the malfunction concerns the bank of the engine that contains the number one cylinder. Sensor 1 means that the problem relates to the upstream sensor.","\n ","O2 sensors are made with a zirconium dioxide sensing element protected by a vented steel housing. The sensing element is attached to wire leads in the O2 sensor wiring harness using platinum electrodes. The controller area network (CAN) connects the PCM to the O2 sensor wiring harness. The O2 sensor provides the PCM with data regarding the percentage of oxygen particles in the engine exhaust as compared to the oxygen content of ambient air.","In the heated O2 sensor, battery voltage is used to preheat the sensor during cold start conditions. In addition to the O2 sensor signal circuits there is also a circuit dedicated to heating the sensor. It typically carries battery voltage (12.6-volts minimum) and may have an in-line fuse. When the PCM detects that engine coolant temperature conditions are within a programmed limit, battery voltage is applied to the O2 sensor heater circuit until the PCM enters closed loop operation. Voltage is usually routed through the PCM, sometimes with help from a relay and/or fuses, and is initiated when the ignition switch is turned on during cold start conditions. Once the engine reaches normal operating temperature, the PCM is programmed to discontinue battery voltage to the O2 heater circuit and takes measures to do so.","If the PCM detects a level of resistance from the O2 sensor heater circuit that is greater than programmed limitations allow, a code P0053 will be stored and a malfunction indicator lamp (MIL) will likely be illuminated. Some vehicles may require multiple ignition cycles (with a failure) for the MIL to be illuminated. For this reason you will need to use the OBD-II readiness mode in order to make sure that your repairs are successful. After completing repairs, drive the vehicle until the PCM enters readiness mode or the code is reset."],"symptoms":["Diminished fuel efficiency\nBlack smoke from exhaust due to a rich cold start condition\nDelayed start up due to a lean cold start condition\nOther related diagnostic trouble codes may also be stored"],"causes":["Potential causes of a P0053 trouble code may include:","A faulty O2 sensor\nBurnt, broken, or disconnected wiring and/or connectors\nBlown fuse or burnt fusible link\nDefective engine control relay"],"type":"ERR"}