{"code":"P006B","description":"MAP - Exhaust Pressure Correlation","info":["This generic powertrain diagnostic trouble code (DTC) typically applies to many OBD-II vehicles. That may include but is not limited to vehicles from Ford, GMC, Chevrolet, Dodge, etc., however it seems to be most common on Ford Powerstroke Diesel Trucks.","If your OBD-II vehicle has stored a code P006B, it means that the powertrain control module (PCM) has detected a discrepancy in the correlating signals between the manifold absolute pressure (MAP) sensor and the exhaust pressure sensor (EPS).","\n ","In some vehicle applications, the MAP sensor may be referred to as a barometric pressure sensor. In my professional experience, only vehicles with diesel engines utilize exhaust pressure sensors. If other MAP sensor or exhaust related codes are present, diagnose and repair those before attempting to diagnose a code P006B.","The MAP sensor measures air density (pressure) in the intake manifold in either kilopascal (kPa) units or inches of mercury (Hg). These measurements are received by the PCM as input voltage signals. If the MAP signal is substituted for a barometric pressure signal, it is still measured in similar increments. Diesel equipped vehicles utilize one or more exhaust pressure sensors to monitor exhaust back pressure. Exhaust back pressure is an excellent indicator of catalyst efficiency, diesel particulate filter efficiency, and NOx filter efficiency. Exhaust back pressure is also critical to engine performance and emission reduction in today’s clean burning diesel engines.","A code P006B will be stored, and a malfunction indicator lamp (MIL) may be illuminated, if the PCM detects voltage input signals (between the MAP sensor and the exhaust pressure sensor) which differ by more than a programmed degree over a certain period of time and under a particular set of circumstances. A reliable vehicle information source (such as AllData DIY) will yield exact parameters for code storage as it relates to the vehicle in question. In some vehicle applications, MIL illumination may require multiple drive cycles with a failure.","An example of a MAF sensor:\n"],"symptoms":["Abnormally excessive smoke from exhaust\nExcessive fuel consumption\nA general lack of engine performance\nRich or lean exhaust condition"],"causes":["Defective exhaust pressure sensor\nFaulty MAP sensor\nOpen or shorted wiring or connectors\nPCM or PCM programming error"],"type":"ERR"}