{"code":"P0068","description":"MAP/MAF - Throttle Position Correlation","info":["This diagnostic trouble code (DTC) is a generic powertrain code. It is considered generic because it applies to all makes and models of vehicles (1996-newer), although specific repair steps may be slightly different depending on the model.","The generic trouble code P0068 refers to an engine management problem. A disparity exists between the computer's sensors as to the volume of air entering the intake manifold.","\n ","The PCM relies on three sensors to indicate air flow volume in order to calculate fuel and timing tactics. These sensors include the mass airflow sensor, throttle position sensor and the Manifold pressure (MAP) sensor. There are many sensors on the engine however these are the three associated with this code.","The mass airflow sensor is located between the air cleaner and the throttle body. Its job is to signal the amount of air passing through the throttle body. In order to accomplish this, a thin piece of resistance wire the thickness of a hair stretches across in the inlet of the sensor.","The computer sends voltage to this wire to heat it to a predetermined temperature. As air volume increases it requires more voltage to maintain the temperature. Conversely, it requires less voltage as the air volume drops. The computer recognizes this voltage as an indication of air volume.","The throttle position sensor rests on the opposite side of the throttle plate in the throttle body. When closed, the throttle plate prevents airflow into the engine. Air necessary for idle bypasses the throttle valve by way of an idle air control motor.","Most later model vehicles use a throttle position sensor on the floorboards at the top of the gas pedal. As the pedal is depressed the sensor attached to the pedal sends a voltage to an electric motor that controls the opening of the throttle plate.","In operation, the throttle position sensor is nothing more than a rheostat. With the throttle plate closed at idle, the throttle position sensor registers very close to 0.5 volts and when opened as in accelerating, the voltage will rise to approximately 5 volts. The transition from 0.5 to 5 volts should be very smooth. The engine's computer recognizes this increase in voltage as a signal indicating the amount of airflow and rate of opening.","The Manifold Absolute Pressure (MAP) has a dual role in this scenario. It senses the manifold pressure corrected for air density due to temperature, humidity and altitude. It is also linked to the intake manifold through a hose. When the throttle suddenly opens the manifold pressure drops just as sudden and rises again as the air flow increases.","The engine management computer requires all three of these sensors to accurately strategize the length of time to open the injectors and how much spark advance is necessary to maintain a 14.5/1 fuel ratio. If, for some reason one of these sensors or a mechanical problem causes a disparity between the rest, the computer is incapable of making the proper adjustments and sets the P0068 trouble code."],"symptoms":["The symptoms displayed for a P0068 code will depend on the cause of the overboost condition:","The service engine soon or check engine light will illuminate.\nRough running engine - the computer will set the above code and additional codes depicting the faulty sensor if the problem is electrical.Without the correct airflow the engine will develop a rough idle, and depending on the severity, it may not accelerate or have a serious dead spot off idle. In short, it will run lousy"],"causes":["Potential causes for this DTC include:","Vacuum leaks between the mass airflow sensor and intake manifold and loose or cracked hoses\nDirty air cleaner\nLeak in the intake manifold or sections\nFaulty sensor\nCoked intake runner behind throttle body\nPoor or corroded electrical connectors\nObstruction to air flow\nDefective electronic throttle body\nObstruction in hose from intake manifold to MAP sensor"],"type":"ERR"}