{"code":"P006A","description":"MAP - Mass or Volume Air Flow Correlation Bank 1","info":["This generic powertrain diagnostic trouble code (DTC) typically applies to many OBD-II vehicles. That may include but is not limited to vehicles from Land Rover, Ford, Alfa Romeo, Toyota, etc.","A stored code P006A, means that the powertrain control module (PCM) has detected a discrepancy in the correlating signals between the manifold absolute pressure (MAP) sensor and the mass or volume air flow sensor (MAF/VAF) for engine bank one.","\n ","Bank 1 denotes the bank of the engine which contains the number one cylinder. Consult a reliable vehicle information source for the location of the number one cylinder for the vehicle in question. Only vehicles that are equipped with multiple (one per engine bank) throttle body openings should exhibit this code.","Air density (pressure) in the intake manifold is reflected using the MAP sensor which supplies the PCM with a voltage signal. This input voltage signal is received (by the PCM) as either kilopascal (kPa) units or inches of mercury (Hg). In some cases, MAP is substituted for barometric pressure and measured in similar increments. When the internal combustion engine is operating at peak efficiency, it creates a strong vacuum which must be restricted to only the throttle body opening/s. Vacuum is regulated by the throttle plate (controlled by the driver under acceleration) and the idle air control (IAC) valve when the engine is at idle. This vacuum effectively draws in the air required to complete each combustion cycle.","A precise fuel to air ratio is one of the most critical factors in achieving maximum fuel efficiency and the minimization of harmful exhaust emissions in mass produced vehicles. As the throttle plate/s are opened, air entering the intake manifold is measured by either the MAF or VAF sensor/s. Fuel delivery and ignition timing strategy are calculated (by the PCM) using data contrived from these MAF or VAF sensor/s. Air which passes through these devices is referred to as metered air. Air which is involuntarily introduced to the engine (vacuum leaks) can contribute to excessively lean (too much air or not enough fuel) conditions and is called unmetered air.","There are two basic types of air metering devices:","MAF Sensor","This type of sensor is most often used in domestic vehicles. It is based around one or more thermal resistors which are suspended in the bore of the sensor housing, so that air can flow directly across them. One of the thermal resistors monitors MAF while the other measures intake air temperature (IAT). Hot wire MAF sensors use voltage applied directly to a single resistor to monitor the amount of intake air which flows across it. As ambient air flow across the resistor is increased, the temperature of the resistor decreases resulting in a drop in the resistance level of the circuit. These changes in the resistance level of the circuit result in voltage variations which the PCM receives as a particular measure of metered air entering the engine intake manifold. Cold wire MAF sensors usually look similar to hot wire sensors and use a similar system of metering intake air. In the cold wire MAF, a pair of thermal resistors also may be used. The first is positioned in a recessed area of the sensor housing and measures only ambient air temperature, as it enters the sensor. The second thermal resistor is positioned near the center of the bore so that incoming air can flow across it, as the throttle plate is opened. When the engine is running, the PCM compares input voltage signals from each of these resistors to determine precisely how much metered air is being drawn into the engine.","VAF Sensor","The key difference between the MAF and the VAF is that the VAF is configured with a door or a flap that is opened by air that is drawn into the intake. This type of air metering device is used primarily in vehicles imported from Europe. At idle, the spring loaded flap is secured in the closed position. When the throttle is opened, the door is forced open. The action of the door/flap on its hinge actuates a potentiometer that transmits a voltage signal to the PCM. The PCM recognizes these variations in potentiometer voltage as the degree of metered air being drawn into the intake.","A code P006A will be stored, and a malfunction indicator lamp (MIL) may be illuminated, if the PCM detects voltage signals between the MAP sensor and the MAF/VAF sensor (Bank 1) which differ by more than a programmed degree. MIL illumination may require multiple ignition cycles with a failure.","An example of a MAF sensor:\n"],"symptoms":["Hesitation or stall upon acceleration\nRich or lean exhaust\nReduced fuel efficiency\nDiminished engine performance"],"causes":["Defective MAP sensor\nFaulty or contaminated MAF/VAF sensor\nOpen or shorted wiring or connectors in the related circuits\nCracked or broken air inlet pipe\nInsufficient engine vacuum\nPCM or PCM programming error"],"type":"ERR"}