{"code":"P0066","description":"Air Assisted Injector Control Circuit Or Circuit Low","info":["This diagnostic trouble code (DTC) is a generic powertrain code, which means that it applies to OBD-II equipped vehicles that have an air assisted fuel injector. Brands of vehicles may include but are not limited to Subaru, Jaguar, Chevy, Dodge, VW, Toyota, Honda, etc. but mainly only shows up on Subaru and Jaguar vehicles. Although generic, the specific repair steps may vary depending on make/model/engine.","The Air Assisted injector is similar a normal fuel injector. Just like the name implies, it uses air to assist in atomizing the fuel that is being injected/sprayed. In most cases, this particular injector is used to help with cold starts. When your engine is cold, It requires a richer air/fuel mixture (more fuel) in order to start.","\n ","The atomization that happens when air is introduced to a normal injector is desired simply because it aids in a more evenly distributed spray. This matters because generally speaking, these systems only use one injector mounted to the throttle body or intake and the atomized fuel spray is distributed between X number cylinders.","The ECM (engine control module) illuminates the check engine light with P0066 and associated codes when it monitors a condition outside of a specific range within the Air Assisted Injector's circuit. Generally speaking this is an electrical issue but sometime an internal malfunction within the injector itself may cause this condition.","P0066 Air Assisted Injector Control Circuit or Circuit Low code is set when the ECM monitors a low electrical value within the circuit. This air assisted injector control DTC is closely related to P0065 and P0067."],"symptoms":["Hard to start when engine is cold\nSmoking\nPoor performance when cold\nEngine misfiring\nPoor fuel mileage"],"causes":["Broken or damaged wiring harness\nVacuum leak within injector or in hoses/clamps\nFuse/relay defective\nAir Assisted Fuel Injector defective\nECM issue\nPin/connector problem. (e.g. corrosion, overheating, etc.)"],"type":"WARN"}