{"code":"P006D","description":"Barometric Pressure - Turbocharger/Supercharger Inlet Pressure Correlation","info":["This generic powertrain diagnostic trouble code (DTC) typically applies to many OBD-II vehicles. That may include but is not limited to vehicles from Dodge, Cadillac, Fiat, Jeep, Nissan, Chrysler, etc.","A stored code P006D means that the powertrain control module (PCM) has detected a discrepancy in the correlating signals between the barometric pressure sensor and the turbocharger/supercharger inlet pressure sensor.","\n ","The code P006D is applicable exclusively to vehicles with forced air induction systems. Other stored barometric pressure sensor or forced air induction system codes should be diagnosed and repaired before attempting to diagnose a code P006D.","Barometric pressure (air density) is measured in either kilopascal (kPa) units or inches of mercury (Hg), utilizing the barometric pressure sensor. These measurements are input to the PCM as varying degrees of voltage. Barometric pressure and barometric pressure signals are measured in similar increments.","The turbocharger/supercharger inlet pressure sensor will typically be of a similar design to the barometric pressure sensor. It also monitors air density. It is most often positioned inside the turbocharger/supercharger inlet hose and it provides the PCM with an appropriate voltage signal reflecting such.","If voltage input signals (between the barometric pressure sensor and the turbocharger/supercharger inlet pressure sensor) differ by more than a programmed degree (over a certain period of time and under a particular set of circumstances), a code P006D will be stored, and a malfunction indicator lamp (MIL) may be illuminated.","In some vehicle applications, MIL illumination may require multiple drive cycles with a failure. Exact parameters for code storage (as it relates to the vehicle in question) can be obtained by consulting a reliable vehicle information source (such as AllData DIY)."],"symptoms":["Reduced engine performance\nDecreased fuel efficiency\nDelayed engine acceleration\nA rich or lean condition\nLouder than normal hissing/suction noise upon acceleration"],"causes":["Defective barometric pressure sensor\nFaulty turbocharger/supercharger inlet pressure sensor\nOpen or shorted wiring or connector\nInsufficient engine vacuum\nRestricted air intake\nPCM or PCM programming error"],"type":"ERR"}