{"code":"P007F","description":"Charge Air Cooler Temperature Sensor Bank1/Bank2 Correlation","info":["This generic powertrain diagnostic trouble code (DTC) typically applies to many OBD-II vehicles. That may include but is not limited to vehicles from Ford, Range Rover, Mercedes-Benz, etc.","\n ","A stored code P007F means that the powertrain control module (PCM) has detected a discrepancy in the correlating signals between the charge air temperature (CAT) sensors for the separate banks of the engine. Bank 1 refers to the engine bank that contains the number one cylinder.","As you have probably gathered by the code description, a P007F is applicable only to vehicles that are equipped with forced air induction systems and multiple intake air inlet sources. Intake air inlet sources include throttle bodies and forced air induction systems are configured around turbochargers and superchargers.","CAT sensors are typically composed of a thermal resistor in a plastic housing. The CAT sensor is inserted through the air inlet tube (from outside to inside) with the resistor suspended on a two-wire pedestal. It is positioned so that ambient air entering the turbocharger inlet pipe (after leaving the air charge cooler/intercooler), may flow across it. The CAT sensor is normally designed to thread or bolt into the turbocharger/supercharger inlet pipe, near the intercooler.","The level of resistance in the CAT sensor resistor decreases as actual charge air temperature increases. This causes circuit voltage to move towards the reference maximum. The PCM recognizes these variations in CAT sensor voltage as changes in charge air temperature and reacts accordingly.","The CAT sensors provide data to the PCM for boost pressure solenoid operation and boost pressure release valve operation, as well as certain facets of fuel delivery and ignition timing calibration.","If the PCM detects voltage signals from the CAT sensors (for engine banks one and two) which reflect a difference that exceeds the maximum allowable parameters, a code P007F will be stored and a malfunction indicator lamp (MIL) may be illuminated. Multiple drive cycles with a detected failure may be required for MIL illumination."],"symptoms":["Diminished engine performance\nLouder then normal sucking or hissing noise on acceleration\nHesitation upon acceleration\nRich or lean exhaust condition\nDiminished fuel efficiency"],"causes":["Defective CAT sensor\nDisconnected or burst air inlet hose\nOpen or shorted CAT sensor wiring or connector\nRestricted air filter element\nIntroduction of aftermarket methanol injection systems\nPCM or PCM programming error"],"type":"ERR"}