{"code":"P0088","description":"Fuel Rail/System Pressure - Too High","info":["This diagnostic trouble code (DTC) is a generic powertrain code, which means that it applies to all 1996-newer vehicles (Audi, Dodge, Isuzu, Toyota, VW, Jeep, Chevrolet, etc.). Although generic, the specific repair steps may vary depending on make/model.","\n ","Some vehicles are equipped with a returnless fuel supply, this means that the fuel pump is pulse width modulated and can vary in pump speed to deliver fuel to the rail at a varible rate instead of constantly running the fuel pump and regulating the pressure with a pressure regulator, returning fuel back to the tank.","When a code P0088 is presented, it means that the powertrain control module (PCM) has detected a fuel rail pressure or fuel pressure sensor voltage input that exceeds maximum specifications.","The fuel rail pressure sensor is typically of the three-wire, piezoelectric variety. Usually a 5-volt reference voltage signal and a ground signal are supplied to the sensor. As fuel pressure (at the sensor) increases, sensor resistance decreases. If five is maximum voltage to the sensor, and fuel pressure is at its lowest, sensor output should be approximately .5-volts, because sensor resistance is at its highest. As fuel pressure increases and sensor resistance decreases, the sensor signal voltage to the PCM should increase accordingly up to a maximum of 4.5-volts. These voltage figures are generic and you should consult the manufacturer’s service manual for your vehicle prior to testing.","There is another fuel rail pressure sensor design that incorporates intake vacuum. Instead of monitoring fuel rail pressure directly, the sensor monitors the degree of intake manifold vacuum and sensor resistance is varied accordingly. The PCM receives the input voltage signal in much the same way as the straight fuel pressure sensor.","In yet another type of fuel rail pressure sensor, the fuel pressure regulator is integrated. The pressure sensor has no bearing on the regulation of fuel pressure to the fuel rail but the regulator may (or may not) be electronically regulated. Even if the fuel pressure regulator and sensor are integrated, the regulator may also be vacuum actuated.","Fuel rail pressure sensor voltage is received by the PCM, which adjusts fuel pump voltage to accomplish the desired amount of fuel rail pressure. This promotes more efficient fuel consumption.","If fuel rail pressure is higher than the amount programmed into the PCM, a P0088 will be stored and a service engine soon lamp may be illuminated."],"symptoms":["Delayed startup, especially when the engine is cool\nBlack smoke from the exhaust system\nDiminished fuel efficiency\nSpark plug fouling is possible in extreme circumstances\nEngine misfire codes and idle control codes may accompany a P0088"],"causes":["Potential causes of a P0088 trouble code may include:","Defective fuel pressure regulator\nFaulty fuel rail pressure sensor\nShorted or open wiring and/or connectors in the fuel rail pressure sensor circuit\nA bad PCM or a PCM programming error"],"type":"WARN"}