{"code":"P008E","description":"Fuel Cooler Pump Control Circuit High","info":["This generic powertrain diagnostic trouble code (DTC) typically applies to diesel engine OBD-II vehicles. That may include but is not limited to vehicles from Ford / Powerstroke, BMW, Dodge / Ram / Cummins, Chevrolet, GMC, etc. Although generic, the specific repair steps may vary depending on make/model.","Trouble code P008E is one of several possible codes associated to diesel powered vehicles that indicates that the Powertrain Control Module (PCM) has detected a malfunction and with the operation of the Fuel Cooler Pump Control Circuit that is incorporated to facilitate the proper operation of a diesel engine.","\n ","The codes that are commonly associated to Fuel Cooler Pump Control Circuit malfunctions are P008C, P008D and P008E.","The purpose of the Fuel Cooler Pump Control Circuit is to control the operation of the fuel cooler pump. This feature is specific to diesel powered vehicles to cool the excess fuel prior to returning the fuel back to the fuel supply system. The fuel is cooled by the fuel cooler that operates in a similar manner to a radiator using coolant to remove heat from the fuel.","The pump is temperature controlled by the Fuel Cooler Pump Control Circuit that turns the pump on to route fuel through the fuel cooler assembly prior to returning the fuel back to the fuel tank. This process will vary based on the specific diesel powered vehicle and the fuel system configuration. The end result is the same providing optimum performance and protecting fuel system components.","Based of the specific diesel powered vehicle involved, various other codes may be activated by the PCM and illuminate the Check Engine Light as well.","Code P008E is set by the PCM when the Fuel Cooler Pump Control Circuit has higher than normal voltage.","In this photo, you can see the fuel cooler, the lines, and the fuel cooler pump (center) connected to the lines:\n"],"symptoms":["Decreased engine performance\nAcceleration and idle surging\nCheck Engine Light illuminated\nIncreased fuel consumption\nNoise coming from the fuel cooler pump"],"causes":["Defective fuel cooler pump\nCorroded or damaged connector\nFaulty or damaged wiring\nFaulty PCM"],"type":"WARN"}