{"code":"P008F","description":"Engine Coolant Temperature/Fuel Temperature Correlation","info":["This generic powertrain diagnostic trouble code (DTC) typically applies to many OBD-II vehicles. That may include but is not limited to vehicles from Mercedes-Benz, Chevrolet, Sprinter, GMC, Ford, etc.","\n ","When your OBD-II equipped vehicle exhibits a service engine soon lamp and a code P008F is stored, it means that the powertrain control module (PCM) has detected a discrepancy in the correlating signals between perceived engine coolant temperature (ECT) and fuel temperature.","Engine coolant temperature and fuel temperature are typically monitored in comparison only when the engine is at ambient temperature.","ECT sensors are composed of a thermal resistor that is dipped in a hard resin and sealed in a metal or plastic housing. Brass is the most common metal used as ECT sensor housing material. The ECT housing is designed so that it may be threaded into a coolant passage in the engine intake manifold, cylinder head, or block. As warm coolant passes through the passages and across the ECT sensor, the level of thermal resistance in the ECT decreases. When engine coolants decreases in temperature, resistance increases and ECT sensor circuit voltage is reduced as a result. These fluctuations in resistance (which result in voltage variations) are interpreted by the PCM as changes in engine coolant temperature. ECT sensor input data is critical in calculating fuel delivery and ignition timing strategy.","The fuel temperature sensor also uses a thermal resistor but it is of the low voltage variety. It is most often integrated into the fuel level sending unit and provides the PCM with a voltage signal that reflects fuel temperature whenever the ignition is in the ON position. Fuel temperature can be especially crucial to drivability in vehicle applications which utilize a diesel engine. Fuel temperature is also more of a concern in extremely cold climates.","A code P008F will be stored and a malfunction indicator lamp (MIL) may be illuminated if the PCM detects a discrepancy (between the ECT sensor and the fuel temperature sensor) which varies by more than the maximum allowable parameters over a set period of time and under a certain set of circumstances."],"symptoms":["Reduced engine performance\nDiminished fuel efficiency\nExcessively rich exhaust"],"causes":["Faulty ECT sensor\nBad fuel temperature sensor\nOpen or shorted wiring or connector\nPCM or PCM programming error"],"type":"ERR"}