{"code":"P009A","description":"Intake Air Temperature/Ambient Air Temperature Correlation","info":["This generic powertrain diagnostic trouble code (DTC) typically applies to many OBD-II vehicles. That may include but is not limited to vehicles from Mercedes-Benz, Jeep, Mazda, Ford, etc.","\n ","If you have a service engine soon lamp accompanied by a code P009A, it means that the powertrain control module (PCM) has detected a discrepancy in the correlating signals between the intake air temperature (IAT) sensor and the ambient air temperature sensor. IAT and ambient air temperature must be monitored in comparison to ensure that no obstructions impede vital air flow to the engine intake.","IAT sensors are normally composed of a thermal resistor that protrudes from a plastic housing on a two-wire pedestal. The sensor is inserted into the air intake pipe or air filter housing. A secondary IAT sensor design integrates the sensor inside the mass air flow (MAF) sensor housing. Sometimes the IAT thermal resistor is positioned parallel with the MAF hot wire and other times it is located in a recessed area away from air flow. Check IAT sensor location specifications for the vehicle in question before making any assumptions.","The thermal resistor is usually positioned so that intake air may flow across it. The sensor housing is typically designed to be stuffed into its mounting point through a thick rubber grommet. As intake air temperature increases, the level of resistance in the IAT resistor decreases; causing circuit voltage to move towards the reference maximum. When air is cooler, IAT sensor resistance increases. That results in decreased IAT sensor circuit voltage. The PCM sees these variations in IAT sensor signal voltage as changes in intake air temperature.","The ambient air temperature sensor acts in much the same manner as the IAT sensor. The ambient air temperature sensor is normally positioned near the grill area.","A code P009A will be stored and a malfunction indicator lamp (MIL) may be illuminated if the PCM detects voltage signals from the IAT sensor and the ambient air temperature sensor which differ by more than the maximum allowable amount for a certain period of time. On some vehicle applications, MIL illumination may require multiple ignition cycles with a failure."],"symptoms":["There may be no symptoms exhibited with this code\nEngine drivability issues\nA reduction in fuel efficiency"],"causes":["IAT sensor left unplugged after service\nBad ambient air temperature sensor\nFaulty IAT sensor\nOpen or shorted circuits or connectors\nDefective PCM or PCM programming error"],"type":"ERR"}