{"code":"P0090","description":"Fuel Pressure Regulator 1 Control Circuit Open","info":["This diagnostic trouble code (DTC) is a generic powertrain code, which means that it applies to OBD-II equipped vehicles (GMC, Chevy, Chrsyler, Dodge, Jeep, Mitsubishi, VW, Toyota, etc.). Although generic, the specific repair steps may vary depending on make/model.","A stored code P0090 means that the powertrain control module (PCM) has detected an open control circuit in the electronic fuel pressure regulator (designated 1). This designation is used in systems that incorporate multiple electronic fuel pressure regulators. This type of designation may refer to the engine bank but not exclusively. Also, the word open could be substituted for disconnected or broken.","\n ","The electronic fuel pressure regulator is typically controlled by the PCM. A battery voltage signal and a ground signal are used to control a servo motor which positions a valve so that the desired level of fuel pressure can be achieved for any given set of circumstance. As voltage is applied to the electronic fuel pressure regulator servo motor, the valve is opened in small increments and fuel pressure is increased. When voltage is decreased, the servo retracts and a strong spring forces the valve to close; fuel pressure is decreased.","The fuel pressure sensor (usually located in the fuel injector rail) allows the PCM to monitor fuel pressure and adjust fuel pressure regulator voltage accordingly.","The fuel pressure regulator and fuel pressure sensor may be separate components but are most often integrated into a single housing which has one electrical connector.","If actual fuel pressure fails to comply with desired fuel pressure, as calculated by the PCM, a P0090 may be stored and a malfunction indicator lamp (MIL) illuminated.","Related fuel pressure regulator engine codes:","P0089 Fuel Pressure Regulator 1 Performance\nP0091 Fuel Pressure Regulator 1 Control Circuit Low\nP0092 Fuel Pressure Regulator 1 Control Circuit High"],"symptoms":["Delayed startup\nBlack smoke from the exhaust system\nDiminished fuel efficiency\nEngine drivability codes may also accompany a P0090"],"causes":["Potential causes for this code to set are:","Shorted or open wiring and/or connectors in the fuel pressure regulator control circuit\nDefective fuel pressure regulator\nFaulty fuel rail pressure sensor\nBad PCM or a PCM programming error"],"type":"WARN"}