{"code":"P00AA","description":"Intake Air Temperature Sensor 1 Circuit Malfunction Bank 2","info":["This diagnostic trouble code (DTC) is a generic powertrain code, which means that it applies to OBD-II equipped vehicles. Although generic, the specific repair steps may vary depending on make/model.","The IAT (Intake Air Temperature) sensor is a thermistor, which basically means it measures air temperature by detecting resistance in the air. It's usually located somewhere in the intake air ductwork, but can be located in the intake manifold on some applications. It is usually a two wire sensor supplied with a 5 volt reference wire (which also acts as a signal wire) from the PCM (Powertrain Control Module) and a ground wire.","\n ","As air passes over the sensor the resistance changes. This change in resistance affects the 5 Volts supplied to the sensor accordingly. Colder air causes higher resistance and higher signal voltage & warmer air lower resistance and lower signal voltage. The powertrain control module (PCM) monitors this change in the 5 Volts and calculates air temperature to help operate the engine at the most efficient point possible at any given temperature.","If the PCM detects a voltage that is out of normal operating range for the IAT sensor on bank 2, a P00AA will set. Bank 2 is the side of the engine that does not contain cylinder #1.","Related Bank 2 IAT sensor circuit trouble codes:","P00AB Intake Air Temperature Sensor 1 Circuit Range/Performance Bank 2\nP00AC Intake Air Temperature Sensor 1 Circuit Low Bank 2\nP00AD Intake Air Temperature Sensor 1 Circuit High Bank 2\nP00AE Intake Air Temperature Sensor 1 Circuit Intermittent/Erratic Bank 2"],"symptoms":["There may be no noticeable symptoms other than MIL (Malfunction Indicator Lamp) illumination. However, it could be possible that you may experience poor drivability complaints."],"causes":["Potential causes of the P00AA DTC include:","IAT sensor shifted out of airflow\nBad IAT sensor bank 2\nShorted to ground or open on signal circuit to IAT\nOpen in ground circuit to IAT\nPoor connection at IAT (backed out terminals, broken connector locks, etc.)\nBad PCM"],"type":"ERR"}