{"code":"P00A7","description":"Intake Air Temperature Sensor 2 Circuit Low Input Bank 2","info":["This diagnostic trouble code (DTC) is a generic powertrain code, which means that it applies to OBD-II equipped vehicles. Although generic, the specific repair steps may vary depending on make/model.","The IAT (intake air temperature) sensor simply measures the temperature of air that is entering the engine. Intake air temperature is important because the higher the intake air, the higher the combustion temperatures. High combustion temperatures result in increased Nox (Nitrogen oxides) emissions.","\n ","To keep these higher temps from causing increased combustion temps, the intake air tubing should be intact, allowing the engine to \"breathe\" air that isn't sampled from the engine compartment. The IAT sensor measures air temp by using a thermistor, or a thermometer of sorts. The thermistor is supplied 5 volts reference voltage from the PCM (powertrain control module) and a ground. Usually, when the air temperature is cold the resistance in the thermistor is high and when the air temperature is warmer, the resistance decreases.","This change in resistance changes the 5 V reference from the PCM, thereby informing the PCM of the temperature of incoming air. If the PCM notices that the incoming bank 2 air temp sensor #2 is unusually high, say, 300 degrees, when the engine temp is still relatively low, it will set a P00A7. Bank 2 is the side of the engine that does not contain cylinder #1.","Related Bank 2 IAT sensor 2 trouble codes include:","P00A5 Intake Air Temperature Sensor 2 Circuit Bank 2\nP00A6 Intake Air Temperature Sensor 2 Circuit Range/Performance Bank 2\nP00A8 Intake Air Temperature Sensor 2 Circuit High Bank 2\nP00A9 Intake Air Temperature Sensor 2 Circuit Intermittent/Erratic Bank 2"],"symptoms":["There may be no noticeable symptoms of a P00A7 code other than an MIL (Malfunction Indicator Lamp). However, a emissions test may reveal higher Nox readings depending on the type of IAT failure. Or the engine may ping under load, depending on the type of IAT failure."],"causes":["Usually the P00A7 is caused by a bad #2 IAT (internally shorted or open or otherwise damaged), but it could also be:","No reference voltage to the bank 2 #2 IAT sensor due to an open wire\nExcessively high intake air temperatures\nShort to ground on signal circuit\nDamaged IAT connector\nBad PCM"],"type":"WARN"}