{"code":"P00BB","description":"Fuel Injector Insufficient Flow - Forced Limited Power","info":["This generic powertrain diagnostic trouble code (DTC) typically applies to all OBD-II vehicles. That may include but is not limited to vehicles from Hyundai, Ford, Mazda, Dodge, etc.","Low fuel pressure systems are generally used in diesel systems. The fact that the injection pump does the heavy labour as far as providing diesel engines with the high fuel pressures they need in order to atomize the fuel adequately.","\n ","That said, the injection pump still needs to be provided with the fuel in the first place. This is where low fuel pressure pumps/systems come into play. It is extremely important for the ECM (Engine Control Module) to monitor these conditions closely. Reason being, any introduced air caused by a starved injection pump/injector under load can and will cause major issues. Forced limited power is usually a sort of mode that the vehicle enters when it needs to control certain values to prevent the operator from further damaging the engine. Fuel, also has to go through numerous filters, pumps, injectors, lines, connections etc. to finally be delivered to the engine, so as you can imagine, there are a lot of possibilities here. Even small fuel leaks usually provide you with a smell strong enough to notice so keep that in mind.","All while monitoring numerous other systems and sensors, the ECM has detected a low fuel pressure condition and/or insufficient flow. Be aware of local fuel conditions. Repetitive fill- ups with dirty fuel can contaminate not only the fuel tank but also the fuel pump and everything else involved to be honest.","P00BB Fuel Injector Insufficient Flow - Forced Limited Power code is set when the ECM detects that a fuel injector is not receiving adequate flow to perform optimally. In turn, at times, vehicle enters fail-safe"],"symptoms":["Low power\nLimited output\nAbnormal throttle response\nDecrease fuel economy\nIncreased emissions\nSluggish\nEngine noise\nHard start\nEngine smoking on start-up"],"causes":["Dirty fuel\nPlugged fuel filter\nRestricted fuel line (e.g. kinked, clogged, etc.)\nFuel pump pickup dirty\nUnstable fuel\nFuel injector defective\nWeak low pressure fuel pump\nSludgy fuel (e.g. old, thick, contaminated)"],"type":"ERR"}