{"code":"P00B6","description":"Radiator Coolant Temperature/Engine Coolant Temperature Correlation","info":["This generic powertrain diagnostic trouble code (DTC) typically applies to many OBD-II vehicles. That may include many automakers but anecdotally this DTC seems more common on Chevrolet/Chevy and Vauxhall vehicles.","\n ","Anytime that I have been faced with diagnosing a code P00B6, it has meant that the powertrain control module (PCM) had detected a discrepancy in the correlating signals between the radiator coolant temperature sensor and the engine coolant temperature (ECT) sensor.","In order to make sure that coolant is flowing as intended between the radiator and the engine cooling passages,  coolant temperature in the radiator is sometimes monitored in comparison with the temperature of coolant in the engine.","ECT sensor design usually consists of a thermal resistor that is dipped in a hard resin and sealed in a metal or plastic housing. Brass is the most popular of these housing materials because of its durability. In most cases, the ECT sensor is threaded so that it may be screwed into a coolant passage in the engine intake manifold, cylinder head, or block. The level of thermal resistance in the ECT sensor decreases as coolant warms and flows across it. This leads to increased ECT sensor circuit voltage at the PCM. As the engine cools, sensor resistance increases and ECT sensor circuit voltage (to the PCM) is reduced as a result. The PCM recognizes these fluctuations in voltage as changes in engine coolant temperature. Fuel delivery and ignition timing strategy are among the functions affected by actual engine coolant temperature and input data from the ECT sensor.","The radiator coolant temperature sensor monitors coolant temperature in much the same manner as the ECT sensor. It is typically inserted into one of the radiator tanks but may also be fitted into a pressurized coolant reservoir.","If the PCM detects voltage signals from the ECT sensor and the radiator coolant temperature sensor which differ from one another by greater than the maximum allowable parameter, a code P00B6 will be stored and a malfunction indicator lamp (MIL) may be illuminated. Multiple drive cycles with a failure may be required for MIL illumination.","An example of a radiator coolant temperature sensor:\n"],"symptoms":["Excessively rich exhaust\nDrivability issues\nPoor idle quality\nSeriously diminished fuel efficiency"],"causes":["Defective ECT sensor\nFaulty radiator coolant temperature sensor\nInsufficient coolant level\nShorted or open circuits or connectors\nBad PCM or PCM programming error"],"type":"ERR"}