{"code":"P2200","description":"NOx Sensor Circuit Bank 1","info":["This is a generic powertrain diagnostic trouble code (DTC) and typically applies to OBD-II vehicles. That may include but is not limited to vehicles from Ford, Mercedes Benz, BMW, VW, Audi, Chevrolet, GMC, Dodge, Ram, Sprinter, etc. Although generic, the exact repair steps may vary depending on year, make, model and powertrain configuration.","Generally speaking, diesel-fuelled engines produce a higher amount of particulate matter (PM) and Nitrogen Oxide (NOx) emissions then a petrol / gasoline engine.","\n ","As vehicles have been evolving, so have the emission vehicle standards of most state/provincial laws. This day in age, engineers are developing ways in order to lower the atmospheric emissions in most vehicles to comply and/or exceed the laws emission related requirements.","The ECM (Engine control module) monitors an uncountable amount of sensors at any given time to keep your engine efficient, reliable and functional. Not only is it doing all this but it is actively monitoring the emissions and making sure to expel as little of these hydrocarbons to the atmosphere as possible. The ECM uses the NOx sensor to monitor nitrogen oxide levels within the exhaust to get an idea of the hydrocarbons being expelled. NOx is one of the primary PM's that diesel-fuelled engines produce. The ECM actively monitors this sensor and adjusts the system accordingly.","A diesel engine's exhaust is one of the dirtiest areas on the vehicle so keep this in mind. The soot produced in the exhaust of a diesel vehicle can, for lack of a better word, \"cake\" sensors and switches within the exhaust, depending on their location. This wouldn't much matter if the soot didn't possess this distinctive characteristic. If the sensor is not free of debris, it may not be able to properly measure the values that the ECM (Engine Control Module) actively needs to adjust your EVAP (Evaporative emissions) system according to specific federal/state/provincial laws. Sometimes if going from state to state, where emission regulations differ, aftermarket sensors are sometimes used to comply with the local emission standards.","The ECM activates P2200 and related codes (P2201, P2202, P2203, and P2204) when it monitors a fault within the NOx sensors or their circuits. My experience with this code is limited but my educated guess is that most times, this will turn out to be a mechanical issue. Especially considering the sensor's conditions mentioned earlier.","The P2200 code is set when the ECM detects a fault within the bank #1 NOx sensor or circuit.","Note: On engines with more than one bank of cylinders (e.g. V6, V8), bank 1 is the side of the engine that contains the #1 cylinder. Therefore, the NOx sensor is located in the exhaust of that bank. Refer to your service manual for specifics for your make/model/powertrain. This is the main resource where you can decipher which, out of a possible multitude of sensors, you are dealing with. They use similar distinctions with O2 (a.k.a. oxygen) sensors.","An example of NOx sensor (in this case, for GM vehicles):\n"],"symptoms":["Increased hydrocarbon emissions\nCheck engine light illuminated\nFuel economy not consistent\nErratic Idle\nExcessive smoke"],"causes":["Defective or damaged NOx sensor\nDirty sensor pickup\nDamaged wiring\nInternal ECM issue\nConnector problem"]}