{"code":"P2207","description":"NOx Sensor Heater Control Circuit High Bank 1","info":["This is a generic powertrain diagnostic trouble code (DTC) and typically applies to OBD-II vehicles. Vehicle makes may include but aren't limited to BMW, Dodge, Ram, Audi, Cummins, etc.","\n ","NOx (Nitrogen Oxide) sensors are primarily used for the emission systems in diesel engines. Their primary use is to detect NOx levels coming out of the exhaust after burning in the combustion chamber. The system then recycles these using different methods. Given the harsh environment of these sensors, they are composed of a combination of ceramic and a certain type of zirconia.","One of the downfalls of emitting NOx into the atmosphere is that it may cause smog and/or acid rain at times. Failure to sufficiently monitor and adjust NOx levels would result in a significant effect to the atmosphere around us and the air we breathe. The ECM (Engine control module) continuously monitors the NOx sensors to ensure acceptable emissions levels in your vehicle's exhaust. The NOx sensor heater control circuit is responsible for heating the sensor preemptively. It does this to expedite the sensor warm-up time, in turn bringing to operating temperature efficiently without solely relying on exhaust temperatures to warm itself up.","When it comes to P2207 and related codes, the NOx sensor heater control circuit malfunctioned somehow and the ECM has detected this. For reference sake, Bank 1 is on the side in which the number 1 cylinder is located. Bank 2 is on the other side. If your vehicle is a straight 6 or 4 cylinder, where there is only one head, it may be a two sided downpipe/ manifold. Always refer to your service manual for location designations as this will be integral in the diagnosing process.","P2207 is a generic trouble code that refers to \"NOx Sensor Heater Control Circuit High Bank 1.\" It appears when the ECM detects a higher than expected voltage condition in the NOx sensor heater control circuit on bank 1 .","Diesel engines especially produce a significant amount of heat so make sure to always let the system cool before working on any exhaust system components.","An example of NOx sensor (in this case, for GM vehicles):\n"],"symptoms":["Failed emissions test\nIntermittent CEL (check engine light)"],"causes":["NOx sensor defective\nHeater in NOx sensor malfunctioning\nInternal open in ECM (Engine control module) or NOx sensor itself\nWater intrusion\nBroken connector tabs (intermittent connection)\nMelted harness\nDirty sensor element\nHigh resistance present in heater control circuit"]}