{"code":"P2225","description":"NOx Sensor Heater Sense Circuit Intermittent Bank 2","info":["This is a generic powertrain diagnostic trouble code (DTC) and typically applies to OBD-II vehicles. Vehicle makes may include but aren't limited to Mercedes-Benz, Sprinter, VW, Audi, Ford, Dodge, Ram, Jeep, etc.","\n ","NOx (Oxides of Nitrogen) sensors are primarily used for the emission systems in diesel engines. Their primary use is to detect NOx levels coming out of the exhaust after burning in the combustion chamber. The system then recycles these using different methods. Given the harsh environment of these sensors, they are composed of a combination of ceramic and a certain type of zirconia.","One of the downfalls of emitting NOx into the atmosphere is that it may cause smog and/or acid rain at times. Failure to sufficiently monitor and adjust NOx levels would result in a significant effect to the atmosphere around us and the air we breathe. The ECM (Engine control module) continuously monitors the NOx sensors to ensure acceptable emissions levels in your vehicle's exhaust.","The engine control module (ECM) is able to calculate the Nitric Oxide and Nitrogen Dioxide gases (NOx) by using the data gained from the upstream and downstream oxygen sensors of the vehicle combined with the NOx sensor readings. The ECM does this to regulate the NOx levels coming out of your tailpipe for environmental emission reasons. The Bank 2 referred in the trouble codes is the engine bank that does not contain the #1 cylinder.","P2225 is the code described as \"NOx Sensor Heater Sense Circuit Intermittent Bank 2\" which means that the ECM has found inconsistencies in the overall performance of the NOx sensor heater sense circuit.","Diesel engines especially produce a significant amount of heat so make sure to always let the system cool before working on any exhaust system components.","An example of NOx sensor (in this case, for GM vehicles):\n"],"symptoms":["Intermittent stalling\nThe engine fails to start when warm\nDecreased performance of the engine\nWhen accelerating, there may be a hissing and/or hesitation\nThe engine might run lean or rich on bank #2 exclusively"],"causes":["Catalytic converter is malfunctioning\nIncorrect fuel mixture\nThe coolant temperature sensor is faulty\nThe manifold air pressure sensor is broken\nThere are problems with the mass air inflow sensor\nThe fuel injection part is defective\nThe fuel pressure regulator is broken\nThere were ignition misfires\nThere are leaks from the exhaust manifold, flex hose, down pipe, or some other exhaust component\nBroken oxygen sensors"]}