{"code":"P2254","description":"O2 Sensor Negative Current Control Circuit/Open Bank 2 Sensor 1","info":["This is a generic diagnostic trouble code (DTC) and applies to many OBD-II vehicles (1996-newer). That may include but is not limited to vehicles from Mazda, VW, Acura, Kia, Toyota, BMW, Peugeot, Lexus, Audi, etc. Although generic, the exact repair steps may vary depending on year, make, model and powertrain.","\n ","A stored code P2254 means that the powertrain control module (PCM) has detected a negative current discrepancy in the upstream oxygen (O2) sensor for engine bank number two. Bank two is the engine bank that doesn't contain the number one cylinder. Sensor 1 denotes the upstream (pre-cat) sensor. The negative current control circuit is a ground circuit.","In order to monitor the exhaust oxygen content for each engine bank, as well as catalytic converter efficiency, the PCM uses data input from heated oxygen sensors (HO2S).","Oxygen sensors are constructed using a zirconium dioxide sensing element situated in the center of a vented steel housing. Small platinum electrodes are soldered between the sensing element and wire leads in the oxygen sensor harness connector. The O2 sensor harness connector plugs into the controller area network (CAN) which attaches the HO2S wiring harness to the PCM connector.","Each HO2S is threaded (or studded) into an exhaust pipe or manifold. It is positioned so that the the sensing element is near the center of the pipe. Spent exhaust gases exit the combustion chamber (via the exhaust manifold) and continue through the exhaust system (including catalytic converters); flowing over the oxygen sensors. Exhaust gases flow into the oxygen sensor through specially designed vent holes in the steel housing and swirl around the sensing element. Drawn through wire lead cavities in the sensor housing, the air fills a tiny chamber in the middle of the sensor. The heated air (in the tiny chamber) forces the oxygen ions to produce energy that is recognized by the PCM as voltage.","Variations between the number of O2 ions in ambient air, and the number of oxygen molecules in the exhaust, cause the heated oxygen ions inside the HO2S to bounce from one platinum layer to the other, very swiftly and repetitively. As the surging oxygen ions shift between platinum layers, variations in HO2S output voltage occur. The PCM sees these variations in HO2S output voltage as changes in exhaust oxygen concentration.","Voltage signal outputs from the HO2S are lower when more oxygen is present in the exhaust (lean condition) and higher when less oxygen is present in the exhaust (rich condition). This portion of the HO2S uses low voltage (less than one-volt).","In a separate section of the sensor, the HO2S is preheated using battery voltage (12-volts). When engine temperature is low, battery voltage heats up the HO2S so that it can begin to monitor exhaust oxygen content faster.","If the PCM detects a degree of voltage that is not commiserate with acceptable parameters, a P2254 will be stored and a malfunction indicator lamp (MIL) may be illuminated. Most vehicles will require multiple ignition cycles (with a failure) for MIL illumination.","A typical O2 Oxygen Sensor:\n"],"symptoms":["Reduction in fuel efficiency\nDiminished engine performance\nStored misfire codes or lean/rich exhaust codes\nService engine soon lamp illumination"],"causes":["Defective oxygen sensor/s\nBurnt, chafed, broken, or disconnected wiring and/or connectors\nFaulty PCM or PCM programming error"]}