{"code":"P2279","description":"Intake Air System Leak","info":["This is a generic diagnostic powertrain trouble code, which means it covers all makes/models, 1996-newer. However, specific troubleshooting steps will vary depending on the vehicle.","Trouble code P2279 indicates that an air leak has occurred on the \"metered\" side of the intake manifold. There is more air entering the intake manifold than the mass airflow or MAP (manifold absolute pressure) sensor would suggest.","The engine uses a mass airflow sensor or MAP sensor (on some of the older models) to determine the amount of air entering the intake manifold. The mass airflow sensor uses a \"hot wire\" for this purpose. The MAP sensor signals the pressure within the manifold.","The engine control module (ECM) heats the wire to a predetermined temperature. It maintains this temperature by varying the voltage to the hot wire according to the amount of air passing the wire. This varying voltage acts as a signal indicating the volume of air passing the wire.","An intake air temperature sensor allows the ECM to adjust for temperature changes. The ECM then adjusts the injector timing to maintain the fuel/air ratio. The oxygen sensor is a tool used to confirm and maintain the fuel/air ratio.","When the mass airflow, the intake air temperature and oxygen sensor show a disparity a leak is recognized and the code P2279 is set.","Air leaks at the air filter or hoses leading up to the mass airflow sensor (MAF) or throttle body are of no concern. The leak is present between the mass airflow sensor or throttle body and the manifold."],"symptoms":["Malfunction Indicator Lamp (MIL) illumination with P2279 diagnostic trouble code set\nStalling at a stop\nIdle \"hunts\" or surges\nLack of power\nDead spots on acceleration\nECM sets additional codes such as engine miss in number 1 cylinder\nEngine \"pings\" due to the lean mixture\nCherry red exhaust manifolds from overly lean mixture\nHissing sound produced by the air leak\nIncreased resistance in the power brakes (harder pedal)"],"causes":["Potential causes for this engine code may include:","Leak between engine side of mass airflow sensor and air duct\nAir duct leak engine side\nLeak at intake air temperature sensor\nLeak at throttle body\nIntake manifold crack or leak\nDisconnected or broken vacuum hose\nBad fuel injector seal at manifold\nLeaky brake booster vacuum hose\nLeak under dash at a vacuum operated device\nStuck PCV valve\nStuck crankcase oil filler cap\nAnything and everything connected to the intake manifold could potentially cause this scenario."]}