{"code":"P2286","description":"Injector Control Pressure Sensor Circuit High","info":["This is a generic powertrain diagnostic trouble code (DTC) and applies to many OBD-II vehicles (1996-newer). That may include but is not limited to vehicles from Toyota, Ford, Dodge, Chrysler, Jeep, Chevrolet, GMC, etc. Although generic, the exact repair steps may vary depending on year, make, model and powertrain configuration.","\n ","OBD-II trouble code P2286 and related ICP codes P2283, P2284, P2285, and P2287 are associated with the injector control pressure (ICP) sensor circuit. This circuit is normally monitored by the Power Control Module (PCM) on most vehicles.","The purpose of the injector control pressure sensor circuit is to provide a feedback signal to indicate fuel rail pressure so that the PCM can correct injector timing and the injection control pressure for proper fuel delivery at all speeds and varying load conditions. This process incorporates several components to accomplish, based on the vehicle and the fuel supply system configuration. Many modern diesel engines utilize an injector driver module (in conjunction with the PCM) to facilitate fuel and oil delivery to the injectors for each individual cylinder of the engine.","When the PCM detects voltage or resistance that is higher than the expected range within the injector control pressure ICP sensor circuit, code P2286 will be set and the check engine light will be illuminated. Anecdotally this ICP sensor code seems to be more commonly found on Ford F-250, F-350, 6.0L Powerstroke equipped trucks. The sensor may be located behind and down below the turbo facing the drivers side.","An injector control pressure ICP sensor:\n"],"symptoms":["Engine may not start\nLow fuel Pressure\nLow oil pressure\nCheck engine light illuminated"],"causes":["Defective injector control pressure sensor\nOil pump malfunction\nDefective fuel pump\nLow oil or fuel level\nFaulty or damaged wiring\nLoose or defective control module ground strap\nCorroded, damaged or loose connector\nDefective fuse or fuse-able link (if applicable)\nDefective PCM"]}