{"code":"P2296","description":"Fuel Pressure Regulator 2 Control Circuit High","info":["This diagnostic trouble code (DTC) is a generic powertrain code, which means that it applies to OBD-II equipped vehicles (Isuzu, Mazda, Dodge, Chrysler, Ford, GMC, Chevy, Toyota, Honda, etc.). Although generic, the specific repair steps may vary depending on make/model.","In my experience with diagnosing a code P2296, it has meant that the powertrain control module (PCM) has detected a high voltage signal from the control circuit of the electronic fuel pressure regulator designated with a 2. Systems which have multiple electronic fuel pressure regulators use a numerical designation. It may refer to a certain engine bank but not always.","\n ","The PCM typically controls the electronic fuel pressure regulator. Battery voltage and ground signals are used to control a servo motor (in the fuel pressure regulator) which positions a valve so that the desired level of fuel pressure may be achieved for any given situation. In order to adjust fuel pressure regulator voltage, when necessary, the PCM monitors the fuel pressure sensor which is located in the fuel injector rail. When voltage is increased at the electronic fuel pressure regulator servo motor, a valve is opened and fuel pressure is increased. Decreased voltage at the servo causes the valve to close and fuel pressure decreases.","The fuel pressure regulator and fuel pressure sensor are most frequently integrated into a single housing (with one electrical connector) but may be separate components.","If actual fuel pressure regulator control circuit voltage is less than an expected degree, as computed by the PCM, a P2296 will be stored and a malfunction indicator lamp (MIL) may be illuminated.","Related fuel pressure regulator engine codes:","P2293 Fuel Pressure Regulator 2 Performance\nP2294 Fuel Pressure Regulator 2 Control Circuit\nP2295 Fuel Pressure Regulator 2 Control Circuit Low"],"symptoms":["Engine misfire codes and idle control codes may also accompany a P2296\nDiminished fuel efficiency\nDelayed startup when the engine is cool\nBlack smoke from the exhaust system"],"causes":["Potential causes for this code to set are:","Faulty fuel pressure sensor\nDefective fuel pressure regulator\nShorted or open wiring and/or connectors in the fuel pressure regulator control circuit\nBad PCM or a PCM programming error"]}