{"code":"P2295","description":"Fuel Pressure Regulator 2 Control Circuit Low","info":["This diagnostic trouble code (DTC) is a generic powertrain code, which means that it applies to OBD-II equipped vehicles (Isuzu, Mazda, Dodge, Chrysler, Ford, GMC, Chevy, Toyota, Honda, etc.). Although generic, the specific repair steps may vary depending on make/model.","When a code P2295 is stored, it means that the powertrain control module (PCM) has detected a low voltage signal from the control circuit of the electronic fuel pressure regulator designated 2. The numeral designation 1 is used in systems which have multiple electronic fuel pressure regulators. It may refer to a particular engine bank but not always.","\n ","Typically, the electronic fuel pressure regulator is controlled by the PCM. Battery voltage and ground signals are used to control a servo motor which positions the regulator valve so that the desired level of fuel pressure is achieved for any given situation. The fuel pressure sensor is located in the fuel injector rail and allows the PCM to monitor fuel pressure so that it can adjust fuel pressure regulator voltage as necessary. As voltage is increased at the electronic fuel pressure regulator servo motor, the valve is opened and fuel pressure is increased. Decreased voltage at the servo causes it to retract and fuel pressure decreases.","Most often, the fuel pressure regulator and fuel pressure sensor are integrated into a single housing (with one electrical connector) but may be separate components.","If actual fuel pressure regulator control circuit voltage is less than a desired level, as calculated by the PCM, a P2295 will be stored and a malfunction indicator lamp (MIL) may be illuminated.","Related fuel pressure regulator engine codes:","P2293 Fuel Pressure Regulator 2 Performance\nP2294 Fuel Pressure Regulator 2 Control Circuit\nP2296 Fuel Pressure Regulator 2 Control Circuit High"],"symptoms":["Delayed startup when the engine is cool\nBlack smoke from the exhaust system\nDiminished fuel efficiency\nEngine misfire codes and idle control codes may also accompany a P2295"],"causes":["Potential causes for this code to set are:","Shorted or open wiring and/or connectors in the fuel pressure regulator control circuit\nDefective fuel pressure regulator\nFaulty fuel rail pressure sensor\nBad PCM or a PCM programming error"]}