{"code":"P020C","description":"Cylinder 3 Injection Timing","info":["This diagnostic trouble code (DTC) is a generic powertrain code, which means it applies to most OBD-II equipped vehicles including but not limited to VW Volkswagen, Dodge, Ram, Kia, Chevrolet, GMC, Jaguar, Ford, Jeep, Chrysler, Nissan, etc. Although generic, the exact repair steps may vary depending on make/model.","A stored code P020C means that the powertrain control module (PCM) has detected a malfunction in the injection timing circuit for a particular cylinder of the engine. In this case, the cylinder in question is cylinder three. Consult a reliable vehicle information source for the exact location of cylinder number three for the vehicle in which the P020C has been stored.","\n ","It has been my experience that a code P020C is stored exclusively in vehicles equipped with diesel engines. Today’s clean burning (direct injection) diesel engines require extreme levels of fuel pressure.","Because of this high degree of fuel pressure, only qualified personnel should attempt to diagnose or repair the high-pressure fuel system.","When unit injectors are utilized, the high pressure injection pump is driven by the engine timing chain and timed according to the position of the crankshaft and camshaft/s. Every time the engine crankshaft and camshaft/s reach a certain point, the high pressure injection pump is pulsed; resulting in an extreme degree (up to 35,000 psi) of fuel pressure.","Common rail direct injection systems are timed using a common high-pressure fuel rail and individual solenoids for each cylinder. In this type of application the PCM or a stand-alone diesel injection controller is used to control injector timing.","Variations in camshaft and/or crankshaft timing alert the PCM of inconsistencies in specific cylinder injection timing and prompt a stored code P020C. Some vehicles may require multiple ignition cycles with a failure for this type of code to be stored and a malfunction indicator lamp to be illuminated.","Related injection timing codes include from cylinders 1 through 12: P020A, P020B, P020C, P020D, P020E, P020F, P021A, P021B, P021C, P021D, P021E, and P021F"],"symptoms":["Engine misfire, sag, or stumble\nGeneral lack of engine performance\nDistinctive odor of diesel fuel\nReduced fuel efficiency"],"causes":["Possible causes for this P020C code include:","Defective fuel injection solenoid\nOpen or shorted wiring and/or connectors in fuel injector control circuit\nBad fuel injector\nEngine timing component failure\nCrankshaft or camshaft position sensor (or circuit) failure"],"type":"ERR"}