{"code":"P0214","description":"Cold Start Injector 2 Malfunction","info":["This generic powertrain diagnostic trouble code (DTC) typically applies to OBD-II equipped vehicles that have a cold start injector. Makes of vehicles may include but are not limited to Mercedes-Benz, BMW, Toyota, VW, Renault, Chevy, Volvo, Jaguar, etc.","When a P0214 is stored in your OBD-II vehicle, it means that the powertrain control module (PCM) has detected an abnormality in the secondary (2) cold start injector.","\n ","These types of injectors are primarily used in vehicles with diesel engines but I have personally seen cases where they were used in gasoline engine applications as well.","Typically, the cold start injector/s are placed in a centrally located position so that all cylinders of the engine can benefit from a \"shot\" of fuel delivered during cold start conditions. Some vehicles utilize multiple (I have never seen more than two) cold start injectors placed in strategic locations in the engine intake. Others use a single injector which is usually placed near the throttle plate opening or intake air inlet pipe.","By monitoring engine temperature and intake air temperature, the PCM is able to determine when the cold start injector must be initiated. In most vehicles, the cold start injector circuit is evaluated by the PCM in order to ensure that it is operating as intended. If the PCM detects an abnormal level of resistance on the circuit (accompanied by decreased voltage as a result), a code P0214 will be stored and a malfunction indicator lamp (MIL) may be illuminated. Some vehicles may require multiple ignition cycles with a failure for a MIL to be illuminated.","An example of a cold start injector:\n"],"symptoms":["Delayed engine start- up (especially when cold)\nNo symptoms may be exhibited during warm weather\nEngine coolant temperature or intake air temperature codes may also be exhibited\nLean exhaust codes\nMisfire codes may also be stored"],"causes":["Possible causes for this code may include:","Defective cold start injector\nFaulty engine coolant temperature sensor or circuit\nBad intake air temperature sensor or circuit\nShorted or open wiring in the cold start injector circuit"],"type":"ERR"}