{"code":"P022E","description":"Charge Air Cooler Bypass Control B Circuit Low","info":["This generic powertrain diagnostic trouble code (DTC) typically applies to all OBD-II vehicles equipped with a charge air cooler. That may include but is not limited to vehicles from Ford, Chevy, Mazda, Toyota, etc.","In forced inducted systems, they use a Charge Air Cooler or what I am going to call it, an Intercooler (IC) to help in cooling the charge air the engine uses. These work similar to a radiator.","\n ","In the IC's case, instead of cooling antifreeze, it cools air to make for a more efficient air/fuel mixture in turn, better fuel mileage, better performance etc.. The IC is part of the charge pressure side of the induction system. The bypass valve is used just as the name implies, to let the air bypass the intercooler to be dumped into the atmosphere and/or recycled. The Engine Control Module (ECM) uses it to adjust valve according to current engine conditions and needs.","The ECM illuminates the check engine light with P022E and associated codes when it monitors a condition outside of a specific range within the intercooler's bypass control circuit and/or system. This code may be cause by a mechanical and/or electrical fault. If I had to guess here, I would lean towards a mechanical problems more likely being the problem. That being said either are possible.","P022E Charge Air Cooler Bypass Control B Circuit Low code is set when the ECM detects a lower than desired electrical value within the \"B\" circuit. Refer to a manufacturer specific repair manual to determine which is the \"B\" circuit in your particular application."],"symptoms":["Poor engine performance\nVehicle entering \"limp mode\"\nEngine misfiring\nPoor fuel mileage"],"causes":["Stuck open/closed bypass valve\nObstruction in bypass valve's operational range of motion\nBroken or damaged wiring harness\nFuse/relay defective\nECM issue\nPin/connector problem. (e.g. corrosion, broken lock tab, etc.)"],"type":"WARN"}