{"code":"P0235","description":"Turbocharger Boost Sensor A Circuit Malfunction","info":["This diagnostic trouble code (DTC) is a generic powertrain code. It is considered generic because it applies to all makes and models of vehicles (1996-newer), although specific repair steps may be slightly different depending on the model (Nissan, Honda, Renault, etc.).","\n ","Code P0235 is a generic code inasmuch as it refers to a problem in the turbocharger boost sensor A circuit. Although generic in nature, never assume it is identical for all vehicles.","OBD codes do not necessarily point to a specific item, but rather to an area for the technician to search for possible causes for a problem within this circuit, which could include multiple possibilities.","All vehicles with code P0235 have a singular point in common. It refers to an unacceptable variance between the ECM (electronic control module) programmed percentage of turbo boost at a specific RPM and the sensor's signal value. These two values must coincide within close limits.","How Turbocharging (forced induction) Increases Performance","Turbochargers force a great deal more air into the engine than the engine is capable of under normally aspirated conditions. The higher the volume of air forced into the cylinders in addition to the increased fuel equals greater power.","Typically a turbocharger can increase horsepower by 35 to 50 percent in an engine designed specifically for turbocharging. A conventional engine's components will not withstand the stress placed on it by forced induction.","Turbochargers offer high horsepower gains with little or no adverse effect on fuel economy. They use exhaust velocity to propel the turbocharger, so in essence, it is free horsepower. That is the upside. The downside is that they take a beating and tend to fail at unpredictable times for a host of reasons. When an indication that a problem with the turbocharger has occurred, address it as soon as possible. A turbocharged engine greatly exaggerates engine problems due to the compressed air mass.","Never tighten the wastegate or attempt to install any modification to a stock turbocharged engine in an effort to increase boost pressures. The fuel and timing curve on most engines will not adapt to higher than normal boost pressures and engine damage will occur.","Note: This DTC is basically identical to P0239 which refers to the \"B\" turbocharger."],"symptoms":["The code P0235 will be set which simply means that a problem exists somewhere within this circuit preventing proper boost control. Additional codes in progression may be set regarding this malfunction, each of which pertains to a section of the circuit.\nThe engine may lack acceleration.\nThe boost pressure gauge will indicate less than 9 pounds of boost or over 14 pounds of boost. Both are out of range.\nUnusual whining noises or rattling from the turbocharger or piping.\nEngine knock sensor code may appear indicating detonation is occurring due to high cylinder head temperatures.\nEngine may exhibit an overall lack of power.\nSmoke from the exhaust.\nFouled spark plugs\nEngine temperature unusually high at cruise speeds.\nHissing noises at the wastegate"],"causes":["Turbos typically spin at an incredible 100,000 to 150,000 RPM. They are not the least tolerant to out of balance conditions or lack of clean oil to the bearing. Potential causes for this DTC include:","Vacuum leak at the intake manifold\nDirty air cleaner\nDefective wastegate- either stuck open, closed or leaking\nInsufficient oil supply to main shaft bearing-obstruction in the oil feed or return line.\nBearing failure causing low spin-up due to drag.\nWobble in the bearing causing the turbine blades to strike the turbo housing.\nNicked, bent or missing turbine blades causing an out-of-balance situation.\nOil seal leak on the compressor side of the turbo as seen by oil in the turbo and fouled plugs.\nExcessive end play in the turbo shaft\nDefective intercooler\nLoose connections at intake pipe to throttle body\nCracks in the turbo housing\nLoose exhaust manifold to turbo bolts.\nPoor electrical connection at Turbo boost sensor.\nShort or open in the sensor harness between the sensor and ECM.\nDefective sensor or ECM 5 volt reference driver."],"type":"ERR"}