{"code":"P0238","description":"Generic: Turbocharger/Supercharger Boost Sensor \"A\" Circuit High Input\nGM: Turbocharger Boost Sensor Circuit High Voltage\nDodge Chrysler: MAP Sensor Voltage Too High","info":["This is a generic powertrain diagnostic trouble code (DTC) applicable to all vehicles equipped with a turbocharger. Vehicle makes may include but are not limited to VW, Dodge, Mercedes, Isuzu, Chrysler, Jeep, etc.","\n ","The powertrain control module (PCM) uses a boost control solenoid to control the amount of boost pressure generated by the turbocharger. The PCM monitors actual pressure with a turbocharger boost pressure sensor. For me to help you understand this code I will first need to explain how a boost pressure sensor works.","The turbo boost sensor is a variable resistor. The PCM supplies a 5 volt reference signal to the boost sensor. When boost pressure is low the resistance of the sensor is high so only a small percentage of the reference signal returns to the PCM. As pressure increases, resistance decreases so more of the reference signal returns to the PCM. The PCM uses this variable voltage to calculate actual boost pressure. Zero boost pressure equals about .5 volts, maximum boost reads about 4.5 volt.","DTC P0238 is set when the PCM sees a boost pressure voltage greater than 4 volts at a time when no boost is being commanded.\n"],"symptoms":["When P0238 is set the PCM will turn on the check engine light and substitute a generic value for actual boost pressure and ignore the sensor. When the PCM is substituting a generic value for the boost pressure it also limits the amount of boost and dynamic fuel timing to a minimal amount. This condition is sometimes referred to \"limp home\" mode and is most noticeable by a serious lack of acceleration.","Because of the increased risk of catalytic converter damage the condition causing this code should be corrected as soon as possible."],"causes":["Potential causes for this code to set are:","DTC’s related to intake air temperature sensor (IAT), engine coolant temperature sensor (ECT), or 5 volt reference\nIntermittent wiring problems\nFaulty boost sensor \"A\"\nShort circuit to voltage on sensor circuit\nFaulty PCM"],"type":"WARN"}