{"code":"P0230","description":"Fuel Pump Primary (Control) Circuit Malfunction","info":["This diagnostic trouble code (DTC) is a generic powertrain code, which means that it applies to OBD-II equipped vehicles. Although generic, the specific repair steps may vary depending on make/model.","The fuel pump is activated by a PCM-controlled relay. Just as the name implies, a \"relay\" permits the transmittal of higher amperage current to the fuel pump without that current having to travel through the PCM (Powertrain Control Module).","\n ","For obvious reasons it's better to not have higher amperage current anywhere near the PCM. Higher amperage current creates more heat but also in the event of a failure, can cause a PCM failure. This principal applies to any relay. The higher amperages are kept under the hood, away from sensitive areas","The relay contains basically two sides. The \"control\" side which is basically a coil and the \"switch\" side which is a set of electrical contacts. The control side (or coil side) is the low amp side. It's fed a switched ignition feed (12 volts with key on)and a ground. The ground circuit is activated by the PCM driver when appropriate. When the PCM fuel pump driver activates the relay coil, the coil acts as an electromagnet that pulls the electrical contacts closed which completes the fuel pump circuit. This closed switch allows voltage to flow on the fuel pump activation circuit, activating the pump. Whenever the key is turned on, the PCM grounds the fuel pump circuit for a few seconds, activating the fuel pump and pressurizing the system. The fuel pump won't be activated again until the PCM sees an RPM signal.","The driver in the PCM is monitored for faults. When activated the driver or ground circuit voltage should be low. When deactivated the driver/ground potential voltage should be high or near battery voltage. If the PCM sees a voltage other than what is expected, P0230 may be set."],"symptoms":["MIL (malfunction indicator lamp) illumination\nNo start condition\nNo fuel pump operation\nFuel pump runs all the time with ignition on"],"causes":["Potential causes of a P0230 code include:","Short to ground on control circuit\nFuel pump control circuit open\nShort to battery voltage on control circuit\nHarness chafing causing one of above conditions\nBad relay\nBad PCM"],"type":"ERR"}