{"code":"P023C","description":"Charge Air Cooler Coolant Pump Control Circuit High","info":["This generic powertrain diagnostic trouble code (DTC) typically applies to all OBD-II vehicles equipped with a charge air cooler. That may include but is not limited to vehicles from Ford, Chevy, Mazda, Toyota, etc.","In forced inducted systems, they use a Charge Air Cooler or what I am going to call it, an Intercooler (IC) to help in cooling the charge air the engine uses. These work similar to a radiator.","\n ","In the IC’s case, instead of cooling antifreeze, it cools air to make for a more efficient air/fuel mixture in turn, better fuel mileage, performance, etc. In some of these systems, the IC uses a combination of air and coolant to aid in cooling the charge air being forced into the cylinders via forced induction (supercharger or turbocharger).","In those cases, to accommodate additional coolant flow needs, a coolant pump is used. Generally speaking these are electronic fluid pumps that basically supply a coolant flow needed to the IC that the water pump cannot supply independently.","The MIL (Malfunction Indicator Lamp) illuminates the instrument cluster with P023C and associated codes when it monitors a condition outside of a specific range within the IC’s coolant pump control circuit. Off the top of my head i can think of two causes, one is an obstruction within the pump's openings causing an electrical value to go out of range. The other, is a chafed control wire that wore through the electrical connection causing an open circuit. Point being, both mechanical and electrical faults are equally possible.","Code P023C Charge Air Cooler Coolant Pump Control Circuit High is active when there is a high electrical value within the charge air cooler coolant pump and/or its circuit"],"symptoms":["MIL (Malfunction Indicator Lamp) illuminated\nPoor engine performance\nPoor fuel mileage\nErratic/abnormal engine temperatures"],"causes":["Internal mechanical obstruction in coolant pump\nBroken or damaged Coolant pump wiring harness\nECM (Engine Control Module) issue\nPin/connector problem. (e.g. corrosion, broken lock tab, etc.)"],"type":"WARN"}