{"code":"P0255","description":"Injection Pump Fuel Metering Control B Intermittent (Cam/Rotor/Injector)","info":["This generic powertrain/engine diagnostic trouble code can typically apply to all diesel fueled OBD-II equipped engines (e.g. Ford, Chevy, GMC, Ram, etc.), but shows up more often in certain Mercedes Benz and VW vehicles.","Although generic, the exact repair steps may vary depending on year, make, model and powertrain configuration.","\n ","The Injection Pump Metering Control Circuit \"B\" is usually found mounted inside / on the side of the injection pump bolted to the engine. The Injection Pump Metering Control Circuit \"B\" is usually made up of a Fuel Rack Position (FRP) Sensor and a Fuel Quantity Actuator.","The FRP sensor converts the amount of diesel fuel being delivered by the Fuel Quantity Actuator to the injectors into an electrical signal for the Powertrain Control Module (PCM).","The PCM receives this voltage signal to determine how much fuel it will put into the engine based upon engine operating conditions. This code is set if this input does not match normal engine operating conditions stored in the PCM’s memory, even for a second, as this diagnostic trouble code demonstrates. It also looks at the voltage signal from the FRP sensor to determine if it is correct at initial Key On.","The code P0255 Injection Pump Fuel Metering Control B Intermittent (Cam/Rotor/Injector) could have been set because of mechanical (typically EVAP system mechanical issues) or electrical (FRP sensor circuit) issues. These cannot be overlooked in the troubleshooting stage, especially when dealing with an intermittent problem. Refer to a vehicle specific repair manual to determine which is the \"B\" part of the circuit for your particular application.","Troubleshooting steps may vary depending upon manufacturer, type of FRP sensor and wire colors."],"symptoms":["Malfunction Indicator Lamp (MIL) illumination\nDecrease in fuel economy"],"causes":["Open in the signal circuit to the FRP sensor - possible\nShort to voltage in the signal circuit to the FRP sensor - possible\nShort to ground in the signal circuit to the FRP sensor - possible\nOpen in power or ground at FRP sensor - possible\nFailed FRP Sensor - likely\nFailed PCM - unlikely"],"type":"ERR"}