{"code":"P0273","description":"Cylinder #5 Injector Circuit Low","info":["This diagnostic trouble code (DTC) is a generic powertrain code, which means that it applies to OBD-II equipped vehicles. Although generic, the specific repair steps may vary depending on make/model.","The OBD trouble code P0273 is a generic powertrain code common to all vehicles. Although the code's reference is the same, the repair procedure may vary somewhat with the manufacturer.","\n ","This code implies that the powertrain control module (PCM) has experienced a low voltage situation involving the fuel injector for the #5 cylinder in the firing order.","In short, this fuel injector is malfunctioning for one of a variety of reasons. It is important to diagnose and repair this type of problem as soon as possible.","When a fuel injector malfunctions, it causes ripples down the line, meaning the engine's operating parameters change due to the mixed signals at the PCM.","If the fuel injector spray pattern is reduced, a lean mixture will result. The ripple begins. The oxygen sensor signals a lean mixture to the PCM. In response, it richens the fuel mixture to all cylinders. Fuel economy plummets.","The cylinder with the faulty injector causes a lean mixture that in turn causes a higher cylinder head temperature resulting in detonation. The knock sensor senses the detonation, signals the PCM which responds by retarding the timing. Now the engine is running rough and lacks power.","This is not the end of the ripple effect, but it reflects the general idea.","Cross-section diagram of a typical automotive fuel injector (provided by WikipedianProlific):"],"symptoms":["The symptoms displayed for a P0273 code may include:","The check engine light will illuminate and code P0273 will set\nThe engine will run rougher than normal\nA lack of power\nA big drop in fuel economy will result"],"causes":["Possible causes for this DTC include:","Dirty fuel injector supplying the number five cylinder\nFaulty fuel injector\nPlugged fuel injector\nOpen or short in the fuel injector harness\nLoose or corroded fuel injector connector"],"type":"WARN"}