{"code":"P0275","description":"Cylinder 5 Contribution/Balance","info":["This diagnostic trouble code (DTC) is a generic powertrain code, which means that it applies to OBD-II equipped vehicles. Although generic, the specific repair steps may vary depending on make/model.","The OBD II trouble code P0275 is described as a cylinder number 5 contribution/balance. In essence, this code is stating that the number five cylinder in the firing order is experiencing a fuel-related problem.","\n ","This is also a generic code, meaning it is common to all manufacturers. The reference is the same, however, the manufacturer of a specific model may have experienced a defective part or error in installation.","Always access the technical service bulletins (TSBs) online for your specific year and make vehicle. Look for related TSBs and the factory recommended repair procedure.","The powertrain control module (PCM) monitors the power output from each cylinder by comparing the acceleration or increase in speed of the crankshaft during the power stroke of each cylinder.","When one or more cylinders are contributing less power than the rest of the cylinders, the fault code P0275 is set.","While the PCM performs this test to determine if a fuel injector is working properly, an auto technician can perform a similar test to locate internal engine problems. By pulling one spark plug at a time while the engine is running, he notes the RPM drop on each cylinder.","All the cylinders must be within 5-percent of each other. Any cylinder showing a lesser drop in RPM is in need of repair. Both tests are similar in that they both compare crankshaft RPM.","This is a problem that must be addressed at your earliest convenience to prevent any possible damage from occurring.","Cross-section diagram of a typical automotive fuel injector (provided by WikipedianProlific):"],"symptoms":["The symptoms displayed for a P0275 code may include:","Check engine light on and code P0275 set\nReduced power and acceleration\nRough idle\nDrop in fuel economy"],"causes":["It's been my experience that this code refers to less power being produced in the number five cylinder. An electrical problem would set a code for either a high or low voltage situation for this injector.","A lack of fuel to the number five cylinder is the most likely cause. The injector may have failed altogether or it is dribbling a small amount of fuel rather than the normal conical spray. This would be due to dirt or contamination of the inlet filter on the injector.","Possible defective electrical connector on the fuel injector due to corrosion of the terminals or pushed out pins\nDirty or clogged fuel injector\nFuel injector failure"],"type":"ERR"}