{"code":"P02BD","description":"Cylinder 9 Injector Leaking","info":["This is a generic powertrain diagnostic trouble code (DTC) and typically applies to OBD-II vehicles. That may include but is not limited to vehicles from , etc. Although generic, the exact repair steps may vary depending on year, make, model and powertrain configuration.","If your OBD-II equipped vehicle has stored a code P02BD, it means that the powertrain control module (PCM) has detected a possible leaking fuel injector for a particular cylinder of the engine, in this case it's cylinder #9.","\n ","Automotive fuel injectors require a precise degree of fuel pressure to deliver an exact measure of fuel in a precisely sprayed pattern to the combustion chamber of each cylinder. The demands of this precise pattern require that each fuel injector be free of leaks and restrictions.","The PCM monitors factors such as the degree of fuel trim required and exhaust oxygen sensor data, combined with crankshaft position and camshaft position, to detect a lean condition and pinpoint which cylinder of the engine is experiencing a malfunction.","Data signals from the oxygen sensors alert the PCM to lean exhaust oxygen content and also which bank of the engine is affected. Once it is determined that there is a lean exhaust condition on a specific bank of the engine, the position of the camshaft and crankshaft help to determine which injector is having a problem. Once the PCM has established that there is a lean condition and located the affected fuel injector on cylinder #9, a code P02BD will be stored and a malfunction indicator lamp (MIL) may be illuminated.","Some vehicle applications may require multiple failure cycles in order for a MIL to be illuminated.","A cross section of a typical fuel injector:\n"],"symptoms":["Diminished engine performance\nReduced fuel efficiency\nLean exhaust codes\nMisfire codes may also be stored"],"causes":["Defective and/or leaking fuel injector\nOpen or shorted fuel injector circuit(s)\nFaulty oxygen sensor(s)\nPCM or programming error\nMass air flow (MAF) or Manifold Air Pressure (MAP) sensor failure"],"type":"ERR"}