{"code":"P02E2","description":"Diesel Intake Air Flow Control Circuit Low","info":["This generic powertrain/engine diagnostic trouble code (DTC) can typically apply to all diesel OBD-II equipped engines, but shows up more often in certain Chevy, Dodge, Ford and GMC trucks.","Although generic, the exact repair steps may vary depending on year, make, model and powertrain configuration.","\n ","The Diesel Intake Air Flow Control System (DIAFCS) is usually bolted to the intake manifold in the intake air stream. The DIAFCS system controls the amount of incoming airflow by varying a signal to a motor operated by the Powertrain Control Module (PCM). The motor opens and closes a throttle plate which regulates the airflow.","The PCM knows how much clean, filtered air is entering the engine based upon the Diesel Intake Airflow Position Sensor, also known as a MAF sensor. When the air flow control system is activated, the PCM should note a change in airflow. If not, then there may be something wrong with the DIAFCS system, or there may be something wrong with the MAF sensor. These codes are set if this input does not match normal engine operating conditions stored in the PCM’s memory, even for a second, as these diagnostic trouble codes demonstrate. It also looks at the voltage signal from the DIAFCS to determine if it is correct at initial Key On.","The code P02E2 Diesel Intake Air Flow Control Circuit Low is set when there is a detected low electrical condition in the diesel intake air flow control system. It is set when the voltage at the motor control stays below a set level (usually under 0.3V) for too long a period. This code is usually considered to be an electrical circuit issue.","Troubleshooting steps may vary depending upon manufacturer, type of DIAFCS motor/control and wire colors."],"symptoms":["Malfunction Indicator Light On\nPossible low idle speed only\nFlashing Electronic Throttle Control symbol\nNo Regeneration of the diesel particulate filter to burn off the soot build up (won’t burn off soot out of the DPF catalyst) – eventual loss of power complain"],"causes":["Short to ground in the signal circuit to the DIAFCS motor/control – possible\nFailed DIAFCS motor/control – possible\nFailed PCM - unlikely"],"type":"WARN"}