{"code":"P0705","description":"Transmission Range Sensor Circuit Malfunction (PRNDL input)","info":["This is a generic powertrain code, which means it covers all makes/models, 1996-newer. However, specific troubleshooting steps will vary depending on the vehicle.","\n ","The P0705 diagnostic trouble code (DTC) refers to a switch either external or internal on the transmission whose function is to signal the Powertrain Control Module (PCM) or the Transmission Control Module (TCM) as to the gear shift position -- P, R,N and D positions (park, reverse, neutral, and drive). The backup lights may also function through the Transmission Range Sensor (TRS) if it is an external component.","The code is telling you that the computer has recognized a failure in the TRS sensor. The sensor is either sending an erroneous or no signal at all to the computer identifying the gear position. The computer receives signals from the vehicle speed sensor as well as the TRS.","When the vehicle is moving and there are contradictory signals being received by the computer, such as the TRS signal indicates that the vehicle is in park, however the speed sensor indicates that it is moving, the code P0705 is set.","External TRS failure is common as age and mileage accumulates. It's exposed to the weather and elements, and as with any printed circuit tends to corrode over time. The upside to this is they are not an expensive repair and easy to replace with little automotive repair experience.","Example of an external Transmission Range Sensor (TRS):\n\nTRS image from Dorman","Later models with the transmission range sensor located in the valve body are a different ball game. The range sensor is separate from the neutral safety switch and reverse backup light switch. Its mission is the same, but it's replacement has now become a more serious matter both in difficulty and expense. The easiest method for determining which type is used on your vehicle is to look up the part on your local auto parts website. If it is not listed it's internal."],"symptoms":["Malfunction Indicator Lamp (MIL) illumination with P0705 DTC code set\nThe backup lights may fail to function\nIt may be necessary to move the gearshift lever up and down slightly for a better contact to allow the starter to actuate and start the engine\nIt may be impossible to actuate the starter\nIn some cases, the engine will only start in neutral\nMay start in any gear\nIrregular shift RPMs\nDrop in fuel economy\nThe transmission may display a delayed engagement\nToyota vehicles to include trucks may display erratic instrument readings"],"causes":["The causes for this DTC may include:","TRS is loose and mal-adjusted\nTransmission range sensor is defective\nBad connector at the external TRS, either loose, corroded or bent pins\nShorted wiring harness on the external sensor as a result of rubbing on the transmission linkage\nBlockage in the internal valve body TRS port or defective sensor"]}