{"code":"P0701","description":"Transmission Control System Range/Performance","info":["This diagnostic trouble code (DTC) is a generic powertrain code, which means that it applies to all 1996-newer vehicles (Ford, Honda, Mazda, Mercedes, VW, etc.). Although generic, the specific repair steps may vary depending on make/model.","If your vehicle instrument panel has presented an illuminated malfunction indicator lamp (MIL), accompanied by a stored code P0701, it simply means that the powertrain control module (PCM) has detected a malfunction in the transmission control system. This code pertains exclusively to vehicles equipped with an automatic transmission.","\n ","While most transmission controllers (for OBD-II equipped vehicles) are integrated into the PCM, there are still some manufacturers that choose to use a stand-alone transmission control module (TCM). Transmission related codes are stored as P-codes regardless of which type of system a particular vehicle is equipped (there are no T-codes). If the P0701 code is stored, it is very likely that there are other transmission control codes stored as well.","Automatic transmissions in OBD-II equipped vehicles are controlled electronically. This involves a control module, a controller area network (CAN), numerous sensors and solenoids, a powerful hydraulic pump, and a hydraulic valve body.","The transmission controller receives input voltage signals from engine and transmission sensors. Engine sensor inputs include (but are not limited to) throttle angle, engine RPM, load percentage, and coolant temperature. Transmission sensor inputs help to monitor pump pressure, transmission input speed (RPM), transmission output speed (RPM), shifter position, vehicle speed, torque converter lock-up percentage, and transmission temperature, just to name a few. The transmission controller uses these input signals to map shift strategy and electronic pump pressure parameters. The electronic pressure control valve is used to regulate pump pressure and keep the transmission shifting smoothly. If maximum pump pressure were to be applied directly to the valve body, shifting would instantly become extremely harsh and driveline components could be damaged. Electronically controlled solenoids operate spring-loaded ball valves to restrict and release high pressure fluid through hydraulic circuits, causing up and down shifts as desired. Yet another solenoid controls the percentage of torque converter lock-up, increasing fuel efficiency and power to the pavement.","The CAN is a complex system of wiring and connectors that is utilized to transmit data from the TCM (where applicable) and the PCM. Data (including stored codes) may also be shared with other controllers via the CAN. Transmission input and output speed (RPM), vehicle speed, and transmission temperature are all shared between various controllers. This data is used for comparison in anti lock braking systems, electronic traction control systems, and electronic stability control systems (among others).","This code is unique in that it is usually only stored if other transmission related codes are present. These may be codes related to mechanical issues or electrical issues.\n"],"symptoms":["Erratic transmission shift patterns\nFailure of the transmission to shift\nDiminished fuel efficiency\nTransmission slippage\nDelayed transmission engagement\nOther transmission related codes"],"causes":["Potential causes for this code to set are:","Low transmission fluid level\nSubstandard transmission fluid\nTransmission sensor failure\nOpen or shorted circuits in the transmission control system\nMechanical (internal) transmission failure\nTorque converter defects\nDefective transmission controller or PCM programming error"]}