{"code":"P071B","description":"Transmission Mode Switch A Circuit Low","info":["This is a generic powertrain diagnostic trouble code (DTC) and typically applies to OBD-II vehicles. That may include but is not limited to vehicles from GMC, Chevrolet, Ford, Buick, Dodge, etc. Although generic, the exact repair steps may vary depending on year, make, model and powertrain configuration.","The Transmission Control Module (TCM) monitors all the sensors and switches involved in the operation of the transmission. This day in age, automatic transmissions (a.k.a A/T) have more creature comforts than ever before.","\n ","For instance, at times, cruise control is monitored and controlled by the TCM (among possible other modules). The example I will use in this article is, the tow/haul mode, it is enabled by the operator to modify the ratios and shift patterns to accommodate varying loads and/or towing demands. The operation of this switch is imperative to the functionality of the tow/haul function among other possibly included systems. This will vary significantly between manufacturers so make sure to know WHICH mode switch applies to your current fault and specific make and model.","The letter \"A\" in this code, in this case anyway, could have multiple different definitions/ distinguishing factors. Most times, these will vary, so make sure to acquire the appropriate service information before performing any invasive troubleshooting steps. This is not only important but required to accurately troubleshoot obscure or non-common faults. Use this as a learning tool, given the generality of the article.","The ECM illuminates the MIL (Malfunction Indicator Lamp) with P071B and/or related codes (P071A, P071C) when it detects a malfunction in the mode switch. The majority of the time, when it comes to tow/haul switch, they are located on or near the shift lever. On a stalk-style shifter, it may be a button on the end of the lever. On console-style shifters, it may be on the dash. Another factor that varies significantly between vehicles, so refer to your service manual for location.","The P071B Transmission Mode Switch A Circuit Low code gets activated when the ECM (Engine Control Module) and/or the TCM detects a low electrical condition in the \"A\" transmission mode switch circuit.","An example of a stalk-mounted transmission tow/haul mode switch:\n"],"symptoms":["Mode switch inoperative (e.g. tow/haul mode switch, sport mode switch, etc.)\nErratic and/or abnormal switch operation\nInefficient shift pattern\nLow power under heavy load/towing\nNot downshifting when torque is needed"],"causes":["Defective or damaged mode switch\nCorrosion causing high resistance (e.g. connectors, pins, grounds, etc.)\nWiring issue (e.g. frayed, open, short to power, short to ground, etc.)\nDefective shift lever\nTCM (Transmission Control Module) issue\nFuse/box issue"]}