{"code":"P0727","description":"Engine Speed Input Circuit No Signal","info":["This diagnostic trouble code (DTC) is a generic powertrain code, which means that it applies to all OBD-II equipped vehicles (BMW, GMC, Chevy Duramax, Saturn, Audi, Jaguar, VW, Volvo, Kia, etc.). Although generic, the specific repair steps may vary depending on make/model.","A stored code P0727, simply means that the powertrain control module (PCM) has detected no input voltage signal from the engine speed sensor. The engine speed input sensor may also be called the transmission input speed sensor or the input speed sensor. A stored code P0727 may be caused by a mechanical problem or an electrical problem.","\n ","The engine speed input sensor is normally inserted through an opening in the transmission case, near the front of the input shaft and fitted with a rubber O-ring (on the sensor housing) so that it makes a seal with the transmission case. Use care when removing the sensor from the housing as hot transmission fluid may be harmful. Position a suitable container under the opening in the transmission to catch any fluid that may spill when the sensor is removed. Carefully repeat this process whenever you pan to remove any sensor from the transmission (regardless of whether you plan to test or replace it).","At the core of the typical engine input speed sensor circuit is a stationary mounted electromagnetic hall-effect sensor. It is mounted so that a toothed reluctor ring (attached to the input shaft of the transmission) passes in very close proximity to its magnetic tip. As the transmission input shaft turns, the reluctor ring spins. The raised areas of the teeth on the reluctor ring are employed to electromagnetically complete the engine speed input circuit and the recessed areas between the teeth interrupt the circuit. A waveform pattern is formed by the rapid electromagnetic completions and interruptions of the circuit. The waveform patterns represent frequency and voltage variations which the PCM recognizes as engine input speed.","A code P0727 will be stored, and a malfunction indicator lamp may be illuminated, if the PCM fails to receive engine speed input signal voltage for a set period of time and under certain circumstances. It is worth noting that the transmission control module (TCM) or PCM may enter limp-in mode when this code is stored.","Related engine speed input circuit engine codes include:","P0725 Engine Speed input Circuit Malfunction\nP0726 Engine Speed Input Circuit Range/Performance\nP0728 Engine Speed Input Circuit Intermittent"],"symptoms":["Automatic transmissions may shift harshly (limp-in mode)\nTransmission fails to shift or shifts erratically\nErratic or inoperative speedometer/odometer\nInoperative or incorrect tachometer\nTransmission slippage or delayed engagement\nAdditional transmission input/output speed codes may be stored"],"causes":["Possible causes for this P0727 code include:","Open or shorted wiring and/or connectors in the engine speed input circuit\nExcessive metal deposits on the magnetic tip of the sensor\nDefective engine speed input sensor or transmission output speed sensor\nDamaged or worn engine speed sensor reluctor ring\nMechanical transmission failure which results in transmission/clutch slippage"]}