{"code":"P0728","description":"Engine Speed Input Circuit Intermittent","info":["This diagnostic trouble code (DTC) is a generic powertrain code, which means that it applies to all OBD-II equipped vehicles (Nissan, Ford, GM, Chevrolet, Dodge, Jeep, GMC, VW, Toyota, etc.). Although generic, the specific repair steps may vary depending on make/model.","If your vehicle has a stored code P0728, it means that the powertrain control module (PCM) has detected an intermittent input voltage signal from the engine speed sensor. The engine speed input sensor can sometimes be called the transmission input speed sensor or just the input speed sensor. Either a mechanical problem or an electrical problem may contribute to a stored code P0728.","\n ","Most engine speed input sensors are inserted through an opening in the transmission case, near the front of the input shaft. The sensor is usually fitted with a rubber O-ring (around the outside) so that it makes a seal with the opening in the transmission case. You should take care when removing the sensor from the housing as hot transmission fluid may be harmful. A suitable container should be placed under the opening in the transmission to catch any fluid that may leak once the sensor is loosened and eventually removed. You should make this a habit whenever you plan to remove any sensor from the transmission (whether you plan to test or replace it).","A stationary mounted electromagnetic hall-effect sensor is at the heart of the modern engine input speed sensor circuit. The sensor is mounted so that a toothed reluctor ring (attached to the input shaft of the transmission) passes in very close proximity to its magnetic tip, as it spins. The reluctor ring spins along with the transmission input shaft. The raised areas of the teeth on the reluctor ring electromagnetically complete the engine speed input circuit and the recessed areas between the teeth interrupt the circuit. A waveform pattern is formed by these rapid electromagnetic completions and interruptions of the circuit. The waveform patterns represent frequency and voltage fluctuations that the PCM recognizes as engine input speed.","A code P0728 will be stored, and a malfunction indicator lamp may be illuminated, if the PCM detects an intermittent or erratic signal from the engine speed input sensor for a set period of time and under certain circumstances. Keep in mind that the transmission control module (TCM) or PCM may enter limp-in mode when a P0728 is stored.","Related engine speed input circuit engine codes include:","P0725 Engine Speed input Circuit Malfunction\nP0726 Engine Speed Input Circuit Range/Performance\nP0727 Engine Speed Input Circuit No Signal"],"symptoms":["Erratic or inoperative speedometer/odometer\nAutomatic transmissions may shift harshly (limp-in mode)\nTransmission fails to shift or shifts erratically\nInoperative or incorrect tachometer\nTransmission slippage or delayed engagement\nAdditional transmission input/output speed codes may be stored"],"causes":["Possible causes for this P0728 code include:","Open or shorted wiring and/or connectors in the engine speed input circuit\nExcessive metal deposits on the magnetic tip of the sensor\nDefective engine speed input sensor or transmission output speed sensor\nDamaged or worn engine speed sensor reluctor ring\nMechanical transmission failure which results in transmission/clutch slippage"]}