{"code":"P0721","description":"Output Speed Sensor Range/Performance","info":["This is a generic powertrain diagnostic trouble code (DTC) and applies to OBD-II vehicles. That may include but is not limited to vehicles from VW, BMW, Mercedes, Chevrolet, GMC, Allison, Duramax, Dodge, Ram, Ford, Honda, Hyundai, Audi, etc. Although generic, the exact repair steps may vary depending on year, make, model and powertrain configuration.","The P0721 OBD-II trouble code is associated with the Transmission Output Speed Sensor.","\n ","When the Powertrain Control Module (PCM) detects a malfunction within the Output Speed Sensor Circuit a wide variety of codes can be triggered depending on the specific vehicle and the specific automatic transmission.","Some of the more common code responses associated with Transmission Output Speed Sensor issues are codes P0720, P0721, P0722 and P0723 based on the specific malfunction that alerts the PCM to set the code and activate the Check Engine Light.","The purpose of the Transmission Output Speed Sensor is to provide the PCM with signal that indicates the speed of the transmission output shaft rotation. The PCM uses these readings to control the shift solenoids. The solenoids direct fluid between various hydraulic circuits and change the transmission gear ratio at the appropriate time. Based on the vehicle and the transmission configuration the Output Speed Sensor may also control the speedometer reading. An automatic transmission is controlled by bands and clutches that change gears by having fluid pressure in the right place at the right time. This process starts with the Transmission Output Speed Sensor.","Code P0721 is set by the PCM when the Output Speed Sensor is out of range or not functioning properly."],"symptoms":["Poor fuel economy\nCheck Engine Light illuminated\nTransmission does not shift\nTransmission Shifts roughly\nPossibly misfire-like symptoms\nPCM puts the engine into limp mode\nSpeedometer shows incorrect or erratic reading"],"causes":["Defective Output Speed Sensor\nDirty or contaminated fluid\nDirty or clogged transmission filter\nDefective Coolant Temperature Sensor\nDefective Transmission Valve Body\nRestricted hydraulic passages\nFaulty Shift Solenoid\nCorroded or damaged connector\nFaulty or damaged wiring\nFaulty PCM"]}