{"code":"P0743","description":"Torque Converter Clutch (TCC) Solenoid Circuit Electrical","info":["This diagnostic trouble code is set when the Engine Management Computer (EMC) also known as the Powertrain Control Module (PCM) and also known as the Engine Control Module (ECM) detects a fault with the torque converter clutch (TCC) solenoid electrical circuit, which is contained inside the transmission.","\n ","An automatic transmission is not 100% efficient because it is a fluid coupling that connects the engine to the rest of the internal transmission parts. The torque convertor transfers power using hydraulic force and it is internal to the transmission assembly. With that transfer of power comes excessive heat. The lockup torque converter was designed to make the transmission more efficient at highway speeds and to control heat. The torque convertor clutch is what lockups the convertor. Heat kills transmissions. That is why you hear that stop and go traffic is hard on a automatic transmission","The converter clucth does not lockup at these low speeds therefore heat is generated. This clutch is controlled by an electrical solenoid. The torque convertor clutch is locked changing the fluid coupling to a mechanical one. This solenoid uses power and ground sent through a coil of wires which creates a magnetic field to pull or push a central metal rod. When the solenoid is energized or de-energized, it directs fluid flow through the valve body of the transmission."],"symptoms":["Malfunction indicator illumination (check engine light or service engine soon light)\nStalling when coming to a stop after cruising speeds\nShudder on take off\nShudder when coming to a stop"],"causes":["Potential causes may include:","Low or dirty transmission fluid\nWire/circuit issue shorted to power or ground\nFailed torque converter clutch (TCC) solenoid\nFailed TCC assembly in the torque converter\nFailed PCM/ECM/EMC","Note: This may well be an intermittent condition and may not show up again, so clear the code and keep monitoring."]}