{"code":"P077B","description":"Output Speed Sensor Circuit - Direction Signal","info":["This generic powertrain diagnostic trouble code (DTC) typically applies to many OBD-II vehicles. That may include but is not limited to vehicles from Chevrolet, Ford, Toyota, Dodge, Honda, etc.","\n ","When your vehicle has stored a code P077B, it means that the powertrain control module (PCM) has detected a directional error from the output speed sensor signal circuit.","Output speed sensors are typically of the electromagnetic variety. They utilize some type of toothed reluctor ring or gear that is permanently affixed to the transmission output shaft. As the output shaft spins, so spins the reluctor ring. The raised teeth of the reluctor ring complete the output speed sensor circuit when they pass in close proximity to the stationary electromagnetic sensor. As the reluctor passes by the electromagnetic tip of the sensor, the notches between the reluctor ring teeth create interruptions in the sensor circuit. This combination of circuit completions and interruptions are received by the PCM (and other controllers) as wave form patterns which represent transmission output speed.","The sensor either threads directly into the transmission housing or is held in place with a bolt. An O-ring seal is used to prevent fluid leaking from the sensor opening.","The PCM compares transmission input speed and output speed to determine if the transmission is shifting correctly and operating efficiently.","If a code P077B is stored, the PCM has detected an input voltage signal from the output speed sensor indicating that the reluctor ring is moving (or has moved) in an incorrect direction. When the output speed sensor voltage signal inputs negative voltage, the PCM assumes that the reluctor ring has unexpectedly moved in an incorrect direction. The PCM receives vehicle speed input data and wheel speed input data in addition to the output speed sensor data. By comparing these signals, the PCM can determine if the reluctor ring is moving in the correct direction (according to the output speed sensor signal). A negative output speed sensor signal may be caused by either an electrical malfunction or a mechanical problem.","Here is an example of a transmission speed sensor:\n"],"symptoms":["Intermittent speedometer/odometer operation\nAbnormal transmission shift patterns\nTransmission slippage or delayed engagement\nActivation/deactivation of the traction control system (if applicable)\nOther transmission and/or ABS codes may be stored"],"causes":["Defective output speed sensor\nMetal debris on the output speed sensor\nOpen or shorted circuits or connectors (especially near the output speed sensor)\nDamaged or worn reluctor ring\nMechanical transmission failure"]}