{"code":"P0780","description":"Shift Malfunction","info":["In my own personal experience, when a code P0780 is stored, it means that the powertrain control module (PCM) has detected a problem with automatic transmission shifting. This code may be caused by either a mechanical or an electronic malfunction but is limited to vehicles with automatic transmissions.","\n ","Automatic transmissions in OBD-II equipped vehicles are controlled by the PCM or a stand-alone transmission control module (TCM). Input signals from an array of engine and transmission sensors are used by the transmission controller to calculate transmission shift strategy. Electronic solenoid valves are then activated by the controller, allowing high pressure fluid to flow into the appropriate hydraulic circuit (in the valve body) and permit the transmission to up or down shift as required.","A powerful pump (integrated into the transmission housing and driven by the engine) is used to create the hydraulic pressure needed to accomplish smooth and efficient shifting functions. Since varying degrees of hydraulic pressure are required at different RPM levels and engine loads, the transmission controller regulates pressure via an electronic pressure regulator. The transmission pressure sensor and the transmission temperature sensor help the controller to monitor hydraulic pressure and make the necessary adjustments.","The transmission controller is programmed to compare input signals from the input speed sensor and output speed sensor to determine whether the transmission is shifting efficiently. If the PCM detects that the transmission is not shifting properly, a P0780 code will be stored and a malfunction indicator lamp (MIL) may be illuminated. On some models, this type of code will require multiple drive cycles in order for the MIL to be illuminated. In this case, the code may initially be exhibited as a pending code.\n"],"symptoms":["Erratic transmission shift patterns\nDelayed transmission engagement\nHarsh transmission shifts (especially if the controller has been placed in limp-in mode)\nTransmission slippage\nWhining noise from the transmission pump"],"causes":["Potential causes for this code to set are:","Shorted or open circuits in the transmission control harness\nLow transmission fluid\nOutdated or burnt transmission fluid\nDefective shift solenoid/s\nFaulty input or output sped sensors\nBad electronic pressure regulator\nFailed transmission pump\nMechanical failure; including torque converter failure, clutch failure, or internal component wear/breakage\nA defective PCM or a PCM programming error"]}