{"code":"P0785","description":"Shift Timing Solenoid A Malfunction","info":["This is a generic transmission diagnostic trouble code (DTC) and typically applies to OBD-II vehicles equipped with an automatic transmission. Vehicle makes may include but aren't limited to Chevrolet / Chevy, Volvo, GMC, Saab, Subaru, VW, BMW, Toyota, Ford, Dodge, etc.","The shift timing solenoid is one of many components that allow an automatic transmission to shift seamlessly according to your driving needs. The TCM (Transmission Control Module) monitors and controls the solenoids functionality.","\n ","The solenoids main purpose is to control hydraulic (ATF:Automatic Transmission Fluid) flow internally to assist in shifting the transmission. Essentially these solenoids are electro-mechanical \"pistons\". Most times, their are many shift timing solenoids within the system so you may be able to refer to the letter included in the code to pinpoint which solenoid you are working with depending on your particular make and model.","The ECM (Engine Control Module) illuminates the MIL (Malfunction Indicator Lamp) with P0785 and associated codes (P0786, P0787, P0788, and P0789) when it monitors one or more issues within the shift timing solenoid or it's circuit. The circuit includes the TCM which depending on the model could be in a volatile location. Their are many possible causes here so it could be either be mechanical and/or electrical depending on the code and if any others are active. Automatic transmissions are intricately designed systems and in my opinion, the layman or average DIYer should leave it to the pros here especially when it comes to internal transmission work.","The code P0785 Shift Timing Solenoid A Malfunction is set there is a general malfunction present within the solenoid or its circuit.","Note: If you have a GM vehicle (GMC/Chevrolet/etc.) with the 4L60-E transmission, the code description for this is actually Transmission 3-2 Shift Solenoid."],"symptoms":["Stuck in gears\nErratic shifting\nTransmission slippage\nHard or harsh shifting\nInefficient shift timing\nPoor driveability\nPoor acceleration\nOverall poor performance"],"causes":["Damaged or defective shift timing solenoid\nDirty Automatic Transmission Fluid (ATF)\nLow ATF\nObstruction in ATF passages\nBroken or damaged wiring harness\nTCM issue\nECM issue\nPin/connector problem (corrosion, melting, broken lock tab etc.)"]}