{"code":"P0702","description":"Transmission Control System Electrical","info":["This diagnostic trouble code (DTC) is a generic powertrain code, which means that it applies to all 1996-newer vehicles (Ford, Honda, Mazda, Mercedes, VW, etc.). Although generic, the specific repair steps may vary depending on make/model.","If I encounter a malfunction indicator lamp (MIL) and a stored code P0702, it means that the powertrain control module (PCM) has detected a malfunction in the electrical portion of the transmission control system. Only vehicles equipped with an automatic transmission should exhibit this code.","\n ","Most transmission controllers (for OBD-II equipped vehicles) are integrated into the PCM but there are some manufacturers that use a stand-alone transmission control module (TCM). Regardless of with which type of system a particular vehicle is equipped, transmission related codes are stored as P-codes. There will likely be other transmission control codes stored with the P0702.","Automatic transmissions are controlled electronically in OBD-II equipped vehicles. A control module, controller area network (CAN), numerous sensors and solenoids, a powerful hydraulic pump, and a hydraulic valve body are vital to the operation of the electronically controlled transmission.","Input voltage signals from engine and transmission sensors are received by the transmission controller. Throttle angle, engine RPM, engine load percentage, and coolant temperature are among the engine sensor inputs. Helping to monitor pump pressure, transmission input speed (RPM), transmission output speed (RPM), shifter position, vehicle speed, torque converter lock-up percentage, and transmission temperature are the transmission sensor inputs. These input signals are used by the transmission controller to map shift strategy and electronic pump pressure parameters. The electronic pressure control valve regulates pump pressure and keeps the transmission shifting efficiently. Shifting would instantly become extremely harsh, and driveline components could be damaged, if maximum pump pressure were to be applied directly to the valve body. Up and down shifts are accomplished with electronically controlled solenoids that operate spring-loaded ball valves. These valves restrict and release high pressure fluid as desired. The torque converter clutch (TCC) solenoid controls the percentage of torque converter lock-up.","The CAN is a complex system of electrical wiring and connectors that is used to transmit data between the TCM (where applicable) and the PCM. Data (including stored codes) may also be transmitted to other controllers via the CAN. Among the information shared between controllers is transmission input and output speed (RPM), vehicle speed, and transmission temperature. Anti lock braking systems, electronic traction control systems, and electronic stability control systems all utilize this data for comparison purposes. This code is usually only stored if other electrical transmission control codes are present.\n"],"symptoms":["Erratic transmission shift patterns\nFailure of the transmission to shift at all\nDecreased fuel efficiency\nOther transmission related codes"],"causes":["Potential causes for this code to set are:","Transmission sensor failure\nOpen or shorted circuits in the transmission control system\nDefective transmission controller or PCM programming error"]}