{"code":"P0704","description":"Clutch Switch Input Circuit Malfunction","info":["This diagnostic trouble code (DTC) is a generic powertrain code, which means that it applies to all 1996-newer vehicles (Ford, Honda, Mazda, Mercedes, VW, etc.). Although generic, the specific repair steps may vary depending on make/model.","If a code P0704 has been stored in your OBD-II vehicle, it simply means that the powertrain control module (PCM) has detected a malfunction in the clutch switch input circuit. This code is applicable to vehicles equipped with manual transmissions, exclusively.","\n ","Certain manual transmission functions are electronically monitored by the PCM. Shifter position and clutch pedal position are among these functions. In some models, the turbine input and output speed are also monitored to determine the degree of clutch slippage.","The clutch is a mechanical coupling that links the engine to the transmission. In most cases, it is operated using a rod (with a foot pedal on the end) that pushes in the plunger of a firewall mounted hydraulic clutch master cylinder. When the clutch master cylinder is depressed, hydraulic fluid is pushed into the (transmission mounted) slave cylinder. The slave cylinder actuates the clutch pressure plate, allowing the engine to be engaged and disengaged from the transmission as necessary. Some models use a cable operated clutch but this type of system is becoming less common. Depressing the pedal with the left foot disengages the transmission from the engine. Releasing the pedal allows the clutch to engage the engine flywheel, propelling the vehicle in the desired direction.","The primary function of the clutch switch is to act as a safety feature so that the engine is not started with the transmission unintentionally engaged. The clutch switch is designed primarily to interrupt the starter signal (from the ignition switch) so that the starter will not be activated unless the clutch pedal is depressed. The PCM and other controllers also utilize input from the clutch switch for various engine control calculations, automated braking functions, as well as hill-hold and stop-start implementation.","The code P0704 pertains to the input circuit of the clutch switch. Consult your vehicle service manual or All Data (DIY) for component locations and other specific information about this particular circuit as it relates to your vehicle.\n"],"symptoms":["Intermittent or failed engine starting\nDiminished fuel efficiency\nExcessive engine RPM at idle\nTraction control system may be disabled\nSafety functions may be disabled on some models"],"causes":["Potential causes for this code to set are:","Defective clutch switch\nWorn clutch pedal lever or clutch lever bushing\nShorted or open wiring and/or connectors in the clutch switch circuit\nBlown fuse or burnt fusible link\nFaulty PCM or PCM programming error"]}