{"code":"P0703","description":"Torque Converter/Brake Switch B Circuit Malfunction","info":["This diagnostic trouble code (DTC) is a generic powertrain code, which means that it applies to all 1996-newer vehicles (Ford, Honda, Mazda, Mercedes, VW, etc.). Although generic, the specific repair steps may vary depending on make/model.","If you discover that a code P0703 has been stored in your OBD-II vehicle, it means that the powertrain control module (PCM) has detected a malfunction in a certain torque converter brake switch circuit. This code is applicable to vehicles equipped with automatic transmissions, only.","\n ","Automatic transmissions (in mass produced vehicles) have been electronically controlled since the 1980s. Most OBD-II equipped vehicles are managed by a transmission controller that is integrated into the PCM. Other vehicles utilize a stand-alone transmission control module that communicates with the PCM and other controllers via the controller area network (CAN).","The torque converter is a type of fluid coupling that links the engine to the transmission. When the vehicle is in motion, the torque converter allows torque to be transferred to the transmission input shaft. When the vehicle comes to a stop (with the engine idling) the torque converter absorbs the torque of the engine, using a complex system of wet clutches. This allows the engine to idle without stalling.","The lockup torque converter, used in OBD-II equipped vehicles, allows the engine to lock into the transmission input shaft under certain conditions. This usually occurs when the transmission has shifted into the highest gear, the vehicle has reached a certain speed, and the desired engine RPM level has been achieved. In lockup mode, the torque converter clutch (TCC) is restricted gradually until the transmission is functioning as though it were bolted directly to the engine in a 1:1 transfer ratio. These gradual clutch restrictions are known as percentage of torque converter lockup. This system promotes fuel efficiency and optimal engine performance. Torque converter lockup is achieved using an electronic solenoid that controls a spring loaded rod or ball valve. When the PCM recognizes that conditions are correct, the lockup solenoid is activated and the valve allows fluid to bypass the torque converter (gradually) and be applied directly to the valve body.","Torque converter lockup must be disengaged before engine RPM levels decrease to a certain level and definitely before the vehicle comes to a stop, with the engine idling. If not, the engine will undoubtedly stall. One of the specific signals that the PCM looks for in torque converter lockup disengagement is the application of the brake pedal. When the brake pedal is applied, the brake lever arm causes contacts in the brake switch to be closed, completing one or more circuit/s. When these circuits are completed, the stop lamps are illuminated. A second signal is sent to the PCM. This signal lets the PCM know that the brake pedal has been depressed and the torque converter lockup solenoid needs to be disengaged.","The P0703 code pertains to one of these brake switch circuits. Consult your vehicle service manual or All Data for specific information about this particular circuit as it relates to your vehicle.\n"],"symptoms":["Engine stalling when the vehicle rolls to a stop\nTCC lockup may be disabled\nDiminished fuel efficiency\nDecreased engine performance (especially at highway speeds)\nErratic transmission shift patterns\nNo stop lamp illumination"],"causes":["Potential causes for this code to set are:","Defective brake switch\nMisadjusted brake switch\nShorted or open wiring and/or connectors in the brake switch circuit designated as B\nBlown fuse or burnt fusible link\nFaulty PCM or PCM programming error"]}