{"code":"P0725","description":"Engine Speed Input Circuit Malfunction","info":["This diagnostic trouble code (DTC) is a generic powertrain code, which means that it applies to all OBD-II equipped vehicles (Nissan, Dodge, VW, Jeep, Mazda, Honda, Chrysler, Subaru, etc.). Although generic, the specific repair steps may vary depending on make/model.","The presence of a stored code P0725 means that the powertrain control module (PCM) has detected a circuit malfunction with the engine speed sensor input signal. The engine speed input sensor is sometimes called the transmission input speed sensor and the input speed sensor. This type of code may be caused by a mechanical problem or an electrical problem.","\n ","The engine speed input speed sensor is usually inserted through the transmission case, near the front of the input shaft. Typically, a rubber O-ring is fitted onto the sensor housing so that the sensor makes a seal with the transmission case. Use caution when removing the sensor from the housing as hot transmission fluid may be harmful. Place a suitable container under the opening in the transmission to catch any fluid that may pour out when the sensor is removed (for testing or replacement).","The basic theory of operation of an engine input speed sensor circuit is that an electromagnetic hall-effect sensor is mounted in such a manner as to allow a toothed reluctor ring to pass in very close proximity to its magnetic tip. The reluctor ring is mechanically affixed to the input shaft of the transmission so that when the shaft spins, it spins in conjunction. The raised areas of the teeth serve to electromagnetically complete the engine speed input circuit while the recessed areas between the teeth interrupt the circuit. These rapid completions/interruptions form an electronic waveform pattern that represents a particular frequency and degree of voltage. The waveform pattern is recognized by the PCM as engine input speed.","If the PCM fails to recognize the appropriate engine speed input signal, for a set period of time and under certain circumstances, a P0725 will be stored and a malfunction indicator lamp may be illuminated.","Unacceptable engine speed input signals may include excessive voltage, insufficient voltage, or incorrect voltage as compared to transmission output speed, throttle position, or engine RPM. In some cases, the transmission control module (TCM) or PCM may enter limp-in mode when this code is stored.","Related engine speed input circuit engine codes include:","P0726 Engine Speed Input Circuit Range/Performance\nP0727 Engine Speed Input Circuit No Signal\nP0728 Engine Speed Input Circuit Intermittent"],"symptoms":["Erratic or inoperative speedometer/odometer\nAutomatic transmissions may shift harshly (limp-in mode)\nTransmission fails to shift or shifts erratically\nInoperative or incorrect tachometer\nTransmission slippage or delayed engagement\nAdditional transmission input/output speed codes may be stored"],"causes":["Possible causes for this P0725 code include:","Defective engine speed input sensor or transmission output speed sensor\nDamaged or worn engine speed sensor reluctor ring\nOpen or shorted wiring and/or connectors in the engine speed input circuit\nExcessive metal deposits on the magnetic tip of the sensor in question\nMechanical transmission failure which results in transmission/clutch slippage"]}