{"code":"P0726","description":"Engine Speed Input Circuit Range/Performance","info":["This diagnostic trouble code (DTC) is a generic powertrain code, which means that it applies to all OBD-II equipped vehicles (VW, Nissan, Chevy, GMC Duramax, Audi, etc.). Although generic, the specific repair steps may vary depending on make/model.","When I encounter a stored code P0726, I know it means that the powertrain control module (PCM) has detected a circuit range or performance malfunction in regard to the engine speed sensor input signal. The engine speed input sensor is also called the transmission input speed sensor or simply the input speed sensor. This type of code may be caused by either a mechanical problem or an electrical problem.","\n ","Inserted through the transmission case, near the front of the input shaft, the engine speed input sensor is usually fitted with a rubber O-ring on the sensor housing so that it makes a seal with the transmission case. Caution must be used when removing the sensor from the housing as hot transmission fluid may be harmful. A suitable container must be positioned under the opening in the transmission to catch any fluid that may spill when the sensor is removed. This should be your practice whether you plan to test or replace the sensor.","The typical engine input speed sensor circuit is centered around a stationary mounted electromagnetic hall-effect sensor which is mounted in such a manner as to allow a toothed reluctor ring to pass in very close proximity to its magnetic tip. The reluctor ring is attached to the input shaft of the transmission. When the shaft spins, the reluctor ring spins too. In order to electromagnetically complete the engine speed input circuit, the raised areas of the teeth on the reluctor ring are employed. The recessed areas between the teeth interrupt the circuit. These rapid electromagnetic completions and interruptions of the circuit form a waveform pattern that represents frequency and voltage. The PCM recognizes the waveform pattern as engine input speed.","A P0726 will be stored, and a malfunction indicator lamp may be illuminated, if the PCM fails to receive the expected engine speed input signal voltage for a set period of time and under certain circumstances.","Unacceptable engine speed input signals may include excessive voltage or insufficient voltage as compared to transmission output speed, throttle position, or engine RPM. The transmission control module (TCM) or PCM may enter limp-in mode when this code is stored.","Related engine speed input circuit engine codes include:","P0725 Engine Speed input Circuit Malfunction\nP0727 Engine Speed Input Circuit No Signal\nP0728 Engine Speed Input Circuit Intermittent"],"symptoms":["Transmission fails to shift or shifts erratically\nErratic or inoperative speedometer/odometer\nAutomatic transmissions may shift harshly (limp-in mode)\nInoperative or incorrect tachometer\nTransmission slippage or delayed engagement\nAdditional transmission input/output speed codes may be stored"],"causes":["Possible causes for this P0726 code include:","Excessive metal deposits on the magnetic tip of the sensor in question\nDefective engine speed input sensor or transmission output speed sensor\nDamaged or worn engine speed sensor reluctor ring\nOpen or shorted wiring and/or connectors in the engine speed input circuit\nMechanical transmission failure which results in transmission/clutch slippage"]}