{"code":"P0737","description":"TCM Engine Speed Output Circuit","info":["This is a generic powertrain diagnostic trouble code (DTC) and applies to OBD-II vehicles. That may include but is not limited to vehicles from Dodge, Chevrolet, Honda, Toyota, Hyundai, Jaguar, etc. Although generic, the exact repair steps may vary depending on year, make, model and powertrain configuration.","The TCM (Transmission Control Module) works similarly to the ECM (Engine Control Module) in that, it monitors, controls and regulates the functions of the transmission where the ECM does the same for the engine.","\n ","The TCM uses various sensors and switches as well as the ECM to monitor, control and regulate the drivability of the transmission. In particular, The TCM uses an Engine Speed Sensor (ESS) to determine shift points among other functions. Just like the name implies, the ESS monitors the speed of the engine. Other names for the ESS may be CKP (Crankshaft Position Sensor) or OSS (Output Speed Sensor).","Most times, it measures the speed of the crankshaft using a hall effect type sensor. The sensor uses notches in the flywheel that pass through the sensor to monitor the position of the crankshaft. It is imperative that the ECM and TCM have an accurate reading here as it influences among other things: Shift points, Speed, Driveability etc.","The ECM activates P0737 and associated codes when it monitors one or multiple conditions outside a specific electrical range within the Engine Speed Sensor or it's circuit. Given the nature of the code and the location of the sensor, i would say most times this would be an electrical issue. Specific mechanical issues may cause this code but i would say they are somewhat rare.","P0737 TCM Engine Speed Output Circuit code is set when the ECM monitors a general malfunction or an open circuit within the Engine Speed output circuit(s)."],"symptoms":["Hard shift\nFuel mileage drop\nNo start\nLow speed\nEngine stalling/bucking\nInaccurate speedometer\nLess throttle response"],"causes":["Defective Engine Speed Sensor (ESS)\nDefective ECM (Engine Control Module)\nDefective TCM (Transmission Control Module)\nWiring issue\nDirty pickup on the ESS\nConnector problem"]}