{"code":"P073B","description":"Stuck In Gear 6","info":["This is a generic powertrain diagnostic trouble code (DTC) and typically applies to OBD-II vehicles equipped with an automatic transmission. That may include but is not limited to vehicles from Volkswagen, Audi, Nissan, Mazda, Ford, etc. Although generic, the exact repair steps may vary depending on year, make, model and powertrain configuration. Anecdotally this code is more commonly seen on VW & Audi vehicles.","\n ","As we drive our vehicles, numerous modules and computers monitor and adjust a vast amount of components and systems in order to make the vehicle's operation seamless and efficient. Among those components and systems, you have the automatic transmission (A/T).","Within the A/T alone, there are countless moving parts, systems, components, etc. to keep the transmission in the correct gear according to driver's demands. Another important part of the whole thing is the TCM (Transmission Control Module), it's main function is to monitor, adjust and correlate different values, speeds, driver's inputs, etc. and to effectively shift the vehicle for you! Given the sheer number of possibilities here, you will want to start, and most likely stick to, the basics here.","Most likely, if you are searching this code, your vehicle isn't going anywheres fast (if anywhere at all!). If you are stuck in a gear or neutral, it would be a good idea to avoid driving the vehicle, or trying to, until the fault is repaired. Let's say, you are stuck in second gear, trying to get up to highway speeds, you probably get it faster than 60km/h. That said, your engine will be working extremely hard to keep up the desired speed. Engine damage is highly likely in these events.","The ECM (Engine Control Module) will illuminate the CEL (Check Engine Light) and log a code P073B when it detects that the automatic transmission is stuck in gear 6.","Automatic transmission gear indicator:\n"],"symptoms":["Abnormal vehicle speeds\nLow power\nAbnormal engine noises\nReduced throttle response\nLimited vehicle speeds\nATF (Automatic Transmission Fluid) leak (red fluid under vehicle)"],"causes":["Blockage in transmission hydraulics\nLow ATF level\nDirty ATF\nIncorrect ATF\nShift solenoid issue\nTCM issue\nWiring issue (i.e. chafing, melting, short, open, etc.)\nConnector issue (i.e. melting, broken tabs, corroded pins, etc.)"]}