{"code":"P0790","description":"Normal/Performance Switch Circuit Malfunction","info":["This is a generic powertrain diagnostic trouble code (DTC) and typically applies to OBD-II vehicles. That may include but is not limited to vehicles from GMC, Chevrolet, Ford, Buick, Dodge, etc. Although generic, the exact repair steps may vary depending on year, make, model and powertrain configuration.","The Transmission Control Module (TCM) monitors all the sensors and switches involved in the operation of the transmission. This day in age, automatic transmissions (a.k.a A/T) have more creature comforts than ever before.","\n ","For instance, at times, cruise control is monitored and controlled by the TCM (among possible other modules). For this article, it applies to a normal/performance mode switch, it is enabled by the operator to modify the ratios and shift patterns to accommodate usually higher upshift points and faster downshift points. The operation of this switch is imperative to the functionality of the performance function among other possibly included systems. This will vary significantly between manufacturers so make sure to know WHICH switch applies to your current fault and specific make and model.","The ECM illuminates the MIL (Malfunction Indicator Lamp) with P0790 when it detects a malfunction in the normal/performance switch circuit. The majority of the time, when it comes to this switch, they are located on or near the shift lever. On a stalk-style shifter, it may be a button on the end of the lever. On console-style shifters, it may be on the dash or console. Another factor that varies significantly between vehicles, so refer to your service manual for location.","An example of a stalk-mounted transmission mode switch (normal/performance would be similar):\n"],"symptoms":["Mode switch inoperative\nErratic and/or abnormal switch operation\nInefficient shift pattern\nLow power\nNot downshifting when torque is needed"],"causes":["Defective or damaged switch\nCorrosion causing high resistance (e.g. connectors, pins, grounds, etc.)\nWiring issue (e.g. frayed, open, short to power, short to ground, etc.)\nDefective shift lever\nTCM (Transmission Control Module) issue\nFuse/box issue"]}