{"code":"P0792","description":"Intermediate Shaft Speed Sensor A Circuit Range/Performance","info":["This is a generic diagnostic trouble code (DTC) that typically applies to OBD-II vehicles with automatic transmissions. That may include but is not limited to vehicles from Mazda, Toyota, Chrysler, Ford, VW, Dodge, Jeep, Mercedes, Lexus, Chevrolet, etc.","Although generic, the exact repair steps may vary depending on year, make, model and powertrain configuration.","\n ","The intermediate shaft, otherwise known as the layshaft aids in distributing rotational force from the input drive to the output shaft inside the transmission. The speed of the intermediate shaft depends on which gear you are in. In a manual transmission, the gear selector dictates this, so there is no need to monitor speed of the intermediate shaft.","On the other hand, in an automatic transmission, if you are in \"D\" drive, the gear you are in is determined by the TCM (Transmission Control Module) using multiple sensor inputs that all contribute to the vehicle shifting smoothly and efficiently. One of the sensors included here is the Intermediate shaft speed sensor. The TCM needs this specific input to aid in determining and adjusting hydraulic pressures, shift points and patterns. Experience in diagnosing other types of speed sensors (e.g.: VSS (Vehicle speed sensor), ESS (Engine Speed Sensor), etc.) will help you here as most speed sensors are similar in design.","The ECM (Engine Control Module) in conjunction with the TCM (Transmission Control Module) may activate P0792 and associated codes (P0791, P0793, P0794) when they monitor a fault within the intermediate shaft speed sensor or it's circuits. Sometimes when the sensor fails, the TCM uses other speed sensors within the transmission and determines a \"backup\" hydraulic pressure in order to keep the automatic transmission functional but this may vary significantly between manufacturers.","The code P0792 Intermediate Shaft Speed Sensor A Circuit Range/Performance is set by the ECM (engine control module) and/or the TCM (transmission control module) when it/they monitors an out of range condition within the A speed sensor or it's circuit. Refer to a vehicle specific repair manual to determine which is the \"A\" part of the circuit for your particular application.","NOTE: Record any codes active in other systems if multiple warning lights are illuminated (e.g.: Traction control, ABS, VSC, etc.).","Photo of a transmission speed sensor:\n"],"symptoms":["Hard shifting\nNumerous instrument panel lights illuminated\nPoor driveability\nErratic engine speed"],"causes":["Defective or damaged Intermediate shaft speed sensor\nElectrical fault in the wires between the speed sensor and modules used\nInternal ECM and/or TCM issue\nOther related sensors/solenoids damaged or defective (e.g.: Input shaft speed sensor, Output shaft sensor, Shift solenoid etc.)\nDirty or low automatic transmission fluid (ATF)"]}