{"code":"P2509","description":"ECM/PCM Power Input Signal Intermittent","info":["This is a generic powertrain code, which means it covers all makes supporting OBD-II protocol. However, specific troubleshooting steps will vary depending on the vehicle.","The generic trouble code P2509 power input signal intermittent refers to an engine with an intermittent electrical signal to the Electronic Control Module (ECM) otherwise also known as a PCM or Powertrain Control Module.","\n ","The signal is not constant and within parameters with the ignition key turned off. For one reason or another the voltage from the batteries is either low, is dropping due to a power drain or there is a bad connection.","A small amount of parasitic draw in the range of 30 milliamps or less is normal after all the computer have gone to sleep or timed out. The ECM memory and the radio memory are responsible for this, but it is insignificant and will not effect battery performance.","This code seems most common on Dodge & Ram diesel trucks. Technical service bulletins for the Dodge/Ram Cummins diesel engine also conclude that an overcharge or undercharge condition will also contribute to the setting of this code and the corresponding symptoms."],"symptoms":["Malfunction Indicator Lamp (MIL) illumination with P2509 DTC set\nHard to start or failure to start\nTachometer may fluctuate between 500 to 700 rpm when idling cold\nCheck gauges light may illuminate and voltmeter displays 11 volts or less\nTruck may cut off while driving\nAdditional codes P2502 - charging system error and P2503 - charging system output low may accompany the code P2509"],"causes":["The causes for this DTC may include:","Battery failure\nPoor connection at the batteries\nAlternator is either overcharging or undercharging\nLarge voltage drop through loose or corroded cables\nElectrical clutch fan short to ground\nBad connection at ECM\nLeaking diode\nBattery + positive shorted to ground or other circuits\nOpen or return ground circuit"]}