{"code":"P2563","description":"Turbo Boost Control Position Sensor Circuit Range/Performance","info":["This diagnostic trouble code (DTC) is a generic powertrain code, which means that it applies to OBD-II equipped vehicles that have a turbocharger (Ford, GMC, Chevrolet, Hyundai, Dodge, Toyota, etc.). Although generic, the specific repair steps may vary depending on make/model.","This trouble code can typically apply to all turbocharged OBDII equipped engines, but shows up more often in certain Hyundai and Kia vehicles. The Turbo Boost Control Position Sensor (TBCPS) converts the turbo boost pressure into an electrical signal for the Powertrain Control Module (PCM).","\n ","The Turbo Boost Control Position Sensor (TBCPS) provides additional turbo boost pressure information to the Powertrain Control Module or PCM. This information is typically used to fine-tune the amount of boost provided to the engine by the turbocharger.","The boost pressure sensor provides the PCM with the rest of the information needed for turbo boost pressure calculations. Anytime there is an electrical problem with the TBCPS, depending on how the manufacturer wants to identify the fault, the PCM will set code P2563. This code is considered to be an electrical circuit fault only.","It also looks at the voltage signal from the TBCPS sensor to determine if it is correct at initial Key On Engine Off. This code could have been set because of mechanical (typically exhaust back pressure / intake restrictions) or electrical (boost pressure sensor/boost control position sensor circuit) issues.","Troubleshooting steps may vary depending upon manufacturer, type of sensor and wire colors to the sensor.\n"],"symptoms":["Malfunction Indicator Light On\nPoor performance\nHesitation during acceleration\nDecrease in fuel economy"],"causes":["Potential causes for this code to set are:","Open in the signal circuit to the TBCPS sensor – most likely\nShort to voltage in the signal circuit to the TBCPS sensor\nShort to ground in the signal circuit to the TBCPS sensor\nOpen in power or ground at TBCPS sensor – most likely\nFailed TBCPS Sensor - possible\nFailed PCM - unlikely"]}