{"code":"P2588","description":"Turbo Boost Control Position Sensor \"B\" Circuit Low","info":["This diagnostic trouble code (DTC) is a generic powertrain code, which means that it applies to OBD-II equipped vehicles that have a turbocharger (Ford, GMC, Chevrolet, Hyundai, Dodge, Toyota, etc.). Although generic, the specific repair steps may vary depending on make/model.","This trouble code can typically apply to all turbocharged OBDII equipped engines, but shows up more often in certain Hyundai and Kia vehicles. The Turbo Boost Control Position Sensor (TBCPS) converts the turbo boost pressure into an electrical signal for the Powertrain Control Module (PCM).","\n ","The Turbo Boost Control Position Sensor (TBCPS) provides additional turbo boost pressure information to the Powertrain Control Module or PCM. This information is typically used to fine-tune the amount of boost provided to the engine by the turbocharger.","The boost pressure sensor provides the PCM with the rest of the information needed for turbo boost pressure calculations. Anytime the voltage on the TBCPS sensor signal wire goes below a set level (usually under 0.3V), the PCM will set code P2588. This code is considered to be an electrical circuit fault only.","Troubleshooting steps may vary depending upon manufacturer, type of sensor and wire colors to the sensor. Refer to a vehicle specific repair guide to determine which is the \"B\" sensor for your particular vehicle.","Related turbo boost control position sensor \"B\" circuit codes:","P2586 Turbocharger Boost Control Position Sensor \"B\" Circuit\nP2587 Turbocharger Boost Control Position Sensor \"B\" Circuit Range/Performance\nP2589 Turbocharger Boost Control Position Sensor \"B\" Circuit High\nP2590 Turbocharger Boost Control Position Sensor \"B\" Circuit Intermittent/Erratic\n"],"symptoms":["Malfunction Indicator Light On\nPoor performance\nHesitation during acceleration\nDecrease in fuel economy"],"causes":["Potential causes for this code to set are:","Short to ground in the signal circuit to the TBCPS sensor\nShort to ground in power circuit at TBCPS sensor- possible\nFailed TBCPS Sensor - possible\nFailed PCM - unlikely"]}