{"code":"P0805","description":"Clutch Position Sensor Circuit","info":["This is a generic powertrain diagnostic trouble code (DTC) and applies to many OBD-II vehicles (1996-newer). That may include but is not limited to vehicles from Dodge, Ford (Focus, Fiesta, etc), Smart, Land Rover, Chevrolet, Chrysler, Jeep, Mercedes, Toyota, etc. Although generic, the exact repair steps may vary depending on year, make, model and powertrain configuration.","\n ","OBD-II trouble code P0805 and related codes P0806, P0807, P0808, P0809, and P080A are associated with the clutch position sensor circuit. This circuit is monitored by the Power Control Module (PCM) or the Transmission Control Module (TCM) based on the specific vehicle.","The purpose of the clutch position sensor circuit is to monitor the status of the clutch on a manual transmission. This process is accomplished by reading the output voltage of the clutch position sensor that indicates when the clutch is engaged. The clutch position sensor is usually a basic on/off switch mounted near the clutch foot pedal on the support bracket in most circumstances. Constant voltage is typically present on one side of the switch and the contacts are closed by engaging the clutch transferring voltage to the starter or starter solenoid. This basic circuit and switch prevents starting the engine prior to engaging the clutch.","When the PCM or TCM detects improper voltage or resistance within the clutch position sensor circuit, code P0805 will be set and the check engine light or the transmission warning lamp will be illuminated.","A clutch position sensor:\n"],"symptoms":["Motor will not start\nMotor will start without engaging the clutch\nTransmission warning lamp illuminated\nCheck engine light illuminated"],"causes":["Defective clutch position sensor\nFaulty or damaged wiring\nLoose or defective control module ground strap\nCorroded, damaged or loose connector\nDefective fuse or fuse-able link (If applicable)\nDefective PCM or TCM"]}