{"code":"P0800","description":"Transfer Case Control System (MIL Request)","info":["This diagnostic trouble code (DTC) is a generic powertrain code and applies to many OBD-II vehicles (1996-newer). That may include but is not limited to vehicles from Ford, GMC, Chevrolet, Dodge, Subaru, BMW, etc. Although generic, the exact repair steps may vary depending on year, make, model and powertrain configuration.","\n ","If your vehicle has stored a code P0800, it means that the powertrain control module (PCM) has received a data input signal indicating that the transfer case control system (TCCS) has detected a malfunction which requires malfunction indicator lamp (MIL) illumination. This type of code is applicable to four-wheel or all-wheel drive vehicles only.","The TCCS and transmission control module (TCM) may be stand alone units but are most commonly integrated into a single housing with the engine control module (ECM). This is what is referred to as the PCM.","The PCM utilizes input signals from multiple engine, transmission, and transfer case sensors to calculate automatic transmission shift strategy. The transfer case bolts to the tailshaft housing of the transmission. It is responsible for transferring engine power to the rear differential and the front differential respectively. The transmission output shaft delivers power to the transfer case which can be manipulated to transfer power to either the front or rear driveshafts (or both).","The transfer case also contains a selection of gear ranges that typically include 2HI, 4HI, 4LO, and NEUTRAL. Like power distribution, the transfer case gear range may be selected at the press of a button and controlled electronically (via the TCCS/PCM). Other vehicles must be shifted manually. Vehicles with manually shifted transfer cases do not normally exhibit this type of code.","As with many other automatic transmission/transfer case malfunctions, a transfer case control code may be caused by electrical or mechanical failure. If the PCM detects that TCCS malfunction has occurred, a P0800 may be stored and a malfunction indicator lamp (MIL) will be illuminated.","A typical 4wd switch:\n"],"symptoms":["Cannot shift between 2WD and 4WD\nInability to switch between transfer case gear ranges\nFlashing or constantly illuminated 4WD indicator or traction control lamp\nUnusual noises from transfer case or driveshaft"],"causes":["Defective TCCS actuator or sensor\nInternal (mechanical) transfer case failure\nShorted or open circuits in TCCS\nFaulty PCM or a programming error"]}