{"code":"P0840","description":"Transmission Fluid Pressure Sensor / Switch \"A\" Circuit","info":["This generic powertrain/engine diagnostic trouble code typically applies to all OBD-II equipped vehicles including but not limited to Nissan, Dodge, Chrysler, Honda, Chevrolet, GMC, Toyota, etc. but seems to be most commonly seen on Nissan vehicles.","The Transmission Fluid Pressure Sensor/Switch (TFPS) is usually found attached to the side of the valve body inside the transmission, although sometimes it may be found screwed into the side of the transmission case/body itself.","\n ","The TFPS converts the mechanical transmission pressures into an electrical signal for the Powertrain Control Module (PCM) or Transmission Control Module (TCM). Typically, the PCM/TCM will then inform other controllers utilizing the vehicle's data communication bus.","The PCM/TCM receives this voltage signal to determine transmission operating pressure or when a shift is occurring. This code is set if this \"A\" input does not match normal operating voltages stored in the PCM/TCM's memory. It may also be due to internal mechanical issues inside the transmission. Refer to a vehicle specific repair manual to determine which is the \"A\" circuit for your particular vehicle.","P0840 is typically an electrical circuit (TFPS sensor circuit) issue, although as previously stated this code may also be set due to mechanical issues (internal leaks, cracked or missing check balls in the valve body, low system operating pressure/main line pressure, stuck valve in the valve body). This cannot be overlooked in the troubleshooting stage, especially when dealing with an intermittent problem.","Troubleshooting steps may vary depending upon manufacturer, type of TFPS sensor and wire colors.","Related trans fluid pressure sensor A circuit codes:","P0841 Transmission Fluid Pressure Sensor/Switch \"A\" Circuit Range/Performance\nP0842 Transmission Fluid Pressure Sensor/Switch \"A\" Circuit Low\nP0843 Transmission Fluid Pressure Sensor/Switch \"A\" Circuit High\nP0844 Transmission Fluid Pressure Sensor/Switch \"A\" Circuit Intermittent"],"symptoms":["Malfunction Indicator Light On\nChange in shift quality\nVehicle starts off in 2nd or 3rd gear (limp in mode)"],"causes":["Typically the causes for this code to set are:","Open in the signal circuit to the TFPS sensor - possible\nShort to voltage in the signal circuit to the TFPS sensor - possible\nShort to ground in the signal circuit to the TFPS sensor - possible\nFailed TFPS Sensor – likely Internal mechanical transmission issue - possible\nFailed PCM - unlikely (programming required after replacement)"]}