{"code":"P2005","description":"Intake Manifold Runner Control Stuck Open Bank 2","info":["This diagnostic trouble code (DTC) is a generic powertrain code, which means that it applies to all 1996-newer vehicles (Mazda, Ford, Dodge, Jeep, Kia, etc.). Although generic, the specific repair steps may vary depending on make/model.","A stored code P2005 in your OBD II equipped vehicle means that the powertrain control module (PCM) has detected that the intake manifold runner control (IMRC) actuator for engine bank 2 is stuck in the open position. Bank 2 denotes that the problem has occurred in the bank of the engine that does not contain cylinder #1.","\n ","The IMRC system is controlled by the PCM to manage and fine tune air flow as it enters the lower intake manifold, cylinder heads, and the combustion chambers. The runner control solenoid opens/closes metal flaps which fit snugly into the intake port of each cylinder. The runner flaps are bolted to a thin metal rod that runs the length of each cylinder head and through each intake port. All of the flaps can be opened at the same time and with one motion but this also means that all the flaps may be rendered inoperative if one of them is stuck or binding. The IMRC actuator is attached to the rod with a mechanical arm or a gear. Some models use a vacuum diaphragm operated actuator. An electronic solenoid (controlled by the PCM) regulates intake vacuum to the IMRC actuator in this type of system.","A swirling effect is created by channeling and restricting the air flow as it is drawn into the engine. Research shows that the swirling effect helps the air/fuel mixture to be atomized more completely. More thorough atomization helps to reduce exhaust emissions, improve fuel efficiency, and optimize engine performance. Automakers utilize different IMRC methods. Consult your vehicle information source (All Data DIY is a good one) for the specifics of the IMRC system with which the vehicle in question is equipped. Theoretically, the IMRC runners are partially closed during starting/idling conditions and opened fully when the throttle plate is opened.","To make sure that the IMRC actuator is functioning properly, the PCM monitors input signals from the IMRC runner position sensor, manifold absolute pressure (MAP) sensor, manifold air temperature sensor, intake air temperature sensor, throttle position sensor, the oxygen sensors, and mass airflow (MAF) sensor (among others).","As engine drivability data is input to the PCM, and calculated, the PCM monitors actual runner flap position and adjusts it accordingly. If the PCM doesn’t see a significant enough change in MAP or manifold air temperature, in accordance with desired repositioning of the flaps (by the IMRC actuator), a code P2005 will be stored and a malfunction indicator lamp may be illuminated. Multiple ignition cycles, with an IMRC actuator failure, will often be required for the MIL to be illuminated."],"symptoms":["Reduction in engine performance, especially at low RPM levels\nDiminished fuel efficiency\nEngine surge"],"causes":["Possible causes for this engine code include:","Defective bank 2 IMRC actuator solenoid\nLoose or binding intake manifold runners on bank 2\nBad bank 2 intake manifold runner position sensor\nOpen or shorted wiring in the bank 2 IMRC actuator solenoid control circuit\nFaulty MAP Sensor\nCorroded IMRC actuator solenoid connector face"]}