{"code":"P2001","description":"NOx Trap Efficiency Below Threshold Bank 2","info":["This diagnostic trouble code (DTC) is a generic powertrain code, which means that it applies to all 1996-newer vehicles (Nissan, Honda, Infiniti, Ford, Dodge, Acura, Toyota, etc.). Although generic, the specific repair steps may vary depending on make/model.","A stored P2001 means that the powertrain control module (PCM) has detected a level of nitric oxide (NOx) that is higher than a programmed limit. Bank 2 refers to the side of the engine which does not contain the #1 cylinder.","\n ","The internal combustion engine produces NOx as an exhaust emission. Catalytic converter systems that are used to reduce NOx in gas burning engines are less than effective in diesel engines. This is because of the higher oxygen content of spent exhaust gases in diesels. As a secondary method of NOx reduction, a NOx trap or NOx adsorption system must be used in diesel engines. Vehicles that are equipped with diesel engines utilize selective catalytic reduction (SCR) systems, of which the NOx trap is a part.","Zeolite is used to trap the NOx molecules to prevent them from being released into the atmosphere. A web of zeolite compounds is secured inside a housing that looks like a catalytic converter. Exhaust passes through the web and NOx is trapped inside.","To refresh the zeolite structure a combustible or flammable chemical is introduced through an electronically controlled injection system. Different chemicals have been used for this purpose but diesel fuel is the most practical.","In the SCR, NOx sensors are used the way oxygen sensors are used in gasoline engines but they have no effect on fuel delivery adaptation strategy. They monitor NOx particles instead of oxygen levels. The PCM monitors pre catalyst and post catalyst NOx sensor data to calculate NOx trap efficiency. This data is also used in NOx reductant fluid delivery strategy.","Reductant injection is accomplished with an injector that is electronically controlled by either the PCM or the SCR module. A remote reservoir contains NOx reductant fluid/diesel fuel; it resembles a small fuel tank. Reductant pressure is generated using an electronically controlled fuel pump.","If the PCM detects a level of NOx that is higher than a programmed limit on bank 2, a P2001 code will be stored and a malfunction indicator lamp may be illuminated."],"symptoms":["Excessive smoke from the engine exhaust\nReduced overall engine performance\nIncreased engine temperatures\nDiminished fuel efficiency"],"causes":["Possible causes for this engine code include:","A defective or overloaded NOx trap or NOx trap element\nFaulty diesel exhaust fluid injection system\nInadequate or improper NOx reductant fluid\nInoperable exhaust gas recirculation system\nSevere exhaust leak upstream of the NOx trap"]}