{"code":"P2008","description":"Intake Manifold Runner Control Circuit Open Bank 1","info":["The OBD trouble code P2008 is a generic powertrain code, which means that it applies to all 1996-newer vehicles (Ford, VW, Audi, GM, etc.).","Although generic, the engines differ between brands and may have slightly different causes for this code. Always refer to a vehicle specific service manual for the proper diagnostic sequence and reference numbers.","\n ","The code is referring to a fault that has occurred in a set of air control flaps inside the intake manifold. These flaps are designed to create a specified amount of turbulence within the manifold that is transformed into a 'swirling' effect.","By creating a swirling of the intake air, the pulsations created by the intake valve opening and closing is nullified and the quality of the air fuel mixture is improved. Low end torque is improved and the formation of Nox is reduced as well with the use of these flaps.","The electronic control module (ECM) controls the position of the swirl flaps with the use of an intake manifold runner control solenoid valve after referencing the signals from the mass air flow sensor (MAF) and the barometric pressure sensor. When the ECM determines where to position the swirl flaps, it uses 'pulse width modulation' to control the intake runner control solenoid.","There are several possible reasons for this fault to occur, however, the swirl flaps themselves cause the most concern. The reason is that they are inside the intake manifold. Should they be the problem and fail, parts will fall and be ingested into the engine. That is a recipe for a bad day.","Once it's been determined that they are not the problem, the stress level drops. Certain vehicles were notorious for swirl flap failure where the screws retaining the flaps would fall out if the flap failed. The screws entered the engines and caused major engine damage. This engine code is identical to P2011 but that code is for Bank 2, and this DTC is for Bank 1. Bank 1 is the side of the engine that contains cylinder #1."],"symptoms":["The engine may have a rougher than normal idle\nAt times the engine may exhibit a tendency to surge\nThere may be a slight reduction in low-end torque\nThe trouble code P2008 will be displayed","This is a 'soft' code, meaning the check engine light may blink on and off only when the ECM sees the fault. If the fault corrects itself the light will go off. Hard codes will remain once observed until erased."],"causes":["The causes for this DTC may include:","Over the years I have found that the intake runner control solenoid is largely the problem. They are almost always situated where they are subjected to heat and dirt that fouls the filter causing them to fail. Secondly, the swirl flaps themselves become covered with soot from the EGR valve, and they lock in their current position.\nThe MAF sensor or the EGR have the ability to set this code if they fail, however, they will set a code of their own to coincide with the P2008 code. In this case they would be diagnosed and repaired first and the codes erased\nThe intake manifold runner control solenoid\nThe swirl flaps are contaminated\nBroken vacuum lines\nPoor electrical connection\nOpen or short in the wiring harness"]}