{"code":"P200A","description":"Intake Manifold Runner Performance Bank 1","info":["This is a generic diagnostic trouble code (DTC) and applies to many OBD-II vehicles (1996-newer). That may include but is not limited to vehicles from Hyundai, Kia, Mercedes Benz, Sprinter, Vauxhall, etc. Although generic, the exact repair steps may vary depending on year, make, model and powertrain configuration.","\n ","If your OBD II equipped vehicle has stored a code P200A, it means that the powertrain control module (PCM) has detected a problem with the intake manifold runner control (IMRC) system. Code P200A applies explicitly to the bank of the engine that contains the number one cylinder.","The IMRC system is designed to regulate and reconfigure intake air as it enters the engine. At lower engine RPM levels, airflow is restricted in order to reduce exhaust emissions. At higher engine RPM levels, a swirling effect is created by the IMRC flaps. This helps to optimize fuel atomization and maximize engine performance.","Typically, the IMRC system is composed of a series of metal flaps that are attached to a pivot rod which runs through the intake ports for each cylinder. Usually, all the flaps on one bank of the engine move in unison because they are all attached to a singular pivot rod; controlled by the same actuator. Each bank of the engine is outfitted with its own pivot rod, flaps, actuator, etc. which function independently of the other engine banks.","The PCM uses input data from numerous engine sensors to determine the desired degree at which IMRC system components should be implored. Once the PCM has applied the appropriate amount of voltage (to the correct circuit) for the desired IMRC adjustment, engine sensor data is monitored to see if the intended effect is realized.","If the PCM detects that the IMRC system cannot be controlled effectively, a code P200A will be stored and a malfunction indicator lamp may be illuminated."],"symptoms":["Diminished fuel efficiency\nReduced engine performance\nLean or rich exhaust codes are stored\nHesitation upon acceleration\nStumble at idle"],"causes":["Broken or worn IMRC linkage or bushings\nDefective IMRC actuator\nBroken or collapsed IMRC vacuum lines\nFaulty IMRC vacuum supply actuator\nOpen or shorted IMRC circuits or connectors\nBad IMRC sensor or other engine sensor/s"]}