{"code":"P200C","description":"Diesel Particulate Filter Over Temperature Bank 1","info":["This diagnostic trouble code (DTC) is a generic powertrain code and applies to many OBD-II vehicles (1996-newer). That may include but is not limited to vehicles from Ford, Hino, Mercedes Benz, VW, etc. Although generic, the exact repair steps may vary depending on year, make, model and powertrain configuration.","\n ","If your diesel powered, OBD-II equipped vehicle has stored a code P200C, it means that the powertrain control module (PCM) has detected an excessive degree of diesel particulate filter temperature for engine bank one. Bank 1 is the bank of the engine that contains the number one cylinder.","The diesel particulate filter, as it pertains to a modern clean burning diesel powered vehicle, is designed to reduce harmful exhaust emissions before they can be released into the atmosphere. Exhaust emissions consist mainly of hydrocarbons (HC), carbon monoxide (CO), nitrogen oxide (NOx), and particulate matter (soot - in diesel applications). The diesel particulate filter is basically a large (fine mesh) filter that is capable of withstanding extreme temperature. Engine exhaust flows through and harmful emissions are trapped within a platinum filtration element. The extreme temperatures generated inside the diesel particulate filter help to burn harmful emissions elements.","The primary responsibility of the diesel particulate filter is the reduction of soot from diesel engine exhaust. If you have noticed that modern diesel engines run cleaner and with less black smoke than diesels from a few decades ago; it is due to the implementation of the diesel particulate filter in the exhaust system.","Exhaust gas recirculation (EGR) systems go another step further in the reduction of NOx. Nevertheless, today’s larger and more powerful diesel engines cannot meet strict federal (U.S.) emission standards with the EGR, diesel particulate filter, and NOx trap alone. It was for this reason that selective catalytic reduction (SCR) systems were invented.","SCR systems inject diesel exhaust fluid (DEF) into the exhaust in front of the diesel particulate filter and/or the catalytic converter. The precisely timed DEF injection elevates the temperature of the filtration element and allows it to perform more efficiently. It makes the filtration element last longer and allows fewer harmful exhaust emissions to be released into the atmosphere.","Exhaust temperature sensors are placed before and after the diesel particulate filter to monitor its temperature and efficiency. The entire SCS system is monitored and controlled by either the PCM or a stand-alone controller (which interacts with the PCM). Either way, the controller monitors the O2, NOx, and exhaust temperature sensors (as well as other inputs) to determine the appropriate time for DEF injection. Precise DEF injection is necessary to maintain exhaust temperature within acceptable parameters and optimize pollutant filtration.","If the PCM detects excessive diesel particulate filter temperature (for engine bank one), a code P200C will be stored and a malfunction indicator lamp may be illuminated.","A cutaway of a typical diesel particulate filter:\n"],"symptoms":["Diminished engine performance\nExcessive black smoke from vehicle exhaust\nReduction in fuel efficiency\nOther emission related codes"],"causes":["Inoperative SCR system\nFaulty SCR injector\nIncorrect or insufficient DEF fluid\nDefective exhaust temperature sensor\nBad SCR controller or programming error\nPre-catalyst exhaust leaks\nInstallation of aftermarket or high-performance exhaust components"]}