{"code":"P2002","description":"Diesel Particulate Filter Efficiency Below Threshold Bank 1","info":["This diagnostic trouble code (DTC) is a generic powertrain code. It is considered generic because it applies to all makes and models of vehicles (1996-newer), although specific repair steps may be slightly different depending on the model.","The trouble code \"P2002 diesel particulate filter efficiency below threshold\" relates to an emissions control device. Installed on 2007 and later diesels, it eliminates the soot emitted from their exhaust. You will most likely see this DTC in a Dodge, Ford, Chevrolet, or GMC diesel pickup, but it can also be triggered on other diesel cars such as VW, Vauxhall, Audi, Lexus, etc.","The DPF - diesel particulate filter - is in the shape of a catalytic converter and positioned in the exhaust system. Inside is a matrix of compounds coating the passages such as cordierite, silicon carbide and metal fibers. It's 98% effective at eliminating soot.","Cutaway photo of a diesel particulate filter (DPF):\n","The DPF creates a slight back pressure in operation. The vehicle's ECU -- computer -- has pressure -feedback sensors on the DPF to monitor its functionality. If for some reason - for two running cycles - it senses a discrepancy in the pressure limits, it will set the code P2002 indicating a malfunction.","Not to be to concerned, these devices have a regenerative capability to burn off the buildup of soot and return to full service. They last a long time.","Once this occurs the light will go out and the code will clear itself. This is why it's called a soft code -- it indicates a fault in \"real time\" and erases as the fault corrects itself. A hard code remains until the repair is completed and the code erased manually with a scanner.","All vehicles need a device to eliminate oxides of nitrogen expulsion into the atmosphere, which wouldn't be there otherwise, and its harmful to your health as well as the atmosphere. A catalytic converter solves emissions on gasoline engines. Diesels on the other hand, are more problematic.","Relying on the heat of super compressed fuel for spontaneous combustion, their cylinder head temperatures are very high creating a serious breeding ground for oxides of nitrogen. NOx is produced under extremely high temperatures. The engineers knew that they needed to use EGR -- exhaust gas recirculation - to dilute the incoming fuel charge to reduce the head temperatures and reduce the Nox. Problem was, the exhaust temperatures on a diesel are to high and would simply compound the problem.","They corrected this by using engine coolant to cool the engine oil and EGR pipe to reduce cylinder head temperatures below that necessary for the formation of Nox. This worked quite well. The DPF is the last line of defense against emissions by eliminating the soot.","NOTE: This P2002 DTC is the same as P2003, however the P2002 refers to bank 1, which is the side of the engine that contains cylinder #1."],"symptoms":["A drop in fuel economy occurs as the engine management system attempts to increase the temperature of the exhaust to burn off the excess soot in the DPF\nThe check engine light will be on with the code \"P2002.\" The light may stay on or light intermittently as the DPF regenerates. The engine will be sluggish on acceleration.\nThe engine oil will exhibit dilution from the ECUs attempts to increase engine temperature. Some vehicles advance the fuel injection timing slightly after top center to afterburn a small amount of fuel to increase exhaust temperatures. Some of this fuel enters the crankcase. When the ECU determines the necessity to regenerate the DPF, the service life of the oil be shortened significantly\nIf the DPF is not cleared the ECU will revert to the \"Limp Home Mode\" until the situation is corrected"],"causes":["The causes for this DTC may include:","Too much slow speed operation will cause this code. It takes heat in the 500c to 600c range to burn off the soot in the DPF. Even with the ECUs efforts in engine management, it has difficulty in creating enough heat to clear the DPF at slow engine speeds\nAn air leak forward of the DPF will change the sensor readings resulting in the code\nDefective ECU strategies or components will prevent proper regeneration\nFuel with a large percentage of sulfur will clog the DPF quickly\nSome aftermarket accessories and performance modifications\nDirty air cleaner element\nDamaged DPF"]}