{"code":"P2012","description":"Intake Manifold Runner Control Circuit Low Bank 2","info":["This diagnostic trouble code (DTC) is a generic powertrain code, which means that it applies to all 1996-newer vehicles (Nissan, Honda, Infiniti, Ford, Dodge, Acura, Toyota, etc.). Although generic, the specific repair steps may vary depending on make/model.","I know from experience that a stored code P2012, means that the powertrain control module (PCM) has detected an intake manifold air control (IMRC) actuator circuit voltage (for engine bank 2) that is lower than expected. Bank 2 points me to a malfunction that is related to the bank of the engine that does not contain the number one cylinder.","\n ","The IMRC system is electronically controlled by the PCM. It is used to manage and fine tune air as it flows into the lower intake manifold, cylinder heads, and the combustion chambers. Specially shaped metal flaps, which fit tightly into the intake manifold port of each cylinder, are opened and closed by an electronic runner control actuator. The thin metal runner flaps are secured (with small bolts or rivets) to a metal rod that extends the length of each cylinder head and passes through the center of each intake port. The flaps are opened with one motion, permitting all of the flaps to be rendered inoperative if one of them is stuck or binding. A mechanical arm or gear usually secures the IMRC actuator to the rod. Some models use a vacuum diaphragm to operate the actuator. The PCM controls an electronic solenoid, which regulates intake vacuum to the IMRC actuator, when a vacuum operated actuator is utilized.","Research has shown us that a swirling (air flow) effect helps the air/fuel mixture to be atomized more completely. More thorough atomization helps to decrease exhaust emissions, improve fuel efficiency, and optimize engine performance.","Channeling and restricting the air flow, as it is drawn into the engine, creates this swirling effect but different manufacturers use varying IMRC methods. Consult your vehicle information source (All Data DIY is an excellent resource) for the particulars of the IMRC system with which the vehicle in question is outfitted. Typically, the IMRC runners are nearly closed during starting/idling conditions and opened most of the way when the throttle plate is opened.","In order to ensure that the IMRC system is operating as designed, the PCM monitors input data signals from the IMRC runner position sensor, manifold absolute pressure (MAP) sensor, manifold air temperature sensor, intake air temperature sensor, throttle position sensor, the oxygen sensors, and the mass airflow (MAF) sensor (among others).","The PCM monitors actual runner flap position and adjusts it according to engine drivability data. A malfunction indicator lamp may be illuminated, and a code P2012 will be stored, if the PCM doesn’t see a significant change in MAP or manifold air temperature as expected. In some cases, multiple failure cycles will be required for MIL illumination."],"symptoms":["Hesitation upon acceleration\nReduction in engine performance, especially at low RPM levels\nRich or lean exhaust\nDiminished fuel efficiency\nEngine surge"],"causes":["Possible causes for this engine code include:","Loose or binding intake manifold runners bank 2\nDefective IMRC actuator solenoid bank 2\nBad intake manifold runner position sensor bank 2\nOpen or shorted wiring in the IMRC actuator solenoid control circuit\nCarbon buildup on the IMRC flaps or intake manifold ports\nFaulty MAP Sensor\nCorroded IMRC actuator solenoid connector face"]}