{"code":"P2013","description":"Intake Manifold Runner Control Circuit High Bank 2","info":["This diagnostic trouble code (DTC) is a generic powertrain code, which means that it applies to all 1996-newer vehicles (Nissan, Honda, Infiniti, Ford, Dodge, Acura, Toyota, etc.). Although generic, the specific repair steps may vary depending on make/model.","When I encounter a stored code P2013, I know it means that the powertrain control module (PCM) has detected an intake manifold runner control (IMRC) actuator circuit voltage (for engine bank 2) that is greater than expected. Bank 2 tells me that the malfunction is associated with the bank of the engine that does not contain the #1 cylinder.","\n ","The PCM controls the IMRC system, electronically. The IMRC system is used to manage and fine tune air as it flows into the lower intake manifold, cylinder heads, and the combustion chambers. Individually shaped metal flaps, which fit tightly into the intake manifold ports of each cylinder, are opened and closed by an electronic runner control actuator. In the IMRC, thin metal runner flaps are secured (with small bolts or rivets) to a metal rod that extends the length of each cylinder head and passes through the center of each intake port. The flaps are opened with one motion, which also allows all of the flaps to be rendered inoperative if one of them is stuck or binding. The IMRC rod is connected to the actuator with a mechanical arm or gear. The actuator is maneuvered using a vacuum diaphragm on some models. When a vacuum operated actuator is utilized, the PCM controls an electronic solenoid, which regulates intake vacuum to the IMRC actuator.","It has been established that a swirling (air flow) effect helps the air/fuel mixture to be atomized more completely. This can lead to a decrease in exhaust emissions, improved fuel efficiency, and optimized engine performance. Using the IMRC to channel and restrict air flow, as it is drawn into the engine, creates this swirling effect but different manufacturers use varying methods. Use your vehicle information source (All Data DIY is an excellent resource) to obtain specifications for the IMRC system with which the vehicle in question is equipped. In theory, the IMRC runners will be nearly closed during starting/idling conditions and opened when the throttle plate is opened.","The PCM monitors input data signals from the IMRC runner position sensor, manifold absolute pressure (MAP) sensor, manifold air temperature sensor, intake air temperature sensor, throttle position sensor, the oxygen sensors, and mass airflow (MAF) sensor (among others) to ensure that the IMRC system is operating as anticipated.","IMRC runner flap position is monitored by the PCM, which adjusts flap position according to engine drivability data. A malfunction indicator lamp may be illuminated, and a code P2013 will be stored, if the PCM fails to see a change in MAP or manifold air temperature as expected, when the bank 2 IMRC flaps are moved. Some vehicles will require multiple failure cycles for MIL illumination."],"symptoms":["Hesitation upon acceleration\nReduction in engine performance, especially at low RPM levels\nRich or lean exhaust\nDiminished fuel efficiency\nEngine surge"],"causes":["Possible causes for this engine code include:","Loose or binding intake manifold runners bank 2\nDefective IMRC actuator solenoid bank 2\nBad intake manifold runner position sensor bank 2\nOpen or shorted wiring in the IMRC actuator solenoid control circuit\nCarbon buildup on the IMRC flaps or intake manifold ports bank 2\nFaulty MAP Sensor\nCorroded IMRC actuator solenoid connector face"]}