{"code":"P2030","description":"Fuel Fired Heater Performance","info":["This diagnostic trouble code (DTC) is a generic powertrain code and applies to many OBD-II vehicles (1996-newer). That may include but is not limited to vehicles from Mercedes-Benz, Land Rover, Opel, Toyota, Volvo, Jaguar, etc. Although generic, the exact repair steps may vary depending on year, make, model and powertrain configuration.","\n ","If your vehicle has stored a code P2030, it means that the powertrain control module (PCM) has detected a malfunction in the auxiliary or fuel fired heater system. This type of code is applicable to vehicles with fuel fired heater systems only.","Creating cabin heat in vehicles with modern, clean-burning diesel engines can be challenging especially in geographic areas with extremely cold ambient temperatures. Due to the overall mass of the diesel engine, heating the engine enough for the thermostat to open (particularly at idle) may be impossible when temperatures plummet. This can create a problem inside the passenger compartment if warm coolant fails to flow into the heater core. In order to correct this condition, some vehicles utilize a fuel fired heater system. Typically, a small, pressurized fuel reservoir supplies an enclosed burner with a precisely regulated amount of fuel whenever ambient temperature falls below a certain level. The fuel fired heater injector and igniter may be automatically activated or manually activated by vehicle occupants. Coolant flows through the inline burner, where it is heated, and continues to the passenger compartment. This allows the windshield and other components to be defrosted before the vehicle is put in motion and before the engine reaches normal operating temperature.","Most often, coolant temperature sensors are used to determine heater temperature but some models also use air temperature sensors. The PCM monitors the temperature sensors to ensure that the fuel fired heater is functioning properly.","If the PCM does not detect an appropriate degree of temperature differential between coolant entering the fuel fired heater and coolant exiting the fuel fired heater, a code P2030 may be stored and a malfunction indicator lamp (MIL) illuminated. Multiple ignition cycles (with a failure) may be required for MIL illumination."],"symptoms":["No heat in passenger compartment\nExcessive heat in passenger compartment\nClimate control blower may be temporarily disabled\nNo symptoms may be exhibited"],"causes":["Defective temperature sensor (air or coolant)\nBad fuel fired heater injector\nFaulty fuel fired heater burner/igniter\nShorted or open wiring or connectors in fuel fired heater circuit\nFaulty PCM or a programming error"]}