{"code":"P2036","description":"Exhaust Gas Temperature EGT Sensor Circuit High Bank 2 Sensor 2","info":["This is a generic powertrain code, which means it covers all makes/models, 1996-newer. However, specific troubleshooting steps will vary depending on the vehicle.","This diagnostic trouble code (DTC) P2036 refers to the condition of the EGT (exhaust gas temperature) sensor located in the \"up\" pipe forward of the catalytic converter. Its sole purpose in life is to protect the converter from damage due to excessive heat. This code means that the circuit has a high voltage condition.","\n ","Code P2035 is a similar code which states that the circuit shows \"low\" voltage. Both relate to the condition of the sensor and the correction is the same for both. This P2036 DTC refers to Bank #2 (which is the side of the engine that does not contains cylinder #1). The DTC P2033 is basically identical, however it is for bank 1.","An EGT sensor is found on most late model gas or diesel engines. It's nothing more than a heat sensitive resistor that converts the temperature of the exhaust into a voltage signal to the computer. It receives a 5-volt signal from the computer through one wire while the second wire is ground.","The higher the exhaust temperature the less resistance to ground resulting in a higher voltage -- conversely, the lower the temperature the more the resistance resulting in lower voltage. If the engine senses a high voltage, the computer will vary the engine's timing or fuel ratio to keep the temperature in acceptable ranges within the converter.","Example of an EGT exhaust temperature sensor:\n","In a diesel, the EGT is used to determine the timing of regeneration of the PDF (diesel particulate filter) based on the temperature rise.","If a catless up pipe has been installed along with the removal of the catalytic converter, there is normally no provision for the EGT, or if there is it won't function correctly without the back pressure. This will set the code."],"symptoms":["The check engine light will illuminate and the computer will have set the code P2036. No other symptoms will be readily recognizable."],"causes":["The causes for this DTC may include:","Check for loose or corroded connectors or terminals, which is often the case\nBroken wires or missing insulation may be causing a short directly to ground\nThe sensor may have failed\nA catback exhaust system without EGT provisions installed\nIt's possible, although not probable, that the computer has failed"]}