{"code":"P205F","description":"Reductant System Performance Bank 2","info":["This diagnostic trouble code (DTC) is a generic powertrain code and applies to many OBD-II vehicles (1996-newer). That may include but is not limited to vehicles from GMC, Chevrolet, Sprinter, Ford, BMW, Volkswagen, etc. Although generic, the exact repair steps may vary depending on year, make, model and powertrain configuration.","\n ","When a code P205F is stored, it means that the powertrain control module (PCM) has detected a malfunction in the reductant portion of the selective catalyst reduction (SCR) system. Bank 2 denotes the bank of the engine that doesn't contain the number one cylinder.","The catalyst system is responsible for the reduction of harmful exhaust emissions. Today’s clean-burning diesel engines require more than mere particulate filtration. It was for this reason that SCR systems were invented.","Modern SCR systems inject a reductant compound or a diesel exhaust fluid (DEF) into the exhaust in front of the diesel particulate filter, NOx trap, and/or the catalytic converter via the reductant injection valve (solenoid). The precisely timed DEF injection elevates the temperature of the filtration element and allows it to perform more efficiently. It enhances filtration element longevity and allows fewer harmful exhaust emissions to be released into the atmosphere. The entire SCR system is monitored and controlled by either the PCM or a stand-alone controller (which interacts with the PCM). Either way, the controller monitors the O2, NOx, and exhaust temperature sensors (as well as other inputs) to determine the appropriate time for DEF (reductant) injection. Precise DEF injection is necessary to maintain exhaust temperature within acceptable parameters and optimize pollutant filtration.","The reductant/regeneration supply pump is used to pressurize the DEF in the liquid reductant system for use, when required. Supply pump voltage is monitored by the PCM for consistent fluctuation and load percentage. The PCM also monitors one or more pressure sensors in the reductant supply system to determine if there is a leak in the system.","If the PCM detects that the reductant system for engine bank one is not performing as intended, a code P205F will be stored and a malfunction indicator lamp (MIL) may be illuminated. Multiple ignition cycles (with a failure) may be required for MIL illumination."],"symptoms":["Reduction in fuel efficiency\nExcessive black smoke from vehicle exhaust\nDiminished engine performance\nOther SCR related codes"],"causes":["Defective reductant pressure sensor\nFaulty reductant system injector\nIncorrect or otherwise inadequate DEF\nOpen or shorted circuits in the reductant system\nBad SCR controller/PCM or programming error"]}