{"code":"P2067","description":"Fuel Level Sensor \"B\" Circuit Low Input","info":["This generic powertrain/engine diagnostic trouble code typically applies to all OBDII equipped engines, but shows up more often in certain Chrysler, GM, Ford, Lincoln, Mercury, Honda/Acura, Kia, Mazda, Mercedes Benz, Mitsubishi, Infiniti, Nissan and Subaru vehicles.","The Fuel Level Sensor (FLS) is usually found mounted in the fuel tank, usually in the top of the fuel tank / fuel pump module. The FLS converts the mechanical fuel level into an electrical signal for the Powertrain Control Module (PCM). Typically, the PCM will then inform other controllers utilizing the vehicle’s data communication bus.","\n ","The PCM receives this voltage signal to determine how much fuel it has in the fuel tank, monitoring fuel usage and thereby determining fuel economy. This code is set if this input does not match normal operating voltages stored in the PCM’s memory. It also looks at the voltage signal from the FLS sensor to determine if it is correct at initial Key On.","P2067 is typically set because of electrical (FLS sensor circuit) issues. These cannot be overlooked in the troubleshooting stage, especially when dealing with an intermittent problem.","Troubleshooting steps may vary depending upon manufacturer, type of FLS sensor and wire colors. Refer to a vehicle specific repair manual to determine the location of the \"B\" circuit.","Related fuel level sensor B circuit trouble codes include:","P2065 Fuel Level Sensor \"B\" Circuit Malfunction\nP2066 Fuel Level Sensor \"B\" Circuit Range/Performance\nP2068 Fuel Level Sensor \"B\" Circuit High Input\nP2069 Fuel Level Sensor \"B\" Circuit Intermittent"],"symptoms":["Malfunction Indicator Lamp (MIL) illuminated\nDecrease in perceived fuel economy\nDecrease in Distance to Empty mileage\nIncorrect fuel level on gauge in instrument cluster – always reads wrong"],"causes":["Typically the causes for this code to set are:","Short to ground in the signal circuit to the FLS sensor- possible\nFailed FLS Sensor / internally shorted - likely\nFailed PCM - unlikely"]}