{"code":"P2071","description":"Intake Manifold Tuning (IMT) Valve Stuck Closed Bank 1","info":["This diagnostic trouble code (DTC) is a generic powertrain code and applies to many OBD-II vehicles (1996-newer). That may include but is not limited to vehicles from Mercedes Benz, Audi, Chevrolet, GMC, Sprinter, Land Rover, etc. Although generic, the exact repair steps may vary depending on year, make, model and powertrain configuration.","\n ","A stored code P2071 means that the powertrain control module (PCM) has detected an intake manifold tuning (IMT) valve that is stuck closed for engine bank two. Bank 1 refers to the bank of the engine which contains the number one cylinder.","Intake manifold tuning is used to restrict and control intake air as it enters individual manifold ports. Not only is the volume of intake air regulated by the IMT, a swirling motion is also created. These two factors aid in more effective fuel atomization. Each intake manifold port is outfitted with a metal flap; not unlike the throttle plate. A single shaft runs from one end of the manifold (per engine bank) to the other and through the middle of each port. The metal flaps are attached to the shaft which will be turned (slightly) to effect opening and closing of the flaps.","The IMT shaft is actuated by the PCM. Some systems use an electronic over vacuum system of actuators (valves). Other systems use an electronic motor to effect flap movement. The PCM sends the appropriate voltage signal and the IMT valve opens and closes the valve/s to the desired degree. The PCM monitors actual valve position to determine if the system is functioning as intended.","If the PCM detects that the IMT valve is stuck closed, a code P2071 will be stored and a malfunction indicator lamp (MIL) illuminated. MIL illumination may require multiple ignition cycles with a failure.","An example of an intake manifold tuning (IMT) valve:\n"],"symptoms":["Diminished fuel efficiency\nReduced engine performance\nLean or rich exhaust codes\nNo symptoms at all may be exhibited"],"causes":["Binding or loose IMT flaps\nDefective IMT actuator (valve)\nVacuum leak\nOpen or shorted wiring or connectors\nFaulty PCM or a PCM programming error"]}