{"code":"P2099","description":"Post Catalyst Fuel Trim System Too Rich Bank 2","info":["This diagnostic trouble code (DTC) is a generic powertrain code, which means that it applies to all 1996-newer vehicles (Ford, Dodge, GMC, Chevrolet, Mercedes, VW, etc.). Although generic, the specific repair steps may vary depending on make/model.","Anytime that I come across a trouble code P2099, I know means that the powertrain control module (PCM) has detected a signal voltage input from the downstream (post catalyst) oxygen (O2) sensor for engine bank one that indicates the oxygen particle content is too low. Bank 2 is the engine bank that does not contain the #1 cylinder.","\n ","The O2 sensor consists of a zirconium dioxide sensing element enclosed within a vented steel housing. Platinum electrodes are used to connect the sensing element to wire leads in the O2 sensor wiring harness. The O2 sensor wiring harness is connected to the PCM via the controller area network. The O2 sensor provides the PCM with real-time data pertaining to the percentage of oxygen particles in the engine exhaust as compared to the oxygen content of ambient air.","Spent engine exhaust gases are pushed through the exhaust manifold, into the exhaust pipe, and through the catalytic converter. Afterward, they pass over the downstream O2 sensor. Exhaust gases flow through vent holes in the steel housing and across the sensing element. Outside air is drawn into a chamber in the middle of the sensor, through the wire lead cavities. In the chamber, ambient air is heated, forcing the oxygen ions to produce (energy) voltage. Variations between the concentration of oxygen molecules in ambient air (drawn into the O2 sensor) and the concentration of oxygen ions in the exhaust cause the voltage to fluctuate. These fluctuations cause the oxygen ions inside the O2 sensor to bounce from one platinum layer to the other, very rapidly and repeatedly.","Changes in voltage occur as the surging oxygen ions move between platinum layers. The PCM recognizes these changes in voltage as variations in exhaust oxygen concentration. These variations reflect whether the engine is running lean (too little fuel) or rich (too much fuel). The voltage signal output from the O2 sensor is lower when more oxygen is present in the exhaust (lean condition). The voltage signal output is higher when less oxygen is present in the exhaust (rich condition). This data is used by the PCM to calculate fuel delivery strategy and ignition timing, among other things.","Once the PCM enters closed loop operation, if the bank 2 downstream O2 sensor circuit input readings reflect too few oxygen molecules in the exhaust, a P2099 code will be stored and a malfunction indicator lamp may be illuminated.\n"],"symptoms":["Decreased fuel efficiency\nA lack of general engine performance\nOther related diagnostic trouble codes may be stored\nService engine soon lamp illumination"],"causes":["Possible causes for this engine code include:","Faulty bank 2 catalytic converter\nA faulty mass air flow or manifold air pressure sensor\nDefective bank 2 O2 sensor/s\nBurnt, chafed, broken, or disconnected wiring and/or connectors\nEngine exhaust leaks"]}