{"code":"P2098","description":"Post Catalyst Fuel Trim System Too Lean Bank 2","info":["This is a generic powertrain code, which means it covers all makes/models, 1996-newer. However, specific troubleshooting steps will vary depending on the vehicle.","The code P2098, post catalyst fuel trim system too lean on bank 2 simply translates to a lean (too much air and not enough fuel) condition the PCM recognized through the signals from the oxygen sensors. Bank 2 refers to the side of the engine that does not contain cylinder #1.","\n ","A series of oxygen sensors in the exhaust system signal the fuel mixture ratio at all times. Each exhaust system with a catalytic converter will have two sensors -- one between the engine and the converter and one after the converter.","Oxygen sensors signal the engine management computer the amount of oxygen present in the exhaust, which is used in determining and controlling the fuel ratio. The higher the oxygen content the leaner the fuel mixture, conversely the opposite is a rich mixture. It does so in a series of pulses called \"cross counts.\" There is zirconium on the tip of the sensor that reacts to oxygen in a way that when hot, creates its own voltage. It must be around 250 degrees F to operate and will produce up to 0.8 volts.","In operation the oxygen sensor will cycle once every second and send a voltage to the computer that ranges from 0.2 rich to 0.8 for a rich mixture. The perfect mixture will average the signals around 0.45 volts. The computer's target fuel/air ratio is 14.7:1. An oxygen sensor will not function at low temperatures such as start up -- for this reason most forward sensors have a pre-heater to reduce their warm up time.","The mission of the oxygen sensors are twofold -- to indicate the unburned oxygen in the exhaust and secondly, to indicate the proficiency of the catalytic converter. The engine-side sensor signals the mixture entering the converter and the rear sensor signals the mixture exiting the converter.","When the sensors and converter are operating properly, the front sensor will have a higher count than the rear sensor indicating a functioning converter. When the front and rear sensor agree, the front oxygen sensor has failed, the converter is plugged or another component is causing the oxygen sensor to give an erroneous signal.","This code may and may not be noticeable less for the check engine light. It depends on the cause, however, there isn't anything that can fail on a vehicle without adversely effecting something else. Trace the problem to correct the code as soon as possible to avoid damage to any other components."],"symptoms":["The symptoms of a P2098 code will vary depending on the component or system causing the disruption in the fuel trim. Not all will be present simultaneously.","Malfunction Indicator Lamp (MIL) illumination with P2098 DTC set\nRough idle\nPoor fuel economy\nPoor acceleration\nMisfire\nCherry red hot catalytic converter\nPossible spark knock (detonation / pre-ignition)\nAdditional codes associated with the P2098"],"causes":["The causes for this DTC may include:","Low fuel pressure caused by a clogged filter, failing fuel pump, failed fuel pressure regulator or clogged or leaking injectors.\nRough running engine due to misfiring plugs. Many engines have misfire codes to indicate the cylinder effected, such as P0307 for number 7.\nA large vacuum leak would cause a massive amount of un-metered air to enter the intake manifold resulting in an overly lean mixture.\nA large air leak at or near the number one oxygen sensor would also cause a lean mixture.\nA plugged converter will cause of host of driveability problems as well as set this code. A severely plugged converter will result in the inability to increase rpm when under load. Look for a code such as P0421 -- catalytic converter efficiency below threshold if the converter indicating a faulty converter.\nA faulty oxygen sensor. This will set a code in itself, however, a faulty oxygen sensor does not automatically condemn the sensor. The code just means that the sensor signal was not within specifications. An air leak or any of the above will cause an erroneous signal. There is a multitude of O2 codes relating to O2 performance which gives a clue to the problematic area.\nThe Mass Airflow sensor will also cause this problem. It would be accompanied by a code such as P0100 -- Mass Airflow circuit malfunction. The Mass Airflow sensor is a hot wire that senses the volume of air entering the intake manifold. The computer uses this information to control fuel mixture.\nRusty exhaust systems, cracked exhaust manifolds or damaged or missing gaskets or donuts will cause air leaks.","To make a point as to the cause and effect on vehicles, consider this scenario. A simple air leak forward of the number one oxygen sensor will add additional air to the mixture un-metered by the computer. The oxygen sensor signals a lean mixture due to the un-metered air.","Immediately the computer enriches the mixture to prevent a lean mixture from causing damage due to detonation among other factors. The unnecessarily rich mixture begins to foul the plugs, contaminate the oil, heats up the converter and drops the fuel economy. These are only a few of the things that transpire under these circumstances."]}