{"code":"P2091","description":"B Camshaft Position Actuator Control Circuit High Bank 1","info":["This is a generic powertrain diagnostic trouble code (DTC) and applies to many OBD-II vehicles (1996-newer). That may include but is not limited to vehicles from Subaru, Cadillac, Dodge, Mazda, Audi, Mercedes, etc. Although generic, the exact repair steps may vary depending on year, make, model and powertrain configuration.","\n ","OBD-II diagnostic code P2091 is associated with the B camshaft position actuator control circuit on bank 1. When the Engine Control Unit (ECU) detects improper signals within the B camshaft position actuator control circuit code, P2091 will be set and the check engine light will be illuminated. Some vehicles may require multiple failure cycles before the check engine light is illuminated.","The purpose of the camshaft position actuator control circuit is to monitor variations of between the camshaft/s and the crankshaft and send a corresponding signal to the ECU. This process is accomplished with camshaft and crankshaft position sensors which convert varying degrees between the camshaft/s and the crankshaft into a voltage signal that is used by the ECU to adjust the timing and optimize the performance of the engine.","This code is defined as B Camshaft Position Actuator Control Circuit High Bank 1 and indicates a detected too high of electrical condition within the B camshaft position actuator control circuit on bank 1 as mentioned earlier.","Note: The \"A\" camshaft is either the intake, left, or front camshaft. Conversely, the \"B\" camshaft is either the exhaust, right, or rear camshaft. Left/Right and Front/Rear are determined as though you are sitting in the driver's seat. Bank 1 is the side of the engine that contains the #1 cylinder, whereas bank 2 is the opposite bank. If the engine is an inline or straight design, there is only one bank.","A typical camshaft position sensor:\n"],"symptoms":["Rough engine idle\nDecreased oil pressure\nEngine may misfire\nPoor engine performance\nIncreased fuel consumption\nChange oil or service soon light is illuminated\nCheck engine light illuminated"],"causes":["Worn timing belt or chain\nDefective camshaft variable timing solenoid\nDefective variable valve timing actuator\nEngine oil level is too low\nBlown fuse or fuse-able link (if applicable)\nMisalignment of timing components\nCorroded or damaged connector\nFaulty or damaged wiring\nFaulty ECU"]}