{"code":"P20C6","description":"Reductant Heater D Control Circuit Performance","info":["This diagnostic trouble code (DTC) is a generic powertrain code and applies to many diesel OBD-II vehicles (1996-newer). That may include but is not limited to vehicles from Ford, Mercedes Benz, Sprinter, Audi, Ram, Chevrolet, Dodge, BMW, GMC, etc. Although generic, the exact repair steps may vary depending on year, make, model and powertrain configuration.","\n ","A stored code P20C6 means that the powertrain control module (PCM) has detected improper voltage that is outside the normal expected value range within the control circuit for the on-board reductant heater designated with the letter D. This designation is used where multiple reductant heaters are in use, consult a vehicle specific repair manual to determine which is the D circuit for your application.","The catalyst system is responsible for reduction of (basically) all the other exhaust emissions although certain applications are also equipped with a NOx trap.","Exhaust gas recirculation (EGR) systems go another step further in the reduction of NOx. Nevertheless, today’s larger and more powerful diesel engines cannot meet strict federal (U.S.) emission standards with the EGR, diesel particulate filter/catalytic converter, and NOx trap alone. It was for this reason that selective catalytic reduction (SCR) systems were invented.","SCR systems inject a reductant compound or a diesel exhaust fluid (DEF) into the exhaust in front of the diesel particulate filter and/or the catalytic converter. The precisely timed DEF injection elevates the temperature of the filtration element and allows it to perform more efficiently. It makes the filtration element last longer and allows fewer harmful exhaust emissions to be released into the atmosphere.","The entire SCS system is monitored and controlled by either the PCM or a stand-alone controller (which interacts with the PCM). Either way, the controller monitors the O2, NOx, and exhaust temperature sensors (as well as other inputs) to determine the appropriate time for DEF (reductant) injection. Precise DEF injection is necessary to maintain exhaust temperature within acceptable parameters and optimize pollutant filtration.","Reductant heaters are used to prevent diesel exhaust fluid from freezing during extreme temperatures. These heaters are typically located in the DEF reservoir and/or the reductant injector supply hose/s.","If the PCM detects improper voltage that is outside the normal expected value range within the control circuit for reductant heater D, a code P20C6 will be stored and a malfunction indicator lamp may be illuminated.","Reductant heaters may be inside a DEF tank (example shown here):\n"],"symptoms":["Diminished engine performance\nExcessive black smoke from vehicle exhaust\nReduction in fuel efficiency\nOther SCR related codes"],"causes":["Bad reductant heater\nOpen or shorted circuits in the reductant heater control\nDefective reductant temperature sensor\nBad SCR controller/PCM or programming error"]}