{"code":"P20CC","description":"Exhaust Aftertreatment Fuel Injector A Control Circuit Performance","info":["This diagnostic trouble code (DTC) is a generic powertrain code and applies to many OBD-II vehicles (1996-newer). That may include but is not limited to vehicles from Mercedes Benz, Sprinter, GMC, Chevrolet, Ford, etc. Although generic, the exact repair steps may vary depending on year, make, model and powertrain configuration.","\n ","If your diesel powered vehicle has stored a code P20CC, it means that the powertrain control module (PCM) has detected improper voltage that is outside the normal expected value range within the control circuit for the exhaust aftertreatment fuel injector, designated A. The designation A indicates that multiple reductant injectors are in use.","The exhaust aftertreatment system (also called selective catalyst reduction system) is used to enhance the capabilities of the exhaust catalyst system. It may consist of one or more of these items; diesel oxidation catalyst, diesel particulate filter, reductant injection system, ammonia slip catalyst, and a nitrogen oxide (NOx) trap.","Among other things, exhaust aftertreatment systems (EAS) are responsible for the injection of reductant compound/diesel exhaust fluid (DEF) into the exhaust in front of the diesel particulate filter, NOx trap, and/or the catalytic converter via an automated fluid storage and injection system. Introducing DEF into the catalyst system promotes filtration element longevity and allows fewer harmful exhaust emissions to be released into the atmosphere.","The EAS and catalyst systems are monitored and controlled by either the PCM or a stand-alone controller (which interacts with the PCM). The controller monitors the O2, NOx, and exhaust temperature sensors (as well as other inputs) to determine the appropriate time for DEF (reductant) injection. DEF injection must be performed at the appropriate instant and in precise measure in order to maintain an exhaust temperature that is within acceptable parameters and to optimize pollutant filtration.","If the PCM detects improper voltage that is outside the normal expected value range within the control circuit for the EAS fuel injector, a code P20CC will be stored and a malfunction indicator lamp may be illuminated."],"symptoms":["Diminished engine performance\nExcessive black smoke from vehicle exhaust\nReduction in fuel efficiency\nOther EAS/SCR related codes"],"causes":["Bad EAS fuel injector\nOpen or shorted circuits in the EAS fuel injection control circuit\nInsufficient DEF in the EAS reservoir\nBad EAS controller/PCM or programming error"]}