{"code":"P20DF","description":"Exhaust Aftertreatment Fuel Pressure Sensor Circuit Low","info":["This diagnostic trouble code (DTC) is a generic powertrain code and applies to many OBD-II vehicles (1996-newer). That may include but is not limited to vehicles from Mercedes Benz, Mitsubishi, etc. Although generic, the exact repair steps may vary depending on year, make, model and powertrain configuration.","\n ","A stored a code P20DF in your diesel powered vehicle means that the powertrain control module (PCM) has detected insufficient voltage in the fuel pressure sensor circuit for the exhaust aftertreatment system.","The exhaust aftertreatment system (also called selective catalyst reduction system) is used to enhance the capabilities of the exhaust catalyst system. It may consist of one or more of these items; diesel oxidation catalyst, diesel particulate filter, reductant injection system, ammonia slip catalyst, and a nitrogen oxide (NOx) trap.","The reductant injection system is typically composed of at least one reductant injector, a reductant fuel storage tank, and high-pressure reductant fuel lines. A high-pressure, electronic pump is normally situated in the tank or in the fuel supply line. An EAS fuel pressure sensor allows the controller to monitor system pressure when the supply pump is activated. It is within this circuit that a malfunction has been perceived when a code P20DF is stored.","Among other things, exhaust aftertreatment systems (EAS) are responsible for the injection of reductant compound/diesel exhaust fluid (DEF) into the exhaust in front of the diesel particulate filter, NOx trap, and/or the catalytic converter via an automated fluid storage and injection system. Precisely timed DEF injections elevate the temperature of the various filtration elements and allow them to perform more efficiently. Introducing DEF into the catalyst system promotes filtration element longevity and allows fewer harmful exhaust emissions to be released into the atmosphere.","The EAS and catalyst systems are monitored and controlled by either the PCM or a stand-alone controller (which interacts with the PCM). The controller monitors the reductant fluid injection system pressure, O2, NOx, and exhaust temperature sensors (as well as other inputs) to determine the appropriate time for DEF (reductant) injection.","If the PCM detects insufficient voltage on the circuit for the EAS fuel pressure sensor, a code P20DF will be stored and a malfunction indicator lamp may be illuminated."],"symptoms":["Diminished engine performance\nExcessive black smoke from vehicle exhaust\nReduction in fuel efficiency\nOther EAS/SCR related codes"],"causes":["Defective EAS fuel pressure sensor\nBad EAS fuel supply pump\nOpen or shorted wiring in the EAS fuel pressure sensor circuit\nBad EAS controller/PCM or programming error"]}