{"code":"P20F3","description":"SCR NOx Pre- Catalyst Efficiency Below Threshold Bank 2","info":["This is a generic diagnostic trouble code (DTC) and applies to many OBD-II vehicles (1996-newer). That may include but is not limited to vehicles from Audi, Buick, Chevrolet, Ford, GMC, Mercedes-Benz, Subaru, Toyota, Volkswagen etc. Although generic, the exact repair steps may vary depending on year, make, model and powertrain configuration.","\n ","When a P20F3 is stored in a diesel powered, OBD-II equipped vehicle, it means that the powertrain control module has detected that catalyst efficiency is below threshold for a certain engine bank. This particular code applies to the upstream catalytic converter (or NOx trap) for engine bank two. Bank two is the bank of the engine that contains the number two cylinder.","While modern, clean-burning diesel engines have many advantages over gasoline engines (especially in commercial truck applications), they also tend to produce more of certain harmful exhaust gases than other engines. The most notable of these offensive pollutants are ions of nitrogen oxide (NOx).","Exhaust gas recirculation (EGR) systems help to dramatically reduce NOx but many of today’s powerful diesel engines cannot meet strict federal (U.S.) emission standards using the EGR system alone. For this reason, SCR systems were developed.","SCR systems inject diesel exhaust fluid (DEF) into the exhaust in front of the catalytic converter or the NOx trap. The introduction of DEF raises exhaust gas temperature and allows the catalyst element to perform more efficiently. It makes the catalyst last longer and allows fewer NOx emissions to be released into the atmosphere.","Oxygen (O2) sensors, NOx sensors, and/or temperature sensors are placed before and after the catalyst to monitor its temperature and efficiency. The entire SCS system is controlled by either the PCM or a stand-alone controller which interacts with the PCM. EIther way, the controller monitors the O2, NOx, and temperature sensors (as well as other inputs) to determine the appropriate time for DEF injection. Precise DEF injection is necessary to maintain exhaust temperature within acceptable parameters and promote optimum NOx filtration.","If the PCM detects a catalyst efficiency that is insufficient for minimum allowble parameters, a code P20F3 will be stored and a malfunction indicator lamp may be illuminated."],"symptoms":["Excessive black smoke from vehicle exhaust\nDiminished engine performance\nReduction in fuel efficiency\nOther stored SCR and emission related codes"],"causes":["Defective O2, NOx, or temperature sensor\nInoperative SCR system\nFaulty SCR injector\nIncorrect or insufficient DEF fluid\nBad SCR controller or programming error\nPre-catalyst exhaust leaks\nInstallation of aftermarket or high-performance exhaust components"]}