{"code":"P050E","description":"Cold Start Engine Exhaust Temperature Too Low","info":["This generic powertrain diagnostic trouble code (DTC) typically applies to many OBD-II vehicles. That may include but is not limited to vehicles from Ford (Mustang, Escape, EcoBoost, etc.), Dodge, Jeep, Land Rover, Nissan, VW, etc.","\n ","When a code P050E is stored, it means that the powertrain control module (PCM) has detected an exhaust temperature that is below the minimum threshold, at cold start. Cold start is a term used to describe a drivability strategy used only when the engine is at (or below) ambient temperature.","In my professional experience, exhaust temperature is monitored only in vehicles equipped with clean burning diesel propulsion systems.","This code is more common in geographic locations with extremely cold climates.","Changes in exhaust temperature are critical to emission reduction in today’s clean burning diesel engines. The PCM must monitor exhaust temperature in order to ensure that the desired action is being taken to accomplish these drastic changes in temperature.","Diesel exhaust fluid (DEF) injection systems are responsible for the introduction of DEF into the catalytic converter and other areas of the exhaust system. These DEF mixtures initiate the increased exhaust temperatures required to burn harmful hydrocarbons and nitrogen dioxide particles trapped within the exhaust system. The DEF injection system is controlled by the PCM.","During engine cold start, exhaust temperature should be at or near ambient temperature. IF the PCM detects that exhaust temperature is lower than ambient temperature, a code P050E will be stored and a malfunction indicator lamp (MIL) may be illuminated. In most cases, multiple failures will be required for MIL illumination.","Cold car:\n"],"symptoms":["Diminished engine performance\nDecreased fuel efficiency\nExcessive black smoke from the exhaust\nAccompanying DEF codes"],"causes":["Defective exhaust temperature sensor\nBurnt or damaged exhaust temperature sensor wiring\nMoisture trapped inside the exhaust has frozen\nPCM or PCM programming error"],"type":"WARN"}