{"code":"P050B","description":"Cold Start Ignition Timing Performance","info":["This generic powertrain diagnostic trouble code (DTC) typically applies to many OBD-II vehicles. That may include but is not limited to vehicles from Jeep, Jaguar, Dodge, BMW, Land Rover, Toyota, VW, Ford, Mitsubishi, Mazda, etc.","\n ","If your OBD-II vehicle has stored a code P050B, it means that the powertrain control module (PCM) has detected a malfunction in the ignition timing control system. Cold start is a term used to describe an engine drivability strategy that is implemented only when the engine is at (or below) ambient temperature.","The PCM calculates ignition timing strategy (including during cold start) using input data received from the crankshaft position (CKP) sensor, the camshaft position (CMP) sensor, the engine temperature sensor (ECT), throttle position sensor (TPS), and the mass airflow (MAF) sensor, among others.","Since OBD-II vehicles are equipped with distributor-less ignition systems, the PCM is programmed to deliver a base timing strategy and to advance and retard ignition timing as required. Changes in engine load and RPM demand varying degrees of ignition timing to help optimize engine performance and maximize fuel efficiency.","When the engine is cold, timing is advanced slightly to compensate for the lower combustion chamber temperature. In the event that the engine overheats or when knock sensors are activated, ignition timing is retarded by the PCM to prevent engine damage.","If ignition timing cannot be controlled by the PCM, a code P050B will be stored and a malfunction indicator lamp (MIL) may be illuminated. Most vehicles will require multiple ignition cycles with a failure for MIL illumination.","Cold car:\n"],"symptoms":["Excessively rich exhaust\nEngine stall at idle\nPinging noise upon acceleration\nCKP or CMP sensor related codes"],"causes":["Defective ECT sensor\nSevere vacuum leak\nOpen or shorted circuits or connectors\nBad CKP or CMP sensor"],"type":"ERR"}