{"code":"P050C","description":"Cold Start Engine Coolant Temperature Performance","info":["This generic powertrain diagnostic trouble code (DTC) typically applies to many OBD-II vehicles. That may include but is not limited to vehicles from Jeep, Jaguar, Dodge, BMW, Land Rover, Toyota, VW, Ford, Mitsubishi, Mazda, etc.","\n ","A stored a code P050C, means that the powertrain control module (PCM) has detected a problem with engine coolant temperature performance. Cold start is a term used to describe an engine drivability strategy that is implemented only when the engine is at (or below) ambient temperature.","Engine coolant temperature is monitored by the PCM using one or more engine coolant temperature sensors (ECT). The ECT sensor consists of a brass (or plastic) housing with a thermal resistor inside. The housing is designed so that it may be threaded into the engine block, cylinder head, or intake manifold; where the engine cooling passages are located. When the thermostat opens, coolant flows across the tip of the ECT sensor (where the thermal resistor is). The ECT sensor is provided a reference voltage and a ground but the sensor completes the circuit. As engine coolant temperature increases, the resistance of the thermal resistor decreases. The result of this decrease in circuit resistance is higher voltage being input to the PCM. When engine coolant temperature decreases, a reverse action occurs and circuit voltage decreases. The PCM receives these variations in circuit voltage as changes in engine coolant temperature.","Some vehicle applications utilize multiple ECT sensors. A common location for a secondary ECT sensor is in one of the radiator tanks. The PCM compares input signals between ECT sensors to determine whether or not engine coolant is flowing efficiently.","In most cases, engine coolant temperature is also compared to ambient temperature under cold start conditions. The ambient temperature sensor functions in a similar manner to the ECT sensor and is normally located near the grille.","If the PCM detects a discrepancy between the ECT sensors and/or the ambient temperature sensor that exceeds the maximum threshold, under cold start conditions, a code P050C will be stored and a malfunction indicator lamp (MIL) may be illuminated. Multiple ignition cycles (with a failure) may be required for MIL illumination.","Cold car:\n"],"symptoms":["Rich exhaust\nCold start drivability issues\nNo heat inside the passenger compartment\nECT sensor related codes"],"causes":["Defective primary or secondary ECT sensor\nFaulty ambient temperature sensor\nShorted or open circuits or connectors\nBad thermostat\nLow engine coolant"],"type":"ERR"}