{"code":"P050F","description":"Brake Assist Vacuum Too Low","info":["This generic powertrain diagnostic trouble code (DTC) typically applies to many OBD-II vehicles. That may include but is not limited to vehicles from Chevrolet, Ford, VW, Buick, Cadillac, etc.","\n ","A stored code P050F means that the powertrain control module (PCM) has received an input signal from the vacuum brake sensor (VBS) that indicates an insufficient vacuum condition at the brake power assist booster.","Even though there are several different types (including hydraulic and electronic) of brake power assist systems, this code applies only to those which utilize engine vacuum and a vacuum brake booster.","The vacuum brake booster is located between the brake pedal and the master cylinder. It is bolted to the firewall of the passenger compartment (usually in front of the driver seat). It can be accessed with the hood open. One end of the actuator rod of the booster protrudes through the firewall and attaches to the brake pedal arm. The other end of the actuator rod depresses the piston of the master cylinder which forces brake fluid through the brake lines and initiates braking at each wheel.","The brake booster is composed of a metal housing with a pair of large vacuum diaphragms inside. This type of booster is called a dual-diaphragm vacuum brake booster. There are some vehicles which use a single diaphragm booster but it is rare. With the engine running, a constant supply of vacuum is supplied to the diaphragm, which draws slightly on the brake pedal arm. A one-way check valve (in the vacuum supply hose) prevents vacuum loss when the engine is placed under a load.","While most diesel vehicle applications use a hydra-boost system, others use a vacuum brake booster. Since diesel engines do not make vacuum, a belt-driven pump is used as a vacuum source. The rest of the vacuum booster system works in much the same manner as that of the gas engine system. ","Typical VBS configuration involves a pressure sensitive resistor inside a small vacuum diaphragm, enclosed in an airtight plastic housing. Vacuum pressure (air density) is measured in kilopascal units (kPa) or inches of mercury (Hg). The VBS is inserted through a thick rubber grommet and into the housing of the vacuum brake booster. As vacuum pressure increases, VBS resistance decreases. This results in increased VBS circuit voltage. When vacuum pressure decreases, a reverse action occurs. The PCM receives these variations in voltage as changes in vacuum brake booster pressure and reacts accordingly.","If the PCM detects a level of vacuum at the brake booster that is not within a set parameter, a code P050F will be stored and a malfunction indicator lamp (MIL) may be illuminated."],"symptoms":["Audible hissing when depressing the brake pedal\nIncreased effort required to depress brake pedal\nOther codes could be stored, including manifold absolute pressure (MAP) codes\nEngine drivability issues created by a vacuum leak"],"causes":["Internal leak in the vacuum brake booster\nBad vacuum brake sensor\nCracked or disconnected vacuum hose\nFaulty one-way check valve in the vacuum supply hose\nInsufficient engine vacuum"],"type":"WARN"}