{"code":"P0512","description":"Starter Request Circuit","info":["This diagnostic trouble code (DTC) is a generic powertrain code, which means that it applies to all 1996-newer vehicles (Dodge, Chrysler, Hyundai, Jeep, Mazda, etc.). Although generic, the specific repair steps may vary depending on make/model.","Any time that I encounter a stored code P0512, it means that the powertrain control module (PCM) has detected a malfunction in the starter request circuit. In this case, the word starter refers to the engine starter.","\n ","Although the starter is supplied with constant battery voltage from the positive cable, the starter request signal originates from the ignition switch. When the ignition key is placed into the ignition cylinder and turned to the start position, it actuates the electrical portion of the ignition switch and closes a set of heavy-duty contacts, completing the starter request circuit. When the starter request circuit is completed, a battery voltage signal is sent to the starter solenoid (or the starter relay on some models). In the vehicle which you are attempting to diagnose, it means that a starter request signal should also be sent to the PCM. Since a code P0512 has been stored, the PCM has probably not received the starter request signal.","Once the starter request signal is received by the starter solenoid, the starter motor begins to spin and a small cog is pushed in the direction of the engine where the teeth of the cog intermesh with the teeth of the flywheel ring gear. This turns the engine crankshaft and helps to initiate startup.","Consult a reliable vehicle information source (All Data DIY is great) to see if the vehicle in question is equipped with a starter relay. If so, you’ll need to locate the relay and the system wiring diagram. Typically, the ignition switch supplies the starter relay with a starter request signal. After the relay receives the signal, the relay then provides the starter and the PCM with a starter request signal. After that, the starter and solenoid function in exactly the same manner as the vehicle that has no starter relay.","Even if there are no symptoms exhibited, if the PCM fails to receive the starter request signal and the engine is started, a code P0512 will be stored and a malfunction indicator lamp may be illuminated. Some vehicles require multiple ignition cycles (with a failure) for the MIL to be illuminated."],"symptoms":["The engine may fail to start\nDelayed starter engagement (startup may require multiple key cycles)\nPCM power circuit failure or ignition system circuit failure codes may accompany this code\nThere are often no symptoms at all"],"causes":["Possible causes for this code include:","Defective ignition switch\nBlown fuses or burnt fusible links\nFaulty starter relay\nOpen or shorted circuits in the starter request circuit\nPCM fault or PCM programing error"],"type":"ERR"}