{"code":"P052E","description":"Positive Crankcase Ventilation Regulator Valve Performance","info":["This generic powertrain diagnostic trouble code (DTC) typically applies to many OBD-II vehicles. That may include but is not limited to vehicles from Ford, Dodge, Ram, Volvo, etc.","\n ","If you have a code P052E stored in your OBD-II vehicle, it means that the powertrain control module (PCM) has detected a signal from the crankcase pressure sensor that indicates an inappropriate degree of pressure exists.","Air density (pressure) in the engine crankcase is monitored by the PCM using an input voltage signal from the crankcase pressure sensor. Crankcase pressure sensor input voltage is received (by the PCM) as actual units of pressure. Either kilopascal (kPa) units or inches of mercury (Hg) are used to measure crankcase pressure. The crankcase pressure sensor is typically located in or near one of the valve covers.","Because the lower end of the internal combustion engine must be sealed to prevent oil leaks, a certain amount of pressure is created there. This pressure is caused by drastic changes in temperature, the vapors created by engine oil, and the rapid centrifugal motion of the crankshaft, connecting rods, etc.","The positive crankcase ventilation (PCV) system uses carefully controlled intake vacuum to draw pressure from the crankcase through a specially designed valve (PCV valve) that only allows a single direction of flow. In the vast majority of vehicle applications, the PCV valve uses straight vacuum from the intake manifold. In this particular application, PCV vacuum is regulated using an electronically controlled PCV regulator valve. The PCM uses an input signal from the crankcase pressure sensor to determine how much vacuum pressure must be applied to the PCV for optimum performance. A constant supply of battery voltage is usually applied to one terminal of the PCV regulator valve and the PCM supplies a ground as needed to complete the circuit, position the regulator valve in its housing, and realize the desired degree of PCV vacuum.","If the PCM detects that the desired level of crankcase pressure cannot be achieved with the PCV regulator valve, a code P052E will be stored and a malfunction indicator lamp (MIL) may be illuminated."],"symptoms":["Engine oil leaks\nSmoke (steam) from underhood area\nHissing (sucking) noise from engine area\nDrivability issues created by a vacuum leak"],"causes":["Bad PCV regulator valve\nFaulty PCV valve\nDefective crankcase pressure sensor\nOpen or shorted PCV regulator valve/crankcase pressure sensor wiring\nPCM malfunction or PCM programming error","Example of a crankcase pressure sensor:\n"],"type":"ERR"}