{"code":"P0534","description":"Air Conditioner Refrigerant Charge Loss","info":["This is a generic diagnostic trouble code (DTC) and typically applies to OBD-II vehicles. Vehicle makes may include but aren't limited to Chevrolet / Chevy, Land Rover, GM, etc.","\n ","When a code P0534 is stored, it means that the powertrain control module (PCM) has detected a low freon condition in the air conditioning (A/C) system.","The automotive a/s system is lubricated with a mixture of specially designed oil and freon. Even if the correct amount of the appropriate oil were present in the a/c system, without the freon it could not be circulated to vital areas. Without this mixture, the compressor would suffer catastrophic failure and the condenser would be filled with a form of gummy metallic debris.\nIn order to protect the compressor and other expensive a/c components, pressure sensors are positioned in certain areas of the system.","A high-pressure cutoff switch in the back of the compressor (or in a discharge line) may protect the a/c system from an extreme over pressure condition. This type of condition would likely be caused by a lack of airflow across the condenser or an overheating engine.","To protect the a/c system from a low freon condition, a low pressure cutoff switch is positioned in the suction side of the system near the accumulator or expansion valve (depending upon the a/c system configuration).","The a/c low pressure cutoff switch is made with a pressure sensitive contact that closes when a/c pressure exceeds the targeted level (usually above 30 psi). It typically threads onto a schrader valve on the suction hose or accumulator of the a/c system. As long as a/c system pressure remains within the programmed specifications, the contact in the low pressure switch remains closed and the a/c compressor clutch power circuit is completed as desired. When a/c system pressure falls below the minimum threshold, the contact in the low pressure switch opens and voltage to the compressor clutch is interrupted.","The a/c low pressure cutoff switch also provides the PCM with an on/off signal. If the PCM detects a signal from the low pressure cutoff switch that indicates a low freon condition, a code P0534 will be stored and a malfunction indicator lamp (MIL) may be illuminated. In most cases, multiple failures will be required for the code to be stored and for MIL illumination.","A refrigerant pressure sensor:\n"],"symptoms":["The a/c will not blow cold air\nThe a/c compressor switch may flash\nThe compressor clutch may cycle on and off repeatedly\nA/C compressor clutch engagement may be disabled"],"causes":["Freon leak (low freon) in the a/c system\nBad low pressure cutoff switch\nOpen or shorted circuit or connector in the a/c system"],"type":"ERR"}