{"code":"P053A","description":"Positive Crankcase Ventilation Heater Control Circuit /Open","info":["This is a generic powertrain diagnostic trouble code (DTC) and typically applies to OBD-II vehicles. Vehicle makes may include but aren't limited to BMW, Mini, Jeep, Chrysler, Ford, etc.","\n ","The PCV (Positive Crankcase Ventilation) is technically a system designed to remove harmful vapors from the engine and also, to prevent the said vapors to be ejected into the atmosphere. It is also able to do this by the use of manifold vacuum in order to suck the vapors from the crankcase in the intake manifold. The crankcase vapors are led through the combustion chambers alongside with the fuel and air mixture to be burned. The PCV valve controls the circulation within the system, which makes it an effective ventilation system for the crankcase and also a pollution management device.","This PCV system has become the standard for all new vehicles since the 1960's and variety of systems have been created throughout the years, but the main function of it is the same. There are two main kinds of PCV systems, which are open and closed systems. Technically both function similarly, however, since the use of the closed system in 1968 it has been proven to be more effective for air pollution control.","With the aid of a heater system/element, the PCV system is able to remove moisture, which is considered to be one of the major contaminants within the engine. As the engine functions, it generally creates heat that is able to burn off most of the moisture in the system. However, when it cools down, this is where condensation occurs. There are specific additives in engine oils, which suspends the water molecule caused by the moisture. However, in due time it eventually exceeds its capacity and the water corrodes the metal parts of the engine that damages it to an extent.","The ECM (Engine control module) is responsible for monitoring and adjusting the positive crankcase ventilation heater control circuit. If the P053A code is active, the ECM has detected a general malfunction in the PCV heater control circuit and/or an open in said circuit.","Example of a PCV valve:\n"],"symptoms":["Excessive oil consumption\nSludge in engine oil\nEngine misfire\nReduced fuel economy\nEngine oil leak\nA failed PCV valve may cause noise such as a whistle, whine, or other low moaning noises."],"causes":["PCV valve that stuck open\nWiring issue causing an open/short/out of range condition in the positive crankcase ventilation heater control circuit\nECM (engine control module) issue (i.e. internal short, open, etc.)\nContaminated inline PCV air filter (possibly internal)\nOil contamination on electrical connector and/or harnesses involved causing electrical connection issue\nPCV heater defective"],"type":"WARN"}