{"code":"P0575","description":"Cruise Control Input Circuit","info":["This is a generic powertrain diagnostic trouble code (DTC) and typically applies to OBD-II vehicles equipped with cruise control. Vehicle makes may include but aren't limited to Chevrolet (Chevy), Toyota, Ford, Harley, Dodge, Ram, Ford, etc.","\n ","The ECM (Engine control module) spends most of it's time making sure your engine is working as it should all while keeping emissions, fuel economy, performance, noises, creator comfort functions at acceptable levels. Cruise control is a great feature for long trips given the fact that you do not need to control the speed of the vehicle. The ECM can take care of this as long as the cruise control system is free of any defects. If you are reading this, more than likely your cruise control has stopped working. A good sign that the cruise control has been completely disabled by the ECM is, the cruise control light on the dash doesn't come on when you try to activate it.","Generally speaking, this trouble code means that the control input has suffered an electrical malfunction that stems from numerous potential causes. The P0575 Cruise Control Input Circuit and related codes (P0576 and P0577) are set when the ECM detects a malfunction within the cruise control input circuit, in this case it means there is a non-specific general malfunction.","Cruise control switches:\n"],"symptoms":[],"causes":["The most common cause of abnormal voltage/resistance level in the cruise control input circuit is a faulty cruise control switch that could potentially be caused by spilled liquids that short circuits the device and/or circuits within.\nWiring issue (e.g. open circuit, short to ground, short to power, etc.)\nECM (engine control module) issue (i.e. internal short, open, etc.)\nOpen or shorted cruise control function switch(s)\nDamaged connectors within the cruise control system\nBlown fuses, which could indicate a much more serious problem. (e.g. short, voltage spikes, control module(s) defective, etc.)"],"type":"ERR"}