{"code":"P0579","description":"Cruise Control Multi-Function Input A Circuit Range/Performance","info":["This is a generic powertrain diagnostic trouble code (DTC) and typically applies to OBD-II vehicles. That may include but is not limited to vehicles from Mazda, Alfa Romeo, Ford, Land Rover, Jeep, Dodge, Chrysler, Chevy, Nissan, etc. Although generic, the exact repair steps may vary depending on year, make, model and powertrain configuration.","Cruise control was developed with our comfort in mind. It's sole purpose is to maintain a vehicle speed set by the operator manually (via steering wheel buttons, multifunction (i.e. signal lights, cruise, wipers, etc.) switch mounted to the steering column, etc.)","\n ","Meanwhile, the operator no longer has to control the gas pedal and if the vehicle is equipped with an automatic transmission (A/T), it may also control and adjust shift points according to real-time driving conditions' demands.","Generally speaking here, this code would make me believe we are talking about the multifunction switch on your steering column. That said, location possibilities vary significantly between manufacturers so, research accordingly. The cruise control button would be a good place to start to narrow down locations. This code refers to a specific input circuit within the cruise control system. To determine which wire/circuit to focus on, refer to the service manual, letters in codes can and will be your best reference as far as pinpointing what wire/ circuit you are trying to diagnose/test.","When there is a fault within the cruise control multi-function \"A\" input circuit, the engine control module (ECM) proactively illuminates the instrument cluster with P0579 and related codes (P0564, P0578, P0579, P0580, and P0581).","As far as the letter \"A\" goes here, it could be to distinguish a connector, wire, circuit group, etc. That said, the manufacturer's specifications is the best resource you could have for this.","The trouble code P0579 is set by the ECM when the \"A\" cruise control multi-function input circuit's values are out of range or performing abnormally.","A cruise control stalk:\n"],"symptoms":["Abnormal vehicle speeds with cruise control active\nCruise control inoperative\nCruise control light illuminated regardless of switch position\nCannot set cruise control to desired speed"],"causes":["Multi-function/Cruise control switch defective (i.e. stuck, broken, missing, etc.)\nWring problem (e.g. chafing on steering column/dash parts, water intrusion, corrosion etc.)\nConnector malfunction (e.g. corroded pins, broken plastic tabs, swollen connector body, etc.)\nFluids/dirt/grime in cruise control button/switch causing abnormal mechanical operation\nECM issue (e.g. water intrusion in computer body, internal short, internal overheating, etc.)"],"type":"ERR"}