{"code":"P0574","description":"Cruise Control Accel Signal Malfunction","info":["This is a generic powertrain diagnostic trouble code (DTC) and typically applies to OBD-II vehicles equipped with cruise control. That may include but is not limited to vehicles from Peugeot, Ford, Nissan, Chevrolet, Hyundai, VW, Audi, Citroen, etc. Although generic, the exact repair steps may vary depending on year, make, model and powertrain configuration.","\n ","Within the vehicle option cruise control, there are many functions. Not only can the operator set a specific vehicle speed, and it be maintained automatically using numerous sensors, switches, modules, among many other components, but you can also modify the speed electronically (i.e. \"set - \" & \"resume +\"), temporarily modify speed while storing previous speed (i.e. passing vehicles, unexpected stopping/slowing), among other things.","Given the fact that most of the functions mentioned in the description of P0570, and related codes (P0565, P0566, P0567, P0568, P0569, etc.), are contained within one switch/component, it should be fairly painless to locate the mechanical inputs (i.e. buttons, switches, talks, etc.) involved. That being said, some of the common names for said component(s) are: Multi-function switch, Steering wheel controls, Cruise control switch, Cruise control module, Accessory switch, etc.","What happened, in this code's case, is the ECM (Engine Control Module) has detected a malfunction(s) within the signal circuit. Simply put, something went wrong within the circuit of the function mentioned in the description.","When the ECM detects a signal malfunction within one or more of the many cruise control functions, it illuminates the CEL (Check engine light) with P0570 and/or related codes. Most likely, the use of said function will be disabled and/or acting abnormally.","Code P0570 is set when the ECM detects a signal malfunction within the ACCEL (accelerate) signal of the system.","An example of cruise control buttons on a steering wheel:\n"],"symptoms":["Cruise control light in dash not coming on or constant\nCruise control inoperative\nCannot set cruise control to desired speed or speed is erratic\nCertain function(s), within the cruise control system, non-operative (i.e. Resume, Set, +, -, Coast, Accel)\nCommands not functioning consistently"],"causes":["Cruise control switch, or buttons within the switch, defective and/or damaged\nConnector(s) not making proper and effective electrical connection\nWire(s) within the cruise control harness chafed and/or damaged causing short, open, resistance, etc.\nCruise control switch assembly contaminated with fluid (i.e. coffee, soda, juice, etc.)\nECM issue\nCruise control module defective\nBCM (Body Control Module) issue\nOverheated parts causing malfunction"],"type":"ERR"}