{"code":"P0585","description":"Cruise Control Multi-Function Input A/B Correlation","info":["This generic powertrain diagnostic trouble code (DTC) typically applies to many OBD-II vehicles. That may include but is not limited to vehicles from Dodge, Jeep, Chrysler Ram, Ford, Chevy, Chevrolet, etc.","\n ","When a code P0585 is stored, it means that the powertrain control module has detected a discrepancy between correlating voltage inputs of the cruise control multi-function switch.","Input A/B (or A and B) references a specific but separate set of input circuits. Consult a reliable source of vehicle information to determine exactly which circuits are indicated with this code.","The cruise control (or speed control) system is controlled by the PCM, using inputs from the multi-function switch. The multi-function switch is so called because it controls functions in multiple systems. For instance, it may provide input signals for the cruise control system, the turn signals, and the windshield wiper system. Typically, it only acts as a lever for the turn signals but may also house the actual turn signal switch.","The driver provides manual inputs using the multi-function switch. These input signals are forwarded to the PCM, which applies the appropriate voltage signal to a cruise control servo motor. These inputs include a command to maintain current vehicle speed, resume a previously maintained vehicle speed, accelerate to increase vehicle speed, or disengage acceleration in order to coast and decrease vehicle speed. Of course, depressing the brake pedal should disengage the cruise control system. Cruise control systems do not generally become active until vehicle speed exceeds 35 mph.","The PCM adjusts cruise control servo motor voltage to achieve the appropriate throttle position for maintaining the desired vehicle speed.","If the PCM detects an input voltage signal that is not within programmed specifications, or if the vehicle speed cannot be maintained using the cruise control system, a code P0585 will be stored and a malfunction indicator lamp (MIL) may be illuminated. Multiple drive cycles with a failure may be required for MIL illumination.","Cruise control stalk:\n"],"symptoms":["Inoperative cruise control system\nErratic speedometer/odometer operation\nFlashing or unresponsive cruise control indicator lamp\nOther stored codes"],"causes":["Defective multi-function switch\nBad cruise control servo motor\nOpen or shorted circuits in the cruise control system\nFaulty cruise control module, PCM, or programming error"],"type":"ERR"}