{"code":"P0587","description":"Cruise Control Vent Control Circuit Low","info":["This is a generic powertrain diagnostic trouble code (DTC) and typically applies to OBD-II vehicles. Vehicle makes may include but aren't limited to Dodge, Jeep, Honda, Chrysler, Ram, Hyundai, Chevrolet, etc.","\n ","Cruise control is a feature that makes driving your vehicle more convenient and provides you with a much smoother driving experience. While its main function is to control the speed of your vehicle, it has other uses, too.","For instance, it allows you to accelerate or decelerate your car by one mile per hour (for example) with just a simple tap of a button. It also keeps you safe by disengaging as soon as you step on the brake pedal. Also, you won't be able to activate it if your car is running at speeds less than 25 miles per hour.","Your vehicle's cruise control system is controlled by the ECM (Engine control module) and/or potentially a cruise control module. The ECM uses a vast amount of readings to control the speed of your vehicle automatically. If you're unable to automatically control your vehicle speed using cruise, the ECM will run a test involving the entire cruise control system to determine if there are any problems within.","Most times, the cruise control vent is used in cruise control systems to ensure the ECM is capable of adjusting vacuum within the system. The vent's functionality is integral, because at times, it can directly affect the cruise control servo's function. And the servo is responsible for mechanically adjusting and controlling your speed when cruise control is activated.","If the test reveals an on-going problem, the ECM will activate a cruise control code that correlates with the issue detected.","P0587 is a generic trouble code that refers to \"Cruise Control Vent Control Circuit Low.\" It appears when the test conducted by the ECM detects a lower than normal electrical level from the cruise control vent circuit.","Cruise control switches:\n"],"symptoms":["If the code is stored in the PCM, there is highly probable that the vehicle control speed won't be set when using your cruise control\nCheck/service engine soon warning lamp on the dashboard may be illuminated (in some cases, the issue must be identified three time by the ECM before the warning light will come on)\nBlown fuses are likely to be present in some cases\nOne or more cruise control functions not working\nIrregular/Intermittent general cruise control functionality"],"causes":["Problematic or malfunctioning cruise control switch\nPoor electrical connection in speed control/vent control solenoid\nSpeed control/vent control harness is open or a short circuit is present\nVacuum leak or obstruction within cruise control system\nDamaged or corroded connectors\nDefective vent control solenoid\nBlown fuses (may be a result of underlying electrical issue in cruise control vent control circuit)"],"type":"WARN"}