{"code":"P0595","description":"Cruise Control Servo Control Circuit Low","info":["This is a generic powertrain diagnostic trouble code (DTC) and typically applies to OBD-II vehicles with cruise control. Vehicle makes may include but aren't limited to Dodge, Chrysler, Ram, Jeep, Hyundai, BMW, Vauxhall, Mini, Chevrolet, etc.","\n ","There are many benefits that come along with the cruise control feature. On long trips, you do not have to consistently monitor and adjust speeds according to traffic and traffic laws. You press a button or two, and a combination of sensors, solenoids, modules, etc. make sure to keep the vehicle moving at the specified speed until you or possibly outside influences, deactivate or adjust the speed accordingly. Not to mention, the vehicle will have a good idea on how to keep the fuel economy at a good level throughout the trip because well, when we drive we don't necessarily factor everything we could to keep costs down.","Luckily for us, the ECM (engine control module) is responsible for the seamless yet efficient operation of the cruise control. The proper functioning of the systems relies on many sensors, switches, modules, VSS, etc. One of them being the cruise control servo. Most times, these are responsible for controlling the throttle when you set and/or adjust the cruise control. By controlling the throttle and adjusting accordingly, with this servo, the ECM can adjust the speed easily and efficiently. Many times, these servos are controlled mechanically via vacuum lines and throttle cables. The vacuum to the servo is controlled by solenoids who are in turn, controlled by the ECM, who can interpret every other value before specifying throttle position, speed, etc. This fault refers to the circuit involved, refer to the service manual to determine exactly what physical circuit you are working with/ diagnosing.","The P0595 Cruise Control Servo Control Circuit Low and related codes (P0525, P0594 and P0596) are set when the ECM monitors a malfunction within the cruise control servo control circuit. In the case of the P0595 specifically, it is set when a low voltage electrical condition is detected in said circuit.","Example of a cruise control servo:\n"],"symptoms":["Cruise control inoperative\nErratic cruise control operation\nVehicle speed stuck\nVehicle speed limited with cruise control active\nInaccurate vehicle speed setting when compared to desired or set speed\nSpecific cruise control(s) functions malfunctioning/erratic"],"causes":["Defective/damaged cruise control servo\nCruise control servo cable broken/stuck/disconnected/mis-adjusted\nWiring issue\nECM (engine control module) issue\nModule water intrusion\nConnector issue"],"type":"WARN"}