{"code":"P0106","description":"Manifold Absolute Pressure/Barometric Pressure Circuit Range/Performance Problem","info":["This diagnostic trouble code (DTC) is a generic powertrain code, which means that it applies to OBD-II equipped vehicles. Although generic, the specific repair steps may vary depending on make/model.","The Powertrain Control Module (PCM) uses the Manifold Absolute Pressure Sensor (MAP) to monitor engine load. (NOTE: Some vehicles have a Barometric Pressure (BARO) sensor that is integral to the Mass Air Flow (MAF) sensor and do not have a MAP sensor. Other vehicles have a MAF/BARO and a redundant MAP sensor where the MAP sensor functions as a backup input in case of MAF failure.","\n ","The PCM supplies a 5 Volt reference signal to the MAP sensor. Usually the PCM also supplies a ground circuit to the MAP sensor as well. As the manifold pressure changes with load, the MAP sensor input informs the PCM. At idle the voltage should be 1 to 1.5 Volts and approximately 4.5 Volts at Wide Open Throttle (WOT). The PCM looks for any change in manifold pressure to be preceded by a change in engine load in the form of changes in throttle angle, engine speed, or Exhaust Gas Recirculation (EGR) flow. If the PCM doesn't see any of these factors change while detecting a rapid change in MAP value, it will set a P0106.","\nA typical MAP sensor"],"symptoms":["The following could be symptomatic of a P0106:","Engine runs rough\nBlack smoke at tailpipe\nEngine will not idle\nPoor fuel economy\nEngine misses at speed"],"causes":["A P0106 could be caused by:","Bad MAP sensor\nWater/dirt intrusion affecting MAP sensor connector\nIntermittent open in the reference, ground, or signal wire for the MAP sensor\nIntermittent short in the reference, ground, or signal wire for the MAP sensor\nGround problem due to corrosion causing intermittent signal problem\nA break in the flexible air intake duct between the MAF and the intake manifold\nBad PCM (do not assume the PCM is bad until you've exhausted all other possibilities)"],"type":"ERR"}