{"code":"P0105","description":"Manifold Absolute Pressure/Barometric Pressure Circuit Malfunction","info":["This diagnostic trouble code (DTC) is a generic powertrain code, which means that it applies to OBD-II equipped vehicles. Although generic, the specific repair steps may vary depending on make/model.","The MAP (Manifold Absolute Pressure) sensor is part of the fuel management system. It reacts to changes in engine manifold pressure. The PCM (Powertrain Control Module) monitors the MAP sensor continually to properly run the engine. Changes in engine load require changes in the amount of fuel injected, and timing of the ignition system, etc.","\n ","An engine under load has more manifold pressure(or less vacuum) than an engine that is coasting. As the load changes, the MAP sensor voltage signal to the PCM changes accordingly. To check the MAP sensor operation, though, the PCM watches other sensors to verify that the MAP sensor is working properly.","For example, the PCM compares the TPS (Throttle Position Sensor) signal to the MAP signal to verify the MAP signal isn't \"sticking\". If the PCM doesn't see a MAP sensor change immediately follow a change in the throttle pedal sensor, it knows there is a problem with the MAP sensor and sets P0105. Or, if the PCM notices that the TPS indicates the engine is under load, but the MAP signal indicates that the engine is \"coasting\" it, again, knows there is a problem with the MAP sensor or TPS and sets P0105."],"symptoms":["Poor running engine\nEngine runs rich\nEngine won't idle\nEngine backfires through tailpipe\nEngine misfire under load or at idle\nMIL (Malfunction Indicator Lamp) illumination\nIn some extreme cases there may be no symptoms other than MIL illumination","\nA typical MAP sensor"],"causes":["A P0105 DTC could be caused by:","MAP sensor vacuum hose disconnected or plugged\nBad MAP sensor\nBad TPS\nDamaged or problematic MAP sensor connector\nDamaged or problematic TPS connector\nDamaged wiring\nShort to reference voltage on signal circuit of MAP sensor\nLoss of ground to MAP sensor or TPS\nOpen on signal circuit of MAP sensor\nBad PCM"],"type":"ERR"}