{"code":"P0101","description":"Mass Air Flow (MAF) Circuit Range/Performance","info":["This diagnostic trouble code (DTC) is a generic powertrain code, which means that it applies to OBD-II equipped vehicles (Nissan, Chevrolet, GMC, Mercedes, VW, Toyota, Mazda, BMW, Ford, Audi, Honda, etc.). Although generic, the specific repair steps may vary depending on make/model.","The MAF (mass air flow) sensor is a sensor mounted in a vehicle's engine air intake tract downstream from the air filter, and is used to measure the volume and density of air being drawn into the engine. The MAF sensor itself only measures a portion of the air entering and that value is used to calculate the total volume and density of air being ingested.","The powertrain control module (PCM) uses that reading along with other sensor parameters to ensure proper fuel delivery at any given time for optimum power and fuel efficiency.","Basically this P0101 diagnostic trouble code (DTC) means that there is a problem with the Mass Air Flow (MAF) sensor or circuit. The PCM detects that the actual MAF sensor frequency signal is not within a predetermined expected range of the calculated MAF value.","Note: Some MAF sensors also incorporate an air temperature sensor, which is another value used by the PCM for optimal engine operation.","Closely related MAF circuit trouble codes include:","P0100 Mass or Volume Air Flow \"A\" Circuit Malfunction\nP0102 Mass or Volume Air Flow \"A\" Circuit Low Input\nP0103 Mass or Volume Air Flow \"A\" Circuit High Input\nP0104 Mass or Volume Air Flow \"A\" Circuit Intermittent"],"symptoms":["Malfunction indicator lamp (MIL) illumination (a.k.a. check engine light)\nRough running engine\nBlack smoke from tail pipe\nStalling\nEngine hard start or stalling after it starts\nPossible other driveability symptoms"],"causes":["Potential causes for this trouble code may include:","Dirty or contaminated mass air flow sensor\nFailed MAF sensor\nIntake air leaks\nMAF sensor electrical harness or wiring problem (open, shorted, frayed, poor connection, etc.)\nClogged catalytic converter on some models (GMC/Chevrolet mainly)","Note that other codes may be present if you have a P0101. You may have misfire codes or O2 sensor codes, so it's important to take a \"big picture\" look at how the systems work together and effect each other when doing a diagnosis."],"type":"ERR"}