{"code":"P0119","description":"Engine Coolant Temperature Sensor Circuit Intermittent","info":["This diagnostic trouble code (DTC) is a generic powertrain code, which means that it applies to all 1996-newer vehicles (Ford, Hyundai, Kia, Mazda, Mercedes-Benz, etc.). Although generic, the specific repair steps may vary depending on make/model.","When I connect my code reader to a vehicle and find a stored P0119, I know that the powertrain control module (PCM) has detected an intermittent signal from the engine coolant temperature (ECT) sensor.","\n ","The PCM monitors ECT using a reference circuit (typically five-volts) that is completed by the ECT sensor. If separate ECT sensors are used (one for the PCM and another for the temperature gauge), the sensor itself is usually of a two-wire design. The first wire carries the five-volt reference and the second wire is the ground wire. The ECT sensor is usually a negative coefficient sensor, which means that as sensor temperature is increased, resistance decreases. The variation in sensor resistance translates into fluctuations in circuit voltage that are recognized by the PCM as changes in ECT. If the PCM and the temperature gauge use the same ECT sensor, then the sensor will be of a three-wire design. It reacts to temperature the same way as the two-wire sensor but one wire feeds an input signal to the gauge and one wire feeds an input signal to the PCM. Simple, huh?","Although ECT location will differ between manufacturers, it will always be threaded directly into an engine coolant passage. Many automakers place the ECT sensor in the cylinder block or cylinder head, others thread it into one of the intake manifold coolant passages, and some locate it in the thermostat housing.","With the ECT sensor threaded into the engine, the tip of the sensor, which contains the thermistor, protrudes into the coolant passage. With the engine running, coolant should constantly flow across the tip. As engine coolant increases in temperature, so does the thermistor inside of the ECT sensor.","The PCM uses engine temperature to help calculate fuel delivery, idle speed, and ignition timing. The ECT sensor input is critical because the engine control system must function differently as engine temperature changes from ambient temperature to more than 220-degrees Fahrenheit. The PCM also uses the ECT sensor input to initiate electric cooling fan operation.","If the PCM receives input signals from the ECT sensor that are erratic or intermittent, during a set period of time and under certain circumstances, a code P0119 will be stored and a malfunction indicator lamp (MIL) may be illuminated.","\nAn example of an Engine Coolant Temperature ECT sensor"],"symptoms":["Rough engine idle on cold start\nHesitation or stumble on acceleration\nRich exhaust smell, especially on cold start\nPossible engine overheating\nElectric cooling fan running constantly or not running at all"],"causes":["Possible causes for this engine code include:","Low engine coolant level\nFaulty thermostat\nBad ECT sensor\nOpen or shorted wiring and/or connectors in ECT sensor circuit"],"type":"ERR"}