{"code":"P011A","description":"Engine Coolant Temperature Sensor 1/2 Correlation","info":["This generic powertrain diagnostic trouble code (DTC) typically applies to all OBD-II vehicles. That may include but is not limited to vehicles from Mazda, Land Rover, GMC, Chevy, Ford, Dodge, Chrysler, Toyota, Honda, etc. Although generic, the specific repair steps may vary depending on make/model.","On the rare occasion that a code P011A is stored in an OBD-II vehicle, it means that the powertrain control module (PCM) has detected a problem with the correlating signals between two separate engine coolant temperature (ECT) sensors.","\n ","These sensors have been designated as A and B but could also be called primary and secondary. Obviously, this code is used only in vehicles with multiple ECT sensors.","Typically, ECT sensors are composed of a thermal resistor that is surrounded by a durable resin in a brass, aluminum, or plastic housing. The housing is designed to thread into the engine block, radiator, intake manifold (coolant passage), or cylinder head. The ECT sensor is shaped and positioned so that, once the thermostat has opened, engine coolant may flow across the tip. The exposed resistor is in the tip of the sensor.","As the flowing engine coolant temperature increases, the level of resistance in the ECT resistor decreases. This allows circuit voltage to increase. The PCM recognizes these variations in ECT voltage as changes in engine coolant temperature.","The ECT sensor/s provides data to the PCM, for drivability strategy and electronic cooling fan operation, but may also serve to provide a signal to the temperature gauge in the instrument cluster.","If the PCM detects independent voltage signals from the separate ECT sensors which differ by more than a preprogrammed degree, a code P011A will be stored and a malfunction indicator lamp (MIL) may be illuminated. Multiple failure cycles may be required for MIL illumination on certain models."],"symptoms":["Excessive rich or lean exhaust\nRough engine idle (especially at cold start up)\nDiminished fuel efficiency\nDecreased engine performance"],"causes":["Defective ECT sensor\nOpen or shorted ECT sensor wiring or connector\nLow engine coolant condition\nBad thermostat\nFaulty water pump\nAir pocket in engine cooling system\nPCM or PCM programming error"],"type":"ERR"}