{"code":"P011B","description":"Engine Coolant Temperature/Intake Air Temperature Correlation","info":["This generic powertrain diagnostic trouble code (DTC) typically applies to all OBD-II vehicles. That may include but is not limited to vehicles from Toyota, Saab, Honda, GMC, Chevy, Ford, Dodge, Chrysler, Scion, etc. Although generic, the specific repair steps may vary depending on make/model. Anecdotally this code seems more common on Toyota vehicles (Tundra, Tacoma, Corolla, etc.).","When a code P011B is stored in an OBD-II vehicle, it means that the powertrain control module (PCM) has detected a problem with the correlating signals between the engine coolant temperature (ECT) sensor and the intake air temperature (IAT) sensor.","\n ","ECT sensors are normally composed of a thermal resistor that is embedded in a durable resin then surrounded by a brass, aluminum, or plastic housing. The housing is typically fashioned so that it threads into the engine block, radiator, intake manifold (coolant passage), or cylinder head. It is shaped and positioned so that, once the thermostat has opened, engine coolant may flow across the tip. The exposed resistor is near the tip of the sensor.","Increasing engine coolant temperature causes the level of resistance in the ECT resistor to decrease and circuit voltage to increase. The PCM recognizes these variations in ECT voltage as changes in engine coolant temperature.","The ECT sensor provides data to the PCM, for drivability strategy and electronic cooling fan operation. It may also serve to provide a signal to the temperature gauge in the instrument cluster.","The IAT sensor acts in much the same manner as the ECT sensor, except with a much narrower range. It only monitors variations in ambient air as opposed to changes in engine cooling temperature. The IAT sensor is typically positioned so that ambient intake air may be drawn across it as it is enters the engine intake. The IAT sensor is almost always inserted into the air filter housing or air inlet pipe.","If the PCM detects voltage signals from the ECT sensor and the IAT sensor which differ by more than a preprogrammed degree, a code P011B will be stored and a malfunction indicator lamp (MIL) may be illuminated. Multiple ignition cycles, with a failure, will be required for MIL illumination on some vehicles."],"symptoms":["Excessive rich or lean exhaust\nRough engine idle (especially at cold start up)\nDiminished fuel efficiency\nDecreased engine performance\nOther engine temperature codes"],"causes":["Defective ECT/IAT sensor\nOpen or shorted ECT/IAT sensor wiring or connector\nLow engine coolant condition\nBad thermostat\nFaulty water pump\nAir pocket in engine cooling system\nPCM or PCM programming error"],"type":"ERR"}