{"code":"P0127","description":"Intake Air Temperature Too High","info":["This diagnostic trouble code (DTC) is a generic powertrain code, which means that it applies to all 1996-newer vehicles (Dodge, Chrysler, Hyundai, Jeep, Mazda, etc.). Although generic, the specific repair steps may vary depending on make/model.","A stored code P0127 means that the powertrain control module (PCM) has detected an input signal from the intake air temperature (IAT) sensor circuit which is indicative of the temperature or circuit voltage being too high.","\n ","The IAT sensor input and the mass airflow (MAF) sensor input signals are used by the PCM to calculate fuel delivery and ignition timing. Sustaining an air/fuel ratio of 14.7:1 is vital to engine performance and fuel efficiency; therefore the input of the IAT sensor is critical.","The IAT sensor is typically inserted into the air inlet pipe or air cleaner box but it may also be threaded directly into the intake manifold. The IAT sensor may also be integrated into the MAF sensor housing. Regardless of design, it must be positioned so that (with the engine running) ambient air, drawn into the intake manifold through the throttle body, can continuously and consistently flow across it.","The IAT sensor is normally a two-wire thermistor sensor. As varying degrees of air flow across the cold wire element, sensor resistance varies according to temperature. In other words, the more air that flows across the cold-wire element, the lower the degree of temperature and resistance it provides. OBD II equipped vehicles generally use a reference voltage (five-volts is normal) and a ground signal with the IAT sensor completing the circuit. The varying degrees of resistance in the IAT sensor element create voltage fluctuations in the input circuit. These fluctuations are recognized by the PCM as variations in intake air temperature.","If the PCM detects a level of voltage from the IAT sensor that is higher than the maximum allowable limit, a code P0127 will be stored and a malfunction indicator lamp (MIL) may be illuminated."],"symptoms":["Hesitation or surge at idle or upon light acceleration\nDiminished fuel efficiency\nDecreased engine performance (especially on cold start)\nOther drivability codes may also be stored"],"causes":["Possible causes for this code include:","IAT sensor harness has been left unplugged\nOpen or shorted IAT sensor wiring and/or connectors\nDefective IAT sensor\nFaulty MAF sensor\nClogged air filter\nBroken intake air inlet pipe"],"type":"WARN"}