{"code":"P0129","description":"Barometric Pressure Too Low","info":["This diagnostic trouble code (DTC) is a generic powertrain code, which means that it applies to all 1996-newer vehicles (Dodge, Chrysler, Hyundai, Jeep, Mazda, etc.). Although generic, the specific repair steps may vary depending on make/model.","When you find a P0129 code stored in your OBD-II equipped vehicle, it means that the powertrain control module (PCM) has detected a low barometric pressure reading from the barometric pressure sensor (BPS) or the manifold absolute pressure sensor (MAP).","\n ","The barometric pressure sensor lets the PCM monitor changes in atmospheric pressure. Atmospheric pressure is related exactly to the particular degree of altitude, as it applies to your vehicle. This information is used by the PCM to help calculate fuel delivery and ignition timing strategy.","The barometric pressure sensor is usually supplied with a reference voltage signal, a battery ground, and one (or more) output signal circuit/s. The BPS completes the reference voltage circuit and provides the appropriate resistance as determined by actual barometric pressure.","As changes in atmospheric pressure occur, BPS resistance levels react accordingly. Fluctuating resistance in the BPS causes changes in sensor output voltage to the PCM. These changing voltage signals are not only used by the PCM to map fuel delivery and ignition timing strategy but also compared to programmed parameters for code storing.","Because automakers uses varying designs for monitoring barometric pressure, you will need to consult your vehicle information source (All Data DIY is a good one) to determine the exact BPS design of your vehicle. Most manufacturers use a BPS that is separate from the MAP sensor. It is mounted away from the engine and typically has a vacuum hose connected to it.","Some models use a system in which the BPS integrated with the MAP sensor. In this type of system, manifold absolute pressure is usually substituted for barometric pressure and the scanner data stream will reflect this terminology.","If the PCM detects a BPS input signal that varies from comparison data by more than the programmed limit, a P0129 will be stored and a MIL will possibly be illuminated."],"symptoms":["Excessively rich fuel delivery conditions\nGeneral lack of engine performance\nHesitation upon acceleration\nBlack smoke from exhaust\nDiminished fuel efficiency"],"causes":["Possible causes for this code include:","Corroded connector face at the MAF/BPS sensor\nInsufficient engine vacuum due to engine wear, an ignition misfire or clogged catalytic converter\nFaulty BPS\nOpen or shorted wiring for the MAP sensor and/or the BPS\nInsufficient system ground at the MAF/BPS\nDefective PCM or PCM programming error"],"type":"WARN"}