{"code":"P0148","description":"Fuel Delivery Error","info":["This diagnostic trouble code (DTC) is a generic powertrain code, which means that it applies to OBD-II equipped vehicles (Dodge, Ram, Ford, GMC, Chevrolet, VW, Audi, etc.). Although generic, the specific repair steps may vary depending on make/model.","Whenever I have been faced with diagnosing a stored code P0148, it has always meant that the powertrain control module had detected a problem in the high pressure fuel delivery system of a diesel engine.","\n ","Clean burning diesel engines use an extremely high degree of fuel pressure. It is strongly recommended that only qualified technicians attempt to diagnose and repair these types of systems. Keep in mind that some states demand that only individuals who have been certified as diesel repair technicians repair high pressure diesel fuel systems. Check your state and local ordinances before proceeding. Don’t say I didn’t warn you.","The diesel fuel supply pump creates the high pressure required for the direct injection system. An electronically controlled (by the PCM or fuel injection controller) fuel control actuator (FCA) is responsible for regulating fuel pressure to the high pressure chambers of the engine. A fuel pressure sensor (usually located near the FCA) allows the PCM to monitor fuel pressure when the engine is running.","If the PCM detects an input signal from the fuel pressure sensor which indicates that fuel pressure is not within a specified range (too low or too high), a code P0148 will be stored and a malfunction indicator lamp may be illuminated.\n"],"symptoms":["Decreased fuel efficiency\nDiminished engine performance\nExcessive black smoke from exhaust\nThe strong odor of diesel fuel\nOther fuel and engine drivability related codes may be stored"],"causes":["Potential causes for this code to set are:","High pressure fuel system leak\nDefective fuel pressure sensor\nFaulty fuel control actuator\nOpen or shorted high pressure fuel supply system wiring and/or connectors\nBad fuel pump\nMalfunctioning fuel pump or PCM power supply relay\nPCM or PCM programming error"],"type":"ERR"}