{"code":"P0152","description":"O2 Sensor Circuit High Voltage (Bank 2 Sensor 1)","info":["This diagnostic trouble code (DTC) is a generic powertrain code, which means that it applies to OBD-II equipped vehicles. Although generic, the specific repair steps may vary depending on make/model.","The o2 (oxygen) sensors basically measure oxygen content in the exhaust. The PCM (powertrain control module) then uses this information to regulate fuel injector pulse. The o2 sensors are very important to proper operation of the engine. Problems with them can cause the PCM to add or take away too much fuel based on the faulty o2 sensor voltage.","\n ","A P0152 code refers to the Bank 2, sensor 1, o2 sensor. (Bank 1 would contain cylinder 1 and bank 2 is the opposite bank. Bank 2 doesn't necessarily contain cylinder 2.) \"Bank 2\" refers to the side of the exhaust that DOES NOT contain cylinder number 1 and \"Sensor 1\" indicates that it is the pre-cat sensor, or forward(first) sensor on that bank. It is a four wire sensor. The PCM supplies a ground circuit and a reference voltage of about .5 volts on another circuit. Also for the o2 heater there is a battery voltage supply wire and another ground circuit for that. The o2 sensor heater allows the o2 sensor to warm up faster, thus achieving closed loop in less time than it would normally take for the exhaust to warm the sensor up to operating temperature.","The O2 sensor varies the supplied reference voltage based on oxygen content in the exhaust. It is capable of varying from .1 to .9 volts, .1 indicating lean exhaust and .9 indicating rich exhaust. NOTE: A condensed explanation of fuel trims: If the o2 sensor indicates that the oxygen voltage reading is .9 volts or high, the PCM interprets this as a rich condition in the exhaust and as a result decreases the amount of fuel entering the engine by shortening injector \"on time\". The STFT (short term fuel trims) would reflect this change. The opposite would occur when the PCM sees a lean condition. The PCM would add fuel which would be indicated by a single digit positive STFT reading. On a normal engine the front o2 sensors switch rapidly back and forth two or three times per second and the STFT would shift positive and negative single digits to add and remove fuel to compensate at a similar rate. This little \"dance\" goes on to keep the air/fuel ratio at it's optimal level. Short term fuel trims or STFT reflect immediate changes in fuel injector \"on-time\" while long term fuel trims or LTFT reflect changes in fuel over a longer period of time. If your STFT or LTFT readings are in the positive double digits (ten or above), this indicates the fuel system has been adding an abnormal amount of fuel than is necessary to keep the proper air/fuel ratio. It may be overcompentsating for a vacuum leak or a stuck lean o2 sensor, etc. The opposite would be true if the fuel trim readings are in the negative double digits. It would indicate that the fuel system has been taking away excessive amounts of fuel, perhaps to compensate for leaking injectors or a stuck rich o2 sensor, etc. So when experiencing o2 related issues, reading your fuel trims can indicate what the PCM has been doing over the long term and short term with regard to fuel.","This code indicates that the o2 sensor was stuck too high or in the rich position. The PCM monitors this voltage and if it determines that the voltage is too high out of range for too long, P0152 may set."],"symptoms":["MIL (Malfunction Indicator Lamp) illumination\nEngine may run very rough\nEngine may be running lean or rich depending on if the o2 sensor is reading correctly or incorrectly\nLack of power\nIncreased fuel consumption"],"causes":["Potential causes of an P0152 code include:","Bad bank 2, 1 o2 sensor incorrectly reading rich condition\nEngine running rich and o2 sensor\nCorrectly reading rich condition\nSignal shorted to voltage in harness\nWiring harness damage/melted due to contact with exhaust components\nVacuum leak (make have lean codes (P0171, P0174) present with it)\nLeaking injectors\nBad fuel pressure regulator\nBad PCM"],"type":"WARN"}