{"code":"P0168","description":"Fuel Temperature Too High","info":["This diagnostic trouble code (DTC) is a generic powertrain code, which means that it applies to OBD-II equipped vehicles (Dodge, Ram, Ford, GMC, Chevrolet, VW, Toyota, etc.). Although generic, the specific repair steps may vary depending on make/model.","I have discovered that when an OBD II vehicle has stored a code P0168, it means that the powertrain control module (PCM) has detected a voltage signal from the fuel temperature sensor/fuel composition sensor or circuit that indicates fuel temperature is too high.","\n ","The fuel temperature sensor is usually integrated into the fuel composition sensor. It is a small computerized device (that resembles a fuel filter) designed to provide the PCM with an accurate fuel composition and fuel temperature analysis.","Fuel which passes through the inline sensor is electronically analyzed to determine the degree of ethanol, water, and unknown contaminants (non-fuel) found therein. The fuel composition sensor not only analyzes fuel composition but also measures fuel temperature and inputs an electrical signal to the PCM that reflects not only what contaminants are present (and to what degree the fuel has been contaminated) but also the temperature of the fuel. The degree of fuel contamination is analyzed, according to the percentage of contaminants to fuel; generating a voltage signature in the fuel composition/temperature sensor.","The voltage signature is input to the PCM as square waveforms of voltage. Waveform patterns vary in frequency depending upon the degree of contamination present in the fuel. The closer the waveform frequency, the higher the degree of fuel contamination; this composes the vertical portion of the waveform. The fuel composition sensor analyzes the amount of ethanol present in fuel separately from other contaminants. Pulse width, or the horizontal portion of the waveform, is indicative of the voltage signature created by fuel temperature. The higher the temperature of the fuel passing through the fuel temperature sensor; the more rapid the pulse width. Typical pulse width modulation varies between one and five-milliseconds or hundredths-of-a-second.","If the PCM detects an input signal from the fuel temperature/composition sensor that indicates that fuel temperature is too high, a P0168 code will be stored and a malfunction indicator lamp (MIL) may be illuminated. Multiple ignition cycles (with a failure) may be required for MIL illumination on certain models.\n"],"symptoms":["Usually no symptoms accompany a code P0168\nOther fuel composition codes may be present\nMIL illumination will eventually occur"],"causes":["Potential causes for this code to set are:","Defective fuel composition/temperature sensor\nA bad ambient temperature sensor\nFaulty intake air temperature sensor\nOpen, shorted, or damaged wiring or connectors\nPCM or a PCM programing error"],"type":"WARN"}