{"code":"P0163","description":"O2 Sensor Circuit Low Voltage (Bank 2 Sensor 3)","info":["This diagnostic trouble code (DTC) is a generic powertrain code, which means that it applies to OBD-II equipped vehicles. Although generic, the specific repair steps may vary depending on make/model.","This code refers to a fault in one of the post-catalyst O2 sensors on Bank 2. This oxygen sensor is used for a specific purpose. This is it in a nutshell: The Catalytic Converter is used to help control emissions, to \"clean up\" the exhaust gasses. The PCM (Powertrain Control Module) uses the signal from post catalyst heated oxygen sensors to monitor the catalyst's efficiency by comparing it to the O2 sensors in front of the catalyst. If the PCM sees little or no difference between the exhaust quality in post- and pre- catalyst sensors then it knows that the catalyst is not working properly.","\n ","To over simplify: a post-cat sensor's main job is to monitor catalyst efficiency, not control fuel management. If you have a P0163, that doesn't mean your catalyst is bad (in fact, it usually never does). This code basically means that the Bank 2, Sensor 3 (or third o2 sensor back on bank 2) signal voltage is below what is considered normal for that sensor. It's a four wire sensor being supplied a 0.5 volt reference voltage on the signal wire and a ground, as well as a power and ground circuit for the o2 sensor heater element. Changes in oxygen content cause resistance changes inside the sensor. This changing resistance affects the 0.5 volts on the signal/reference circuit.","A heated o2 sensor is capable of switching between 0.1 volts and 0.9 volts with 0.1 volts indicating lean and 0.9 volts indicating rich. However, a properly working post-catalyst sensor will exhibit small changes at a slower rate than front (pre-catalyst) O2 sensors. It may switch slightly above and below 0.45 volts at the rate of about 1 switch per second or less. The PCM monitors this signal change to determine if the catalyst is working properly. If the PCM determines that the Bank 2,3 O2 sensor signal voltage is below a certain threshold for too long, P0163 will set."],"symptoms":["Rear O2 sensor problems won't usually cause drivability issues since they are an input that measures catalyst efficiency (unlike front O2 sensors). However if you have other codes present, like lean codes or pre-O2 sensor codes, then they may cause drivability problems. The following symptoms may be present:","MIL (Malfunction Indicator Lamp) illumination\nEngine performance issues\nEngine running rough\nEngine running rich (only if PCM is trying to add fuel to compensate for low O2 sensor voltage reading)\nEngine running lean (only if vacuum leak is large enough that PCM can't compensate by adding fuel)\nPoor idle"],"causes":["Potential causes of a P0163 code include:","Air leaks in exhaust in front of O2 sensor giving false reading\nEngine running excessively lean\nO2 sensor connector damaged/corroded\nO2 sensor signal circuit is shorted to ground\nO2 sensor ground circuit is open\nO2 sensor has failed (it may be contaminated with fuel or coolant)\nPCM has failed"],"type":"WARN"}