{"code":"P0170","description":"Fuel Trim Malfunction (Bank 1)","info":["This diagnostic trouble code (DTC) is a generic powertrain code, which means that it applies to OBD-II equipped vehicles. Although generic, the specific repair steps may vary depending on make/model.","This code is one that surfaces with certain makes of automobiles more than others. In writing this article I've added Mercedes-Benz-specific info since it seems that M-B (and VW) are most prone to having this P0170 surface along with misfire codes or other fuel trim codes. P0170 means there was a malfunction in the computer's control of the air:fuel ratio.","\n ","It also indicates that the fuel trims reached their limit of adding fuel while trying to compensate for a actual or perceived rich condition. When the fuel trims reach their rich correction limit, the PCM (Powertrain Control Module) sets a P0170, indicating a problem or malfunction in the fuel trims. It may also have a P0173 referring to the same malfunction but on bank two."],"symptoms":["MIL (Malfunction Indicator Lamp) Illumination\nStart and stall\nPoor fuel economy\nBlack smoke at tailpipe\nHesitation/misfire at idle or under load"],"causes":["Potential causes include a vacuum leak, unmetered air leaks Fuel saturated engine oil Leak in turbo air charge hoses (if equipped) Possibly bad O2 sensor (If Mercedes, may require adaptation with M-Benz compatible scan tool.) Oil contamination in MAF connector or O2 sensor connectors. Also check ignition coils, cam and crank sensors, and oil sensor for leakage contributing to oil intrusion in wiring harness. Defective MAF (Mass Air Flow) sensor (especially on Mercedez-Benz and other European autos. There are a lot of problems with aftermarket MAF sensors.) Defective fuel pressure regulator Leaking camshaft adjuster solenoids (Mercedes-Benz).","NOTE: for some Mercedes-Benz models there is a service recall for a crankcase vent hose located under the intake manifold. It should be checked for leaks/cracking and also operation of check valve in the hose. The check valve should flow only one way."],"type":"ERR"}