{"code":"P0174","description":"System Too Lean (Bank 2)","info":["This diagnostic trouble code (DTC) is a generic powertrain code, which means that it applies to OBD-II equipped vehicles. Brands of vehicles affected include but are not limited to Ford, Lexus, Chevy, BMW, Toyota, Jaguar, Acura, Volvo, Nissan, etc. Although generic, the specific repair steps may vary depending on make/model/engine. Anecdotally this code seems more common in Ford & Chevy vehicles.","Every vehicle has a PCM or ECM (powertrain / engine control module). It's basically the \"brain\" or main computer of the vehicle, it's job is to monitor a variety of sensor readings and use that information to run the engine in the most efficient operation given the current conditions.","Basically this P0174 code means that the upstream oxygen sensor in bank 2 reporting a lean condition (too much oxygen in the exhaust). On V6/V8/V10/V12 engines, Bank 2 is the side of the engine that doesn't have cylinder #1.","The engine uses what are called O2 or oxygen sensors in the exhaust stream to determine the air to fuel ratio of the exhaust leaving the engine. The PCM (or ECM) uses that information to determine how much fuel to inject via the fuel injectors many times per second. The ideal air:fuel ratio is 14.7:1. The PCM can adjust the amount of fuel by adding more fuel or taking away fuel to keep the engine operating efficiently and with low emissions.","If an O2 sensor is telling the PCM through it's reading that the exhaust has too much air in it, the PCM compensates by adding more fuel. In this case it's adding more fuel to bank 2. The PCM will only adjust up to a certain point to the amount of fuel that it will inject in an attempt to bring that air:fuel ratio as close to optimal as possible. When the PCM has reached it's limit on how much fuel it will inject but the front (upstream) bank 2 oxygen sensor still detects a lean condition, the PCM will continue to command a higher than normal amount of fuel to bank 2 and will trigger this code and illuminate the MIL (malfunction indicator lamp).","P0174 code shown on scanner:\n","So there's an interesting point to be made now, though. This code could be set because the PCM thinks it's sending more fuel to bank 2 injectors but in reality they're not actually putting out more fuel. So in other words this code could be set due to a fueling problem. Additional possible causes for this code are listed a little further down in this article.","Note: This DTC is very similar to P0171 which is a lean code for bank 1, and in fact your vehicle may show both codes at the same time. In the case of some Ford's (e.g. 4.6L or 5.4L V8's) it's common to see P0171 and P0174 at the same time."],"symptoms":["You will more than likely not notice any drivability problems as a result of a P0174, although there may be symptoms such as:","lack of power\nincreased fuel consumption\ndetonation (spark knock)\nhesitation/surge on acceleration"],"causes":["A code P0174 may mean that one or more of the following has happened:","The MAF (Mass Air Flow) Sensor is dirty or faulty (if equipped). Note: The use of \"oiled\" air filters can cause the MAF to become contaminated if the filter is over-oiled. There is also an issue with some vehicles where the MAF sensors leak the silicone potting material used to protect the circuitry.\nThere could be a vacuum leak downstream of the MAF sensor\nFuel problem (rail/injectors/pump/regulator)"],"type":"ERR"}