{"code":"P018F","description":"Fuel System Over Pressure Relief Valve Frequent Activation","info":["This is a generic powertrain diagnostic trouble code (DTC) and applies to OBD-II vehicles. That may include but is not limited to vehicles from Dodge, Toyota, Ford, Honda, Chevrolet, Dodge, Ram, etc. Although generic, the exact repair steps may vary depending on year, make, model and powertrain configuration.","\n ","If your vehicle has stored a code P018F, it means that the powertrain control module (PCM) has detected a problem with the fuel pressure relief valve.","In this case, it means that the PCM has noticed an over active fuel pressure release valve. This valve is designed to relieve fuel pressure in the event that it reaches an excessive amount.","In most cases, the fuel pressure relief valve is actuated using a solenoid that is controlled by the PCM. The valve is typically located on the fuel injection rail or the fuel supply line. The PCM monitors an input signal from the fuel pressure sensor to determine if fuel pressure relief valve operation is required. When fuel pressure is relieved, excess fuel is rerouted back to the fuel storage tank via a specially designed return hose. When fuel pressure exceeds a programmed limit, the PCM applies voltage and/or ground to the valve for a length of time substantial enough to initiate operation and allow fuel pressure to subside to an acceptable degree.","If the PCM detects an unusual number of requested fuel pressure relief valve activations, over a set period of time, a code P018F will be stored and a malfunction indicator lamp (MIL) may be illuminated. Some applications may require multiple ignition cycles (with a failure) in order for MIL illumination to occur."],"symptoms":["Rich exhaust conditions\nRough idle; especially upon cold start\nDiminished fuel efficiency\nEngine misfire codes due to fouled spark plugs"],"causes":["Bad fuel pressure sensor\nDefective fuel pressure regulator\nInsufficient vacuum to the fuel pressure regulator\nOpen or shorted fuel pressure sensor or electronic fuel pressure regulator circuits\nFaulty PCM or a PCM programming error"],"type":"ERR"}