{"code":"P0186","description":"Fuel Temperature Sensor B Circuit Range/Performance","info":["This diagnostic trouble code (DTC) is a generic powertrain code, which means that it applies to OBD-II equipped vehicles (Nissan, Ford, Fiat, Chevrolet, Toyota, Dodge, etc.). Although generic, the specific repair steps may vary depending on make/model.","When I come across a code P0186, I know that it means that the powertrain control module (PCM) has detected a voltage signal from the fuel temperature sensor (or circuit) that is not within a programmed range. \"B\" refers to an area of circuitry as opposed to a particular circuit or component.","\n ","The fuel temperature sensor is typically integrated into the fuel composition sensor. Designed to provide the PCM with an accurate composition and fuel temperature reading, the fuel composition sensor is a small, computerized device placed in-line between the fuel tank and the fuel rail.","As fuel passes through the sensor, it is monitored to determine how much ethanol, water, and other contaminants are present. An electrical signal to the PCM reflects not only what contaminants are present but also to what degree the fuel has been contaminated. The level of contamination is measured according to the percentage of contaminants (to fuel) and is input to the PCM as square waveforms. The closer the waveform frequency, the higher the percentage of fuel contamination. Frequency could also be described as the vertical portion of the waveform. The fuel composition sensor measures the amount of ethanol present in the fuel differently than other contaminants. Fuel composition levels that are as high as eighty-five-percent ethanol are acceptable in flex fuel vehicles.","The pulse width, or the horizontal portion of the waveform, is indicative of fuel temperature. The broader the pulse width, the higher the temperature of the fuel passing through the fuel composition sensor. On most models, pulse width modulation varies between one and five-milliseconds (hundredths-of-a-second).","If the PCM detects an input signal from the fuel composition sensor, indicating that the fuel temperature is not within a programmed range or if the fuel temperature varies by a greater degree than expected from ambient temperature, a P0186 code will be stored and a malfunction indicator lamp (MIL) may be illuminated. Multiple ignition cycles (with a failure) may be required for MIL illumination in some applications."],"symptoms":["There may be no symptoms\nOther fuel composition codes may be present\nPossibly MIL illumination"],"causes":["Potential causes for this code to set are:","A bad ambient temperature sensor B\nDefective fuel temperature/composition sensor\nFaulty intake air temperature sensor\nOpen, shorted, or damaged wiring or connectors\nPCM or a PCM programing error"],"type":"ERR"}