{"code":"P0187","description":"Fuel Temperature Sensor B Circuit Low Input","info":["This diagnostic trouble code (DTC) is a generic powertrain code, which means that it applies to OBD-II equipped vehicles (Nissan, Ford, Fiat, Chevrolet, Toyota, Dodge, etc.). Although generic, the specific repair steps may vary depending on make/model.","In my experience, a stored code P0187 means that the powertrain control module (PCM) has detected a voltage signal from the fuel temperature sensor (or circuit) that is lower than expected. The fuel temperature sensors (with which I have dealt) have been integrated into the fuel composition sensor. \"B\" refers to an area of circuitry as opposed to a particular circuit or component.","\n ","The fuel composition sensor is designed to provide the PCM with an accurate fuel composition and fuel temperature analysis. Usually small in size, the fuel composition sensor is a computerized device found in-line between the fuel tank and the fuel rail.","The percentage of ethanol, water, and other contaminants in fuel are monitored by the fuel composition sensor as they pass through. Square waveform voltage representations are input to the PCM according to the level of contamination in the fuel. Shorter waveform frequency indicates a high percentages of fuel contamination. Waveform frequency could also be described as the vertical posting of the pattern.","The percentage of ethanol present in the fuel is typically categorized independently of other contaminants. Flex fuel vehicles can function efficiently even if fuel composition levels are as high as eighty-five-percent ethanol. Fuel temperature is computed as pulse width or the horizontal portion of the waveform. The wider the pulse width signal, the higher the temperature of the fuel passing through the fuel composition sensor. Most systems utilize a pulse width that varies between one and five-milliseconds (hundredths-of-a-second).","If the fuel temperature is not within a specified range, or if the fuel temperature is much lower than ambient temperature, a P0187 code will be stored and a malfunction indicator lamp (MIL) may be illuminated. Some vehicles will require multiple ignition cycles (with a failure) for MIL illumination."],"symptoms":["Possible MIL illumination\nThere may be no obvious symptoms\nOther fuel composition codes may be present"],"causes":["Potential causes for this code to set are:","Faulty intake air temperature sensor\nA bad ambient temperature sensor\nDefective fuel temperature/composition sensor\nOpen, shorted, or damaged wiring or connectors\nPCM or a PCM programing error"],"type":"WARN"}