{"code":"P2108","description":"Throttle Actuator Control Module Performance","info":["This generic powertrain diagnostic trouble code (DTC) typically applies to all OBD-II equipped vehicles that use a drive-by-wire throttle control system including but not limited to vehicles from VW, Chevy, Ford, Mazda, Volvo, Dodge, Audi, Alfa-Romeo, Cadillac, Toyota, etc.","The P2108 OBD-II trouble code is one of number of possible codes that indicates that the Powertrain Control Module (PCM) has detected a malfunction with the operation of the Throttle Actuator Control System.","\n ","There are six codes that are associated with Throttle Actuator Control System malfunctions and they are P2107, P2108, P2111, P2112, P2118 and P2119. Code P2108 is set by the PCM when the Throttle Actuator Control System Module Processor has a malfunction associated with performance.","The PCM controls the Throttle Actuator Control System by monitoring one or more throttle position sensors. The operation of the throttle body is determined by the position of the throttle plate that is controlled by one or more Throttle Actuator Control Motors. The PCM also monitors the accelerator pedal position sensor to determine how fast the driver wants to go and then determines the appropriate throttle response. The PCM accomplishes this by a changing current flow to the Throttle Actuator Control Motor that moves the throttle plate to the desired position. Some malfunctions will cause the PCM to restrict the operation of the Throttle Actuator Control System. This is known as fail-safe or limp mode where the engine is held at idle or may not start at all."],"symptoms":["Engine will not start\nPoor performance that progresses\nLittle, or no throttle response\nCheck Engine Light illuminated\nSmoke from tailpipe\nIncreased fuel consumption"],"causes":["Possible causes of this code may include:","Faulty throttle body\nDirty throttle plate or linkage\nFaulty throttle position sensor\nDefective accelerator pedal position sensor\nThrottle actuator control motor is defective\nCorroded or damaged connector\nFaulty or damaged wiring\nFaulty PCM"]}