{"code":"P2104","description":"Throttle Actuator Control System - Forced Idle","info":["This generic powertrain diagnostic trouble code (DTC) typically applies to all OBD-II equipped vehicles that use a drive-by-wire throttle control system including but not limited to vehicles from Ford, GM, Toyota, Dodge, Chevy, Subaru, etc. Anecdotally this code seems to be a a lot more common on Ford vehicles compared to other brands.","The P2104 OBD-II trouble code is one of number of possible codes that indicates that the Powertrain Control Module (PCM) has detected a malfunction and is limiting the operation of the Throttle Actuator Control System","\n ","This situation is known as activating a fail-safe or limp mode to prevent the engine from accelerating until this malfunction is corrected and the associated code is cleared. There are four codes that are referred to as force codes and they are P2104, P2105, P2106 and P2110.","The PCM sets these when other codes are present that indicate an issue that may be safety related or cause damage to the engine or drivetrain components if not corrected in a timely manner.","Code P2104 is set by the PCM to force the Throttle Actuator Control System to remain at idle.","This code can be related to a Throttle Actuator Control System malfunction, but normally another issue is setting this code. Trouble code P2104 is triggered by the PCM when it receives an abnormal signal from various components. The Throttle Actuator Control System is duty cycle controlled by the PCM and the function of the system is limited when other fault codes are detected."],"symptoms":["Engine will not start\nLittle or no throttle response\nCheck Engine Light illuminated\nABS Light illuminated\nAutomatic transmission will not shift\nAdditional codes are present"],"causes":["The most common situations that set this code and place the engine in fail-safe or limp mode to indicate an issue and act as a red flag are:","Engine Overheating\nCoolant Leaks\nEGR Valve Malfunction\nMass Air Flow Sensor Malfunction\nDrive Axle Modifications\nABS, Traction Control or Stability Control Failures\nAutomatic Transmission Problems\nAbnormal System Voltages"]}