{"code":"P212E","description":"Throttle Position Sensor/Switch \"G\" Circuit Intermittent","info":["This diagnostic trouble code (DTC) is a generic powertrain code, which means that it applies to all 1996-newer vehicles (Dodge, Chrysler, Hyundai, Jeep, Mazda, etc.). Although generic, the specific repair steps may vary depending on make/model.","In my own personal experience, I have found that a stored P212E code means that the powertrain control module (PCM) has detected an intermittent malfunction in the circuit for the \"G\" throttle position sensor (TPS) circuit.","\n ","The TPS is typically a potentiometer type sensor that completes a five-volt reference circuit. The TPS is mechanically actuated using an extension of the throttle plate shaft or a specially designed tab on the sensor. As the throttle is opened and closed, contacts in the sensor are dragged across a circuit board, varying sensor resistance. As sensor resistance is changed, TPS circuit voltage fluctuates. The PCM recognizes these fluctuations as varying degrees of throttle plate actuation.","The PCM uses input voltage signals from the TPS to calculate fuel delivery and ignition timing. It also uses TPS input data to monitor intake air flow, exhaust oxygen content, exhaust gas recirculation (EGR) function, and engine load percentage.","If the PCM detects a certain number of intermittent or erratic signals from the TPS, over a set period of time, and under a programmed set of circumstances, a code P212E will be stored and a malfunction indicator lamp (MIL) may be illuminated."],"symptoms":["Hesitation upon acceleration\nBlack smoke from engine exhaust (especially on start up)\nDelayed engine startup (particularly on cold start)\nDiminished fuel efficiency\nStored emissions related codes may accompany a P212E"],"causes":["Possible causes for this engine code include:","Defective or misadjusted TPS\nOpen or shorted TPS \"G\" wiring or connectors\nBinding or damaged throttle plate\nBad PCM or a PCM programming error"]}