{"code":"P2128","description":"Throttle/Pedal Position Sensor/Switch \"E\" Circuit High Input","info":["This diagnostic trouble code (DTC) is a generic powertrain code, which means that it applies to OBD-II equipped vehicles. Although generic, the specific repair steps may vary depending on make/model.","When I have encountered a stored code P2128, I have found that it means the powertrain control module (PCM) has detected a high voltage input from the throttle position sensor (TPS) circuit or a particular pedal position sensor (PPS) circuit. The \"E\" refers to a particular circuit, sensor, or area of a particular circuit.","\n ","Consult a reliable vehicle information source (All Data DIY will work) for particulars for the vehicle in question. This code is only used in vehicles that are equipped with drive by wire (DBW) systems.","The PCM controls the DBW system using a throttle actuator motor, one or more pedal position sensors (sometimes referred to as accelerator pedal position sensors), and multiple throttle position sensors. The sensors are provided with a reference voltage (typically 5-volts) and a ground. Most TPS/PPS sensors are of the potentiometer type and they complete the respective circuit. A pivoting fulcrum extension, on the accelerator pedal or the throttle plate shaft, actuates the contacts of the sensor. Sensor resistance changes, as the contacts are moved across the sensor circuit board, causing variations in circuit resistance and signal input voltage to the PCM.","If signal input voltage is greater than a programmed limit, for an extended period of time and under a certain set of circumstances, a code P2128 will be stored and a malfunction indicator lamp (MIL) may be illuminated."],"symptoms":["Stuck throttle (at any RPM)\nLimited or no acceleration\nEngine stall when allowed to idle\nHesitation when accelerating\nCruise control inoperative"],"causes":["Possible causes for this engine code include:","Open or shorted circuits between the TPS, PPS, and the PCM\nDefective TPS or PPS\nCorroded electrical connectors\nFaulty drive-by-wire actuator motor"]}