{"code":"P213F","description":"Fuel Pump System Fault - Forced Engine Shutdown","info":["This is a generic diagnostic trouble code (DTC) and typically applies to OBD-II vehicles. Vehicle makes may include but aren't limited to Chevrolet / Chevy, Land Rover, GM, etc.","\n ","When a code P213F has been stored in an OBD-II vehicle, it means that the powertrain control module (PCM) has detected a problem in the fuel pump/supply system and the engine has undergone a forced shutdown. This code may be caused by either a mechanical issue or an electrical malfunction.","Typically, this code will need to be cleared before the engine will start.","Use caution when attempting to diagnose any high pressure fuel system related codes. Follow manufacturer's recommendations carefully and always use the appropriate safety equipment. The fuel system should only be opened in a well ventilated area away from open flame or spark.","The PCM relies on input signals from the fuel pressure sensors, fuel volume sensors, and the electronic fuel pressure regulator to effectively control fuel delivery to the engine. Where it pertains to emergency engine shutdown, the fuel delivery system is usually divided into two sections. The fuel supply section encompasses the fuel pump (or pumps) and all supply lines up to the electronic fuel injection common rail or direct injection lines. The fuel injection system contains the fuel rail and all the fuel injectors.","In this type of system, multiple fuel pressure and fuel volume sensors may be incorporated.","These sensors are positioned in strategic areas of the fuel delivery system and designated with a character of the alphabet. For instance, in a vehicle with a gasoline powered engine a voltage signal from fuel pressure sensor (A) in the fuel supply section would be compared (by the PCM) with a voltage signal from fuel pressure sensor (B) in the fuel injection system, whenever the key is on and the engine is running (KOER). If the PCM detects a variation between fuel pressure sensors A and B that exceeds the maximum threshold for more than a specified amount of time, voltage to the fuel pump will be interrupted (injector pulse may be deactivated as well) and the engine will be shut down.","Vehicle applications with diesel propulsion are setup slightly differently. Since the diesel fuel injection system requires much higher levels of fuel pressure in the fuel injection quadrant than in the fuel supply quadrant, no comparison is made between the fuel supply pressure sensor and the fuel injection pressure sensor. Instead, the PCM monitors each fuel delivery quadrant independently and shuts the engine off if a malfunction is detected. The area of the malfunction determines which code is stored.","In either case, if the PCM detects a degree of fuel injection system pressure deviation which warrants engine shut down, a code P213F will be stored and a malfunction indicator lamp (MIL) may be illuminated.\nGasoline and diesel applications may also monitor fuel delivery component voltage. These components usually include fuel pumps and fuel injectors. Each component is expected to draw a certain amount of voltage under a specific load. If the fuel delivery component in question draws an excessive degree of voltage under a certain percentage of maximum load, the engine may be shut down and a code P213F may be stored. In this type of system, an additional code indicating a specific cylinder will also be stored. When the PCM detects an overloaded component or circuit, a code P213F is stored and a service engine soon lamp illuminated.","A fuel pump, one of the main components of a fuel injection system:\n"],"symptoms":["No start condition\nFuel leaks\nAdditional drivability and fuel system codes"],"causes":["Defective fuel pump\nClogged fuel filter\nFuel leak\nFaulty fuel pressure sensor\nBad fuel pressure/volume regulator\nPCM failure or PCM programming error"]}