{"code":"P2139","description":"Throttle/Pedal Pos Sensor/Switch D / F Voltage Correlation","info":["This diagnostic trouble code (DTC) is a generic powertrain code. It is considered generic because it applies to all makes and models of vehicles (1996-newer), although specific repair steps may be slightly different depending on the model.","The automotive trouble code P2139 throttle/pedal position sensor/switch D/F voltage correlation refers to a problem related to the throttle's ability to open and close properly.","\n ","In the 1990's automotive manufacturers began industry-wide installation of \"Drive by wire\" throttle control technology. It's mission is to afford greater control over the emissions, fuel economy, traction and stability control, cruise control and transmission responses.","Prior to this, the vehicle's throttle was controlled by a simple cable with a direct connection between the gas pedal and the throttle. A throttle position sensor (TPS) is situated opposite the throttle linkage connection on the throttle plate. The TPS converts throttle movement and position to a voltage signal and sends it to the engine management computer, which uses the varying voltage signal to form engine management strategy.","The new \"electronic throttle control\" technology consists of a accelerator pedal position sensor, an electronically controlled throttle body complete with an internal motor, two embedded throttle position sensors for correlation factors and the engine management computer.","Although the code has the same frame of reference, it is worded slightly different on some brands, such as \"Throttle position sensor circuit range/performance\" on an Infiniti or \"Electronic throttle control system malfunction power management\" on a Hyundai.","When you depress the accelerator pedal you are pushing down on a sensor indicating the desired amount of throttle opening which is sent to the engine management computer. In response the computer sends a voltage to the electric motor to open the throttle plate. Two throttle position sensors imbedded in the throttle body convert the amount of throttle opening to a voltage signal to the computer.","Photo of a throttle body, throttle body position (TPS) sensor is the black part to the lower right:\n","The computer monitors the correlation of both voltages. When both voltages agree, the system is functioning properly. When they deviate for two seconds, the code P2139 is set indicating a malfunction somewhere in the system. Additional trouble codes may accompany this code which further identify the problem. The bottom line is, it can be a dangerous situation when control over the throttle is lost.","Here is a photo of an accelerator pedal complete with attached sensor & wiring:","\nPhoto used with permission by Panoha (Own work) [GFDL, CC-BY-SA-3.0 or FAL], via Wikimedia Commons","NOTE: This P2139 DTC is basically the same as P2135, P2136, P2137, P2138, and P2140, diagnostic steps will be the same for all codes."],"symptoms":[],"causes":["It's been my experience that the wiring connector or \"pig tail\" on the throttle body gives problems in the form of a poor connection.The female terminals on the pigtail corrode or pull out of the connector.\nPossible bare wire on pigtail shorting to ground.\nThe top cover on the throttle body distorted preventing the gears from turning properly.\nThe electronic throttle body is faulty.\nThe accelerator pedal sensor or its wiring failed.\nThe engine management computer has failed.\nThe TPS sensors were not correlating for a few seconds and the computer needs to be cycled through its relearn phase to restore active response to the throttle body, or the computer needs reprogramming at the dealer."]}