{"code":"P2144","description":"Exhaust Gas Recirculation Vent Control Circuit Low","info":["This is a generic powertrain diagnostic trouble code (DTC) and typically applies to OBD-II vehicles. Vehicle makes may include but aren't limited to Citroen, Peugeot, Sprinter, Pontiac, Mazda, Chevy, GMC, Ford, Dodge, Ram, etc.","\n ","EGR (Exhaust gas recirculation) systems are constantly being monitored and adjusted by the ECM (Engine control module) while we are driving our vehicles. The EGR systems allows your vehicle's engine to reuse air/fuel mixtures that have gone through the combustion process but has yet to burn completely and efficiently. By the EGR recycling this \"semi-burnt\" mixture and reintroducing it to the engine, it single handedly increases fuel economy, not to mention improved overall vehicle emissions as well.","These days, most EGR valves are controlled electronically via electrical solenoids, mechanically via vacuum controlled solenoids and various other possible ways depending on your make and model. The EGR vent solenoid is mainly used to discard unneeded recyclable exhaust. Typically they vent this un-recycled exhaust back into the exhaust system to vent into the atmosphere after passing through the catalytic converters, resonators, mufflers, etc. It is important to note that the catalytic converter will burn most of the unburnt fuel present to prevent from spiking the vehicle's emissions. The exhaust gas recirculation vent control circuit may be referring to one particular wire that is causing the fault, make sure to refer to your service manual to pinpoint what physical circuit you are working with here.","While monitoring and adjusting numerous sensors, switches, not to mention other systems, the ECM (engine control module) has activated P2144 and/or related codes (P2143 and P2145) to let you know there is a problem with your exhaust gas recirculation vent control circuit.","With P2144, it means a low voltage condition has been detected within the EGR exhaust gas recirculation vent control electrical circuit."],"symptoms":["Decreased engine power\nRough engine idle\nPoor acceleration\nPoor fuel economy\nCEL (check engine light) on\nEngine misfire-like symptom"],"causes":["Dirty/clogged EGR (exhaust gas recirculation valve)\nEGR vent solenoid defective\nEGR vent plugged\nVacuum leak\nKinked vacuum line\nConnector issue\nWiring issue (open, corroded, chafed, short, etc.)\nECM issue"]}