{"code":"P215A","description":"Vehicle Speed - Wheel Speed Correlation","info":["This is a generic diagnostic trouble code (DTC) and typically applies to OBD-II vehicles. Vehicle makes may include but aren't limited to Ford, Chevrolet, Dodge, VW, etc. Anecdotally this code seems to be more commonly seen on Ford/Powerstroke vehicles.","\n ","If your OBD-II equipped vehicle has stored a code P215A, it means that the powertrain control module (PCM) has detected a discrepancy between the vehicle output speed sensor and one (or more) of the wheel speed sensors. The vehicle output speed sensor is most frequently called the vehicle speed sensor (VSS).","The output speed sensor and the wheel speed sensor are both intended to detect vehicle speed but each is a component of a separate network. The output speed sensor is part of the powertrain control network and the wheel speed sensor is part of the antilock brake system network.","The output speed sensor is an electromagnetic sensor which is mounted in close proximity to some type of toothed reluctor ring wheel or gear. The reluctor ring is mechanically affixed to an axle, transmission/transfer case output shaft, or driveshaft. The reluctor ring spins in conjunction with the axle. As the reluctor ring teeth pass within thousandths-of-an-inch of the output speed sensor, the magnetic field completes the output speed sensor input circuit. The notches between the reluctor ring teeth create interruptions in the same circuit. These completions/interruptions occur in rapid succession as the vehicle rolls forward. These circuit completions and interruptions create wave form patterns that are received by the PCM (and other controllers) as output speed. As wave form pattern speed increases, estimated vehicle speed increases. Likewise, as the input speed of the wave form slows, estimated vehicle speed decreases. Output speed sensor input voltage signals are compared by various controllers via the controller area network (CAN).","In much the same way as the PCM monitors output speed, the antilock brake control module (ABCM) monitors input data from the wheel speed sensors. Wheel speed sensors are mounted near a reluctor ring on a brake rotor, hub assembly, or differential ring gear. Most OBD-II vehicles are equipped with a four-wheel antilock brake system (ABS) but some applications have a rear-wheel only antilock braking system.","Independent rear axle vehicles with four-wheel ABS have four wheel speed sensors\nFixed rear axle vehicles with four-wheel ABS will incorporate three sensors\nVehicles with an independent rear axle and rear-wheel ABS may have two sensors\nVehicles with a fixed rear axle and a rear-wheel ABS system will have just one wheel speed sensor","The PCM is constantly monitoring vehicle output speed when the vehicle in moving forward. Individual wheel speed sensor inputs are constantly monitored by the ABCM or electronic brake control module (EBCRM). The two controllers share data via the CAN and compare the signals anytime the vehicle is in motion. If either of the controllers detects a variation between output speed and wheel speed that exceeds the maximum threshold for a set amount of time, a code P215A will be stored and a malfunction indicator lamp (MIL) may be illuminated.","A transmission speed sensor:\n"],"symptoms":["Erratic speedometer\nInadvertent ABS or traction control system (TCS) activation\nIrregular transmission shift patterns\nABS codes may be stored\nThe ABS may be disabled"],"causes":["Excessive metallic debris on output/wheel speed sensor magnet\nDefective wheel speed/vehicle speed sensor\nCut or damaged wiring or connectors\nBroken, damaged, or worn reluctor ring teeth\nFaulty PCM, ABCM, or EBCM"]}