{"code":"P2160","description":"Vehicle Speed Sensor \"B\" Low Input","info":["This diagnostic trouble code (DTC) is a generic powertrain code, which means that it applies to all 1996-newer vehicles (Ford, Dodge, GMC, Chevy, etc.). Although generic, the specific repair steps may vary depending on make/model.","A stored code P2160 means that the powertrain control module (PCM) has detected a low voltage input signal from vehicle speed sensor (VSS) B. The designation B typically refers to the secondary VSS in systems which utilize multiple vehicle speed sensors.","\n ","Most vehicle speed sensors are electromagnetic sensors which utilize some type of toothed reluctor ring wheel or gear that is permanently affixed to an axle, transmission/transfer case output shaft, differential gear, or driveshaft. As the shaft spins, so spins the reluctor device which completes a circuit with the stationary electromagnetic sensor. As the reluctor passes in very close proximity to the electromagnetic tip of the sensor, the notches in the reluctor ring create interruptions in the sensor circuit. The combination of circuit completions and interruptions are received by the PCM (and other controllers) as wave form patterns representing voltage.","The PCM monitors vehicle speed using input data from one or more vehicle speed sensors and compares it to inputs from the antilock brake control module (ABCM) or electronic brake control module (EBCM). In some cases, secondary VSS input may be monitored using one or more wheel speed sensors but the primary VSS input (B) will likely be initiated by the VSS in the transmission.","If the PCM detects a low input voltage signal from the primary VSS, a code P2160 will be stored and a malfunction indicator lamp may be illuminated. A low voltage input condition may be caused by either an electrical or mechanical problem."],"symptoms":["Erratic speedometer/odometer operation\nIrregular transmission shift patterns\nIllumination of the service engine soon lamp, traction control lamp, or antilock brake lamp\nUnexpected activation/deactivation of the traction control system (if equipped)\nOther transmission and ABS codes may be stored\nThe ABS system may be rendered inoperable in some cases"],"causes":["Possible causes for this code include:","Excessive metal debris buildup on speed sensor/s\nA defective wheel speed or vehicle speed sensor\nCut or otherwise damaged wiring harnesses or connectors (especially near speed sensors)\nDamaged or worn teeth on a reluctor ring\nA faulty PCM, ABCM, or EBCM"]}