{"code":"P2162","description":"Output Speed Sensor A/B Correlation","info":["This is a generic diagnostic trouble code (DTC) and typically applies to OBD-II vehicles. Vehicle makes may include but aren't limited to Ford, Chevy / Chevrolet, etc.","\n ","If your OBD-II equipped vehicle has stored a code P2162, it means that the powertrain control module (PCM) has detected a discrepancy between two separate vehicle (output) speed sensors.","The individual vehicle (output) sped sensors have been designated as A and B. The sensor designated as A is normally the forward most sensor in the network but check specifications for the vehicle in question before reaching any diagnostic conclusions.","In the type of system intended to exhibit a code P2162, multiple vehicle (output) speed sensors are used. It is likely that one is located in the differential and the other is situated near the output shaft housing of the transmission (2WD) or transfer case (4WD).","The vehicle (output) speed sensor is an electromagnetic sensor which is mounted in close proximity to some type of toothed reluctor ring wheel or gear. The reluctor ring is mechanically affixed to an axle, transmission/transfer case output shaft, ring gear, or driveshaft. The reluctor ring spins in conjunction with the axle. As the reluctor ring teeth pass within thousandths-of-an-inch of the output shaft speed sensor, the magnetic field completes the sensor input circuit. The notches between the reluctor ring teeth create interruptions in the same circuit. These completions/interruptions occur in rapid succession as the vehicle rolls forward. These circuit completions and interruptions create wave form patterns that are received by the PCM (and other controllers) as vehicle speed or output shaft speed. As wave form pattern speed increases, estimated vehicle and output shaft speed increases. Likewise, as the input speed of the wave form slows, estimated vehicle or output shaft speed decreases.","The PCM is constantly monitoring vehicle (output) speed when the vehicle is moving forward. If the PCM detects a variation between the individual vehicle (output) speed sensors that exceeds the maximum threshold (for a set amount of time) a code P2162 will be stored and a malfunction indicator lamp (MIL) may be illuminated.","A transmission speed sensor:\n"],"symptoms":["Erratic speedometer operation\nIrregular transmission shift patterns\nInadvertent ABS or traction control system (TCS) activation\nABS codes may be stored\nThe ABS may be disabled"],"causes":["Incorrect final drive gear ratio (differential ring gear and pinion)\nTransmission slippage\nExcessive metallic debris on vehicle (output)/output shaft speed sensor magnet\nDefective vehicle (output)/output shaft speed sensor\nCut or damaged wiring or connectors\nBroken, damaged, or worn reluctor ring teeth\nFaulty PCM or PCM programming error"]}