{"code":"P2161","description":"Vehicle Speed Sensor \"B\" Intermittent / Erratic / High","info":["This diagnostic trouble code (DTC) is a generic powertrain code, which means that it applies to all 1996-newer vehicles (Ford, Dodge, GMC, Chevy, etc.). Although generic, the specific repair steps may vary depending on make/model.","When a stored code P2161 is exhibited, it means that the powertrain control module (PCM) has detected a voltage input signal, from vehicle speed sensor (VSS) B, that is intermittent, erratic, or excessive. The designation B usually refers to the secondary VSS in a system which utilizes multiple vehicle speed sensors.","\n ","OBD II vehicle speed sensors are typically electromagnetic sensors which utilize some type of toothed reluctor ring wheel or gear that is mechanically affixed to an axle, transmission/transfer case output shaft, differential gear, or driveshaft. As the shaft spins, so spins the metal reluctor ring. The reluctor ring completes a circuit with the stationary electromagnetic sensor as the reluctor passes in very close proximity to electromagnetic tip of the sensor. The notches between the teeth of the reluctor ring create interruptions in the sensor circuit. The combination of circuit completions and interruptions are recognized by the PCM (and possibly other controllers) as voltage wave form patterns.","Vehicle speed is monitored by the PCM using input data from one or more vehicle speed sensors. The PCM compares inputs from the VSS with antilock brake control module (ABCM) or electronic brake control module (EBCM) inputs. The primary VSS input (B) will likely be initiated by the VSS in the transmission but secondary VSS input/s may be monitored using one or more wheel speed sensors.","If the PCM detects an intermittent, erratic, or high input voltage signal from the primary VSS, a code P2161 will be stored and a malfunction indicator lamp may be illuminated. An intermittent, erratic, or high voltage input condition may be the result of an electrical or mechanical problem."],"symptoms":["Erratic speedometer/odometer operation\nIrregular transmission shift patterns\nOther transmission and ABS codes may be stored\nIllumination of the service engine soon lamp, traction control lamp, or antilock brake lamp\nUnexpected activation/deactivation of the traction control system (if equipped)\nThe ABS system may be rendered inoperable in some cases"],"causes":["Possible causes for this code include:","Excessive metal debris buildup on speed sensor/s\nA defective wheel speed or vehicle speed sensor\nCut or otherwise damaged wiring harnesses or connectors (especially near speed sensors)\nDamaged or worn teeth on a reluctor ring\nA faulty PCM, ABCM, or EBCM"]}