{"code":"P2166","description":"Throttle/Pedal Position Sensor D Maximum Stop Performance","info":["This is a generic powertrain diagnostic trouble code (DTC) and typically applies to OBD-II vehicles. That may include but is not limited to vehicles from Ford (e.g. F-150), Chevrolet, Dodge / Ram, Jeep, Chrysler, Kia, Toyota, VW, Ferrari, etc. Although generic, the exact repair steps may vary depending on year, make, model and powertrain configuration.","A stored code P2166 means the powertrain control module (PCM) has detected a malfunction in a the \"D\" throttle position sensor (TPS) or a particular pedal position sensor (PPS).","\n ","The designation \"D\" refers to a particular sensor or part of a circuit/sensor. Consult a reliable vehicle information source for particulars pertaining to the vehicle in question. This code is only used in vehicles that are equipped with drive by wire (DBW) systems and is related to maximum stop or wide open throttle performance.","The PCM controls the DBW system using a throttle actuator motor, multiple pedal position sensors (sometimes referred to as accelerator pedal position sensors), and several throttle position sensors. The sensors are typically supplied with a 5-volts reference, a ground, and at least one signal wire.","Generally speaking, TPS/PPS sensors are of the potentiometer type. A mechanical extension, on the accelerator pedal or the throttle plate shaft, actuates the contacts of the sensor. Sensor resistance changes, as the contacts are moved across the sensor circuit board, causing variations in circuit resistance and signal input voltage to the PCM.","If the PCM detects a maximum stop/wide open throttle position sensor voltage signal (from the sensor designated D) that does not reflect the programmed parameter, a code P2166 will be stored and a malfunction indicator lamp (MIL) may be illuminated. When this code is stored, the PCM will usually enter limp in mode. Engine acceleration could be severely limited (if not totally disabled) in this mode.","A throttle position sensor (TPS):\n"],"symptoms":["Lack of throttle response\nLimited or no acceleration\nEngine stall when allowed to idle\nHesitation when accelerating\nCruise control inoperative"],"causes":["Defective TPS or PPS\nOpen or shorted circuits between the TPS, PPS, and the PCM\nCorroded electrical connectors\nFaulty DBW actuator motor"]}