{"code":"P2189","description":"System Too Lean at Idle (Bank 2)","info":["This diagnostic trouble code (DTC) is a generic powertrain code. It is considered generic because it applies to all makes and models of vehicles (1996-newer), although specific repair steps may be slightly different depending on the model.","This is an ambiguous code in of itself. It can be a tough code to crack without a diagnostic strategy. During the last two starts, the engine management computer has recognized a problem with the fuel mixture at an idle.","\n ","It appears that the fuel mixture is too lean (too much air and not enough fuel) at an idle.","There is a laundry list of components that could cause this scenario. For the most part the diagnostic procedure is not difficult -- just time consuming, unless it is one of the first items checked. The strategy dictates that the driveability problems are observed and noted, then start with the most commonly found problems and progress from there.","Note: This code is identical to P2187. The difference is that P2187 refers to Bank 1 (the side of the engine containing cylinder #1), and P2189 refers to Bank 2."],"symptoms":["With the wide range of possibilities, the problems listed may and may not be present. But, here is where it is important to pay particular attention to the symptoms observed and make a note as to what and when symptoms appear for diagnostic strategy.","Vehicle has a miss at an idle\nHard to start, especially when hot\nVery irregular idle\nAdditional codes to pinpoint cause of original P2189 code\nWhistling noises\nLower turbo boost numbers\nFuel smell"],"causes":["Faulty O2 sensor (front)\nFaulty gas cap seal\nLeaky or loose oil filler cap\nAir leaking into the intake manifold downstream from the Mass Airflow sensor due to the manifold itself, vacuum hoses off or cracked, leak MAP sensor, Leak at turbo bypass or it's stuck open, power brake booster hose, or a leak in the EVAP system hoses.\nFaulty MAP sensor\nEVAP canister purge valve\nFuel injector leak\nFuel pressure regulator faulty\nLeaks in the exhaust system\nFaulty variable camshaft timing\nFaulty ECM (engine management computer)\nFaulty O2 preheater (front)\nClogged fuel filter\nFuel pump wearing out and producing low pressure.\nFaulty mass air flow sensor"]}