{"code":"P2199","description":"Intake Air Temperature Sensor 1/2 Correlation","info":["This generic powertrain diagnostic trouble code (DTC) typically applies to many OBD-II vehicles. That may include but is not limited to vehicles from Ford, Chevrolet, GMC, VW, Pontiac, Honda, Nissan, Mazda, etc.","\n ","If you have been faced with diagnosing a code P2199, you need to know that it means that the powertrain control module (PCM) has detected a discrepancy in the correlating signals between two separate intake air temperature (IAT) sensors.","Multiple IAT sensors are normally used exclusively in vehicles with more than one throttle body. Separate IAT sensors are monitored in comparison (with each other) primarily to ensure that no obstructions are impeding air flow to either side of the engine intake.","Typical IAT sensor composition includes a thermal resistor that protrudes from a plastic housing on a two-wire pedestal. The plastic housing is inserted into the air intake pipe or air filter housing and sealed with a soft rubber grommet.","Another IAT sensor design integrates the thermal resistor into the mass air flow (MAF) sensor housing. The thermal resistor may be parallel with the MAF sensor hot wire or in a recessed area away from air flow.","The IAT sensor thermal resistor extends into the air inlet so that intake air flows across it as it is drawn into the intake. As intake air temperature increases, the level of resistance in the IAT resistor decreases. This causes circuit voltage to move towards the maximum reference point. When intake air is cooler, IAT sensor resistance increases, resulting in decreased IAT sensor circuit voltage. The PCM receives these variations in IAT sensor signal voltage as changes in intake air temperature. It also makes a comparison between individual IAT sensor signals and reacts accordingly.","A code P2199 will be stored and a malfunction indicator lamp (MIL) may be illuminated if the PCM detects voltage signals from the separate IAT sensors which differ by more than the maximum allowable threshold. MIL illumination may require multiple ignition cycles with a failure.","Intake Air Temperature (IAT) Sensor:\n"],"symptoms":["Diminished engine performance\nReduced fuel efficiency\nHesitation upon acceleration"],"causes":["IAT sensor disconnected\nDefective IAT sensor\nRestricted air filter\nOpen or shorted circuits or connectors\nDefective PCM or PCM programming error"]}