{"code":"P2608","description":"Intake Air Heater \"B\" Circuit High","info":["This generic powertrain diagnostic trouble code (DTC) typically applies to all OBD-II equipped vehicles that have an air intake heater, including but not limited to Chevrolet GMC (Duramax), Ford (Powerstroke), Honda, Nissan, Dodge, etc.","This code is one of a number of possible codes that are associated with an intake air heater circuit \"B\" malfunction. An intake air heater is an essential component for a diesel engine to assist the starting process. The four codes that the Powertrain Control Module (PCM) may set for intake air heater \"B\" circuit issues are P2605, P2606, P2607, and P2608.","\n ","What is the purpose of an air intake heater?","The intake air heater \"B\" circuit is designed to operate the components that provide warm air to facilitate diesel engine starting and idling at various temperatures. The typical intake air heater circuit incorporates a heater element, relays, temperature sensor and at least one blower. Air ducts are also needed to route the warm air to the intake and electrical connections and wiring control the operation of these components.","Trouble code P2608 is triggered by the PCM when it a high signal from the intake air heater \"B\" circuit. The circuit may be out of range, contain a faulty component or have improper airflow. Various malfunctions within the circuit may be present and can be physical, mechanical or electrical. Refer to a vehicle specific repair manual to determine which is the \"B\" circuit for your particular vehicle.","Here is an example of an air intake heater:\n"],"symptoms":["Engine will not start\nLonger than normal cranking time\nCheck Engine Light illuminated\nRough idle at cold temperatures\nEngine stalls"],"causes":["Typically, potential causes for this code include:","Faulty heater element relay\nDetective heater element\nFaulty temperature sensor\nCorroded or damaged connector\nDamaged or restricted air duct\nFaulty or damaged wiring\nDefective Blower motor\nFaulty PCM","Another style of air intake heater:\n"]}