{"code":"P2626","description":"O2 Sensor Pumping Current Trim Circuit/Open Bank 1 Sensor 1","info":["This generic powertrain diagnostic trouble code (DTC) typically applies to all OBD-II equipped vehicles, including but not limited to vehicles from Ford, Kia, Hyundai, Mini, Audi, VW, Mercedes, BMW, etc.","The P2626 OBDII trouble code is associated with the O2 Sensor Pumping Current Trim Circuit. When the Powertrain Control Module (PCM) detects a malfunction within the O2 Sensor Pumping Current Trim Circuit for the number one known as the upstream sensor, six different codes can be set.","\n ","These codes are P2626, P2627, P2628, P2629, P2630 and P2631 based on the specific signal that alerts the PCM to set the code and illuminate the Check Engine Light.","Code P2626 is set by the PCM when the O2 Sensor Pumping Current Trim Circuit for Bank 1 Sensor 1 is open. On multiple bank engines, bank 1 is the bank of the engine that contains cylinder #1.","What does an O2 sensor do?","The purpose of an O2 sensor is to monitor how much unburned oxygen is in the exhaust when it exits the engine. The PCM uses the signals sent from the O2 sensors to determine the oxygen levels in the exhaust.","These readings are utilized to control the fuel mixture. The PCM will adjust the fuel mixture accordingly when the engine is burning rich (less oxygen) or lean (more oxygen). All OBDII vehicles incorporate a minimum of two O2 sensors, one before the catalytic converter (upstream) and one after (downstream).","An independent dual exhaust configuration will incorporate four O2 sensors. This P2626 code is associated with the upstream sensors located before the catalytic converter (sensor #1)."],"symptoms":["Poor performance that progresses\nThe engine will run lean\nThe engine will run rich\nCheck Engine Light illuminated\nSmoke from tailpipe\nIncreased fuel consumption"],"causes":["Possible causes of this code may include:","Faulty O2 Sensor\nCarbon Buildup on O2 Sensor\nBlown fuse (if applicable)\nFuel pressure too high\nFuel pressure too low\nVacuum leak on the engine\nExcessive exhaust leak\nCorroded or damaged connector\nFaulty or damaged wiring\nFaulty PCM"]}