{"code":"P2686","description":"Actuator Supply Voltage C Circuit High","info":["This is a generic powertrain diagnostic trouble code (DTC) and typically applies to OBD-II vehicles. Vehicle makes may include but aren't limited to Dodge, Chrysler, Ford, Chevrolet, Toyota, Honda, Nissan, etc.","\n ","The ECM (Engine control module) is not only responsible for monitoring and adjusting numerous sensors, solenoids, actuators, valves, etc.. but also for making sure all of these components are operating seamlessly and in conjunction to meet desired values. All of this to ensure you get the most economy and performance out of your vehicle as possible. In this case, if you get a P2686 or related code, depending on your make and model, you may be experiencing transmission drivability issues.","It's important to note, in my experience with European models, I have also seen this code as an EVAP diagnostic code. Having highlighted the potential differences, it should go without saying, you need to refer to your service manual to ensure proper diagnostic direction. Most times, your symptoms will be a strong indicator as to what systems/ components you will be working with to rectify the fault.","When it comes to the P2686 and related codes, the ECM has detected an abnormal value within the actuator supply voltage circuit. It recognizes the abnormality by comparing the actual values to desired ones. If they go outside of a desired scope, it illuminates the MIL (Malfunction indicator lamp) on your instrument panel. It must monitor this fault through multiple drive cycles before illuminating the MIL. Make sure to research the designation for \"C\" within the circuit. Depending on your make and model, this could designate a certain wire, harness, location, etc. That said, always use OEM (Original equipment manufacturer) technical service information for this.","This could also be detected by the TCM (Transmission control module) depending on what description your particular make and model has for this code.","P2686 (Actuator Supply Voltage C Circuit High) is is active when the ECM or TCM has detected a high voltage condition within the actuator supply voltage \"C\" circuit"],"symptoms":["Poor shifting\nLack of torque\nStuck in gear\nCEL (Check engine light) illuminated\nOverall poor drivability\nLimited power output\nPoor fuel mileage\nAbnormal engine revving/speeds"],"causes":["Water intrusion\nMelted/broken connector(s)\nShort to power\nGeneral electrical issue (e.g. charging system issue, wrong battery, etc.)"]}