{"code":"P3450","description":"Cylinder 7 Deactivation/Intake Valve Control Circuit Performance","info":["This is a generic powertrain diagnostic trouble code (DTC) and applies to many OBD-II vehicles (1996-newer). That may include but is not limited to vehicles from General Motors, Dodge, Jeep, Chevrolet, Chrysler, Ram, etc. Although generic, the exact repair steps may vary depending on year, make, model and powertrain configuration.","\n ","OBD-II trouble code P3450 and related codes P3449, P3451, and P3452 are associated with the cylinder #7 deactivation/intake valve control circuit.","The purpose of the cylinder 7 deactivation/intake valve control circuit is to accommodate the cylinder deactivation feature (e.g. V4 mode of a V8 engine) to improve fuel economy during light load operation such as highway driving. The Engine Control Module (ECM) controls the 4 or 8 cylinder modes of the engine by engaging the intake deactivating solenoids for four of the engine cylinders. This code pertains to the number 7 cylinder and the other three cylinders in this process are determined by the engine configuration and the firing order of the cylinders. The number one cylinder deactivation solenoid is mounted on or near the intake in the vicinity of that cylinder based of the specific vehicle and the configuration.","When the ECM detects a performance problem within the voltage or resistance in the cylinder 7 deactivation/intake valve control circuit, code P3450 will be set and the check engine light, service engine soon light or both may be illuminated. In some circumstances, the ECM may disable the injector to the #7 cylinder until the issue is corrected and the code has been cleared causing a noticeable engine misfire.","Cylinder deactivation solenoids:\n"],"symptoms":["Engine may misfire\nIncreased fuel consumption\nPoor engine performance\nService engine soon light illuminated\nCheck engine light illuminated"],"causes":["Defective cylinder deactivation solenoid\nLow engine oil level or pressure\nRestricted oil passage\nFaulty or damaged wiring\nCorroded, damaged or loose connector\nDefective ECM"]}