{"code":"P3470","description":"Cylinder 9 Exhaust Valve Control Circuit Performance","info":["This is a generic powertrain diagnostic trouble code (DTC) and applies to many OBD-II vehicles (1996-newer). That may include but is not limited to vehicles from Dodge, Peugeot, Jeep, Chevrolet, Chrysler, etc. Although generic, the exact repair steps may vary depending on year, make, model and engine configuration.","\n ","OBD-II trouble code P3470 and related codes P3469, P3471, and P3472 are associated with the cylinder 9 exhaust valve control circuit.","The purpose of the cylinder 9 exhaust valve control circuit is to turn off the exhaust valve to accommodate the cylinder deactivation feature (e.g. V4 mode of a V8 engine) to improve fuel economy during light load operation at idle or on the highway. The Engine Control Module (ECM) controls the 4 or 8 cylinder modes of the engine deactivating four of the engine cylinders. This process is accomplished by incorporating variable valve timing solenoids that turn the exhaust valves on and off as required. This code pertains to the number 9 cylinder and the other three cylinders in this process are determined by the engine configuration and the firing order of the cylinders. The ECM will limit cylinder deactivation to a cycle time of 10 minutes in V4 mode, and then return to V8 mode for 1 minute. The number 9 cylinder variable valve timing solenoid is mounted on or near the exhaust manifold in the vicinity of that cylinder based of the specific configuration and vehicle.","When the ECM detects a performance problem within the voltage or resistance in the cylinder 9 exhaust valve control circuit, code P3470 will be set and the check engine light, service engine soon light or both may be illuminated. In some circumstances, the ECM may disable the injector to the number 9 cylinder until the issue is corrected and the code has been cleared causing a noticeable engine misfire.","Cylinder Deactivation Solenoids:\n"],"symptoms":["Increased fuel consumption\nPoor engine performance\nEngine misfire\nService engine soon light illuminated\nCheck engine light illuminated"],"causes":["Faulty variable valve timing solenoid\nLow engine oil level or pressure\nRestricted oil passage\nFaulty or damaged wiring\nCorroded, damaged or loose connector\nDefective ECM"]}