{"code":"P3497","description":"Cylinder Deactivation System Bank 2","info":["This generic powertrain diagnostic trouble code (DTC) typically applies to many OBD-II vehicles. That may include but is not limited to vehicles from Honda, Dodge, Ram, GMC, Chevrolet, Chrysler, Pontiac, etc.","\n ","A stored code P3497 means that the powertrain control module (PCM) has detected an abnormality in the cylinder deactivation system for engine bank 2. Bank two denotes the bank of the engine which doesn't contain the #1 cylinder. The location of the number one cylinder varies by make and model. Consult your service manual (or alternate source of vehicle information) for the location of the number one cylinder for the vehicle in question - never make assumptions where this is concerned.","Cylinder deactivation (also known as variable displacement) systems are designed for fuel conservation purposes. They are primarily used in vehicles equipped with an engine that has eight or more cylinders.","Under certain driving conditions, all of the engine's horsepower is not needed. These driving conditions typically involve low throttle and highway speeds. When these circumstances arise, the cylinder deactivation system is designed to disable corresponding cylinders and conserve fuel.","The variable valve timing solenoids are utilized to close the intake and exhaust valves for the cylinders that are deactivated. The purpose of this is twofold; first, it traps spent exhaust gases in the cylinder and forms a sort of air damper. This reduces vibration and makes cylinder deactivation operation smoother. Secondly, the trapped exhaust is compressed on the piston up stroke. The compressed exhaust serves to propel the piston back downward and provide an even greater degree of overall engine balance.","In addition to the valves being closed on the deactivated cylinders, the cylinder deactivation system also disables fuel flow to the affected cylinders. There is usually no noticeable loss of power or torque when the cylinder deactivation system becomes operational.","If a situation arises in which the PCM cannot make the cylinder deactivation system operational (for engine bank 2), or if the PCM detects that the cylinder deactivation system has become inadvertently operational, a code P3497 will be stored and a malfunction indicator lamp (MIL) may be illuminated.","Cylinder Deactivation Engine:\n"],"symptoms":["Diminished fuel efficiency\nReduced engine performance\nOther cylinder deactivation codes\nEngine misfire codes"],"causes":["Low engine oil level or pressure\nDefective valve timing control solenoid/s\nOpen or shorted cylinder deactivation circuit/s\nFaulty PCM or PCM programming error"]}