{"code":"P0306","description":"Cylinder 6 Misfire Detected","info":["This diagnostic trouble code (DTC) is a generic powertrain code, which means that it applies to OBD-II equipped vehicles. Although generic, the specific repair steps may vary depending on make/model.","The reason for a code P0306 being stored in your OBD II vehicle is that the powertrain control module (PCM) has detected an individual cylinder misfire. A P0306 specifically applies to the number six cylinder. Consult a reliable vehicle information source for the location of the number six cylinder for the vehicle in question.","\n ","This type of code may be caused by a fuel delivery problem, a large vacuum leak, an exhaust gas recirculation (EGR) malfunction, or mechanical engine failure, but is most often the result of an ignition system defect resulting in a low or no spark condition.","Virtually all OBD II equipped vehicles use a distributor-less, coil-over-plug (COP), high-intensity spark, ignition system. It is controlled by the PCM to effect precise ignition spark and timing.","The PCM calculates input signals from the crankshaft position sensor, camshaft position sensor, and throttle position sensor (among others depending upon the vehicle) to configure an ignition spark timing strategy.","In a realistic sense, the camshaft position sensor and crankshaft position sensor are vital to operation of the OBD II ignition system. Using input signals from these sensors, the PCM delivers a voltage signal that causes the high-intensity ignition coils (usually one for each cylinder) to fire in sequential order.","Since the crankshaft turns at a speed that is approximately twice as fast as the camshaft(s), it is crucial that the PCM knows their exact position; both overall and in relation to one another. A simple method of explaining this aspect of engine operation is this:","Top dead center (TDC) is the point where the crankshaft and camshaft(s) align with the piston (for the number one cylinder) at its highest point and the intake valve(s) (for cylinder number one) opened. This is known as the compression stroke.","During the compression stroke, air and fuel are drawn into the combustion chamber. At this point, an ignition spark is required to cause combustion. The PCM recognizes the position of the crankshaft and camshaft and initiates the voltage signal required to result in a high-intensity spark from the ignition coil.","Combustion in the cylinder propels the piston back in a downward fashion. As the engine rolls through the compression stroke, and the number one piston begins to withdraw towards the crankshaft, the intake valve(s) is closed. This begins the exhaust stroke. As the crankshaft completes another revolution, the number one piston once again reaches its highest point. Since the camshaft(s) has only completed a half revolution, the intake valve remains closed and the exhaust valve is opened. At the top of the exhaust stroke, no ignition spark is required, as this stroke is used to push spent exhaust gases out of the cylinder, through the opening created by the open exhaust valve(s), and into the exhaust manifold.","Typical high-intensity ignition coil operation is accomplished with a constant supply of fused, switched (only present with the ignition switch placed in the ON position) battery voltage and a ground pulse supplied (at the appropriate instant) by the PCM. When the ground pulse is applied to the ignition coil (primary) circuit, the coil emits a high-intensity spark (up to 50,000-volts) for a fraction of a second. This high-intensity spark is transferred through a spark plug wire or boot and a spark plug, which is threaded into the cylinder head or intake manifold, where it makes contact with a precise air/fuel mixture. The result is a controlled explosion. If this explosion fails to occur, the engine RPM level is affected and the PCM detects it. After that, the PCM monitors camshaft position, crankshaft position, and individual coil feedback voltage inputs to determine which cylinder has misfired or is currently misfiring.","If the cylinder misfire is not consistent or severe enough, the code may appear as pending and the malfunction indicator lamp (MIL) may only flash when the PCM actually detects a misfire (then go off when it does not). The system is designed in this fashion to alert the driver that an engine misfire of this degree can be harmful to the catalytic converter and other engine components. Once the misfire becomes more consistent and severe, a P0306 will be stored and constant MIL illumination will occur."],"symptoms":["Diminished engine performance\nRough or unstable feeling from engine (at idle or under light acceleration)\nOdd odor from engine exhaust\nFlashing or constant MIL (malfunction indicator lamp) illumination"],"causes":["A code P0306 may mean that one or more of the following has happened:","Defective ignition coil(s)\nBad spark plug(s), spark plug wires, or spark plug boots\nFaulty fuel injector(s)\nMalfunctioning fuel delivery system (fuel pump, fuel pump relay, fuel injectors, or fuel filter)\nMajor engine vacuum leak\nEGR valve stuck in the wide open position\nClogged EGR ports"],"type":"ERR"}