{"code":"P0370","description":"Timing Reference High Resolution Signal A Malfunction","info":["This diagnostic trouble code (DTC) is a generic powertrain code, which means it applies to OBD-II equipped vehicles which have an engine position sensor (Chevrolet, GMC, Ford, Dodge, BMW, etc.). Although generic, the exact repair steps may vary depending on make/model.","The powertrain control module (PCM) requires a timing reference signal to determine engine speed and position. This is accomplished by means of an engine position sensor, such as a crankshaft, camshaft or fuel pump position sensor.","\n ","The PCM uses this information to determine one or more of the following: fuel injector control, ignition timing and misfire diagnostics. There are two basic types of engine positions sensors: Hall-Effect and permanent magnet.","Both types of sensors are triggered by a wheel or disc mounted close to the sensor. Typical wheel/disc mounting locations include the engine position, injection pump, harmonic balancer and distributor shaft. When triggered, the sensor produces a return signal which is sent back to the PCM.","Hall-Effect crank position sensors have three wires: reference (power), signal, and ground. The sensor receives a reference voltage (usually 5-volts) from the PCM, and is triggered by a reluctor wheel. The sensor then sends a corresponding digital return signal back to the PCM.\nPermanent magnet (PM) sensors produce their own AC voltage based on their proximity to a rotating reluctor wheel. This voltage signal is sent back to the PCM where it is converted to a digital signal by an internal analog to digital converter.","In the codes outlined in this article, the \"A\" indicates the problem is with a portion of the system circuit, instead of a particular symptom or component.","A code P0370 is set when the PCM detects a malfunction with the \"A\" engine position sensor signal.","Related timing reference signal A trouble codes include:","P0371 Timing Reference High Resolution Signal A Too Many Pulses\nP0372 Timing Reference High Resolution Signal A Too Few Pulses\nP0373 Timing Reference High Resolution Signal A Intermittent/Erratic Pulses\nP0374 Timing Reference High Resolution Signal A No Pulses"],"symptoms":["Illuminate check engine light\nHard starting/no starting\nPoor engine performance"],"causes":["Possible causes for this P0370 code include:","Faulty sensor\nWiring problems\nReluctor wheel damage\nContaminated oil\nFaulty PCM"],"type":"WARN"}