{"code":"P0387","description":"Crankshaft Position Sensor B Circuit Low Input","info":["This diagnostic trouble code (DTC) is a generic powertrain code, which means that it applies to OBD-II equipped vehicles (Jeep, Nissan, Dodge, Ram, BMW, Ford, GM, etc.). Although generic, the specific repair steps may vary depending on make/model.","When I have diagnosed a stored code P0387 (in the past) it was because the powertrain control module (PCM) had detected a low input voltage signal from the secondary crankshaft position (CKP) sensor circuit. Sensor B typically refers to a secondary CKP sensor in a system which utilizes multiple CKP sensors.","\n ","CKP sensors are responsible for monitoring engine speed (RPM) and crankshaft position. Both of these factors are used in various engine management scenarios but are especially critical to ignition (spark) timing and fuel delivery.","The position of the crankshaft, particularly in relation to the camshaft/s, is one of the key factors used by the PCM to calculate ignition spark timing. The camshafts turn at half the speed of the crankshaft, so it is important that the PCM is able to distinguish between engine intake and exhaust stokes (rotations). The CKP sensor and each camshaft position (CMP) sensor have at least one circuit dedicated to providing the PCM with an input signal, a 5-volt reference signal, and a ground.","CKP sensors are typically of the electro magnetic, hall-effect variety. They are mounted to the exterior of the engine in very close proximity (usually only several thousandths of an inch) to a circuit completing engine ground. This engine ground is usually a reluctor ring (with precisely machined teeth) affixed to one end of the crankshaft or integrated into the crankshaft itself.","The CKP sensor is mounted so that the crankshaft reluctor wheel passes very closely to its magnetic tip. As the crankshaft rotates, the raised areas (on the reluctor wheel) complete an electromagnetic circuit with the sensor. When the gaps between the teeth pass the CKP sensor, the circuit is briefly interrupted. The circuit interruptions create voltage fluctuations that the PCM perceives as a waveform pattern.","With the engine running, the PCM constantly compares input signals from the CKP and CMP sensors. If CKP input signal voltage is lower than expected under certain circumstances, a P0387 code will be stored and a MIL may be illuminated.","Other crankshaft position sensor B trouble codes include P0385, P0386, P0388, and P0389.\n"],"symptoms":["The engine will not start\nThe tachometer (if equipped) does not register RPM when the engine is cranked\nHesitation upon acceleration\nPoor engine performance\nDiminished fuel efficiency"],"causes":["Potential causes for this code to set are:","Defective CKP sensor\nOpen or shorted wiring to the CKP sensor\nCorroded or fluid soaked connector at the CKP sensor\nFaulty PCM or PCM programming error"],"type":"WARN"}