{"code":"P0389","description":"Crankshaft Position Sensor B Circuit Intermittent","info":["This diagnostic trouble code (DTC) is a generic powertrain code, which means that it applies to OBD-II equipped vehicles (Honda, GMC, Chevrolet, Ford, Volvo, Dodge, Toyota, etc.). Although generic, the specific repair steps may vary depending on make/model.","If your vehicle has a stored code P0389, it means that the powertrain control module (PCM) detected an intermittent or erratic voltage signal from the secondary crankshaft position (CKP) sensor. When an OBD II system uses multiple CKP sensors, sensor B typically refers to a secondary CKP sensor.","\n ","Engine speed (RPM) and crankshaft position are monitored using the CKP sensor. The PCM calculates ignition spark timing using the position of the crankshaft. When you consider that the camshafts turn at half the speed of the crankshaft, you see why it is so important that the PCM is able to distinguish between engine intake and exhaust stokes (rotations). CKP sensor circuitry includes one or more circuits dedicated to providing the PCM with an input signal, a 5-volt reference signal, and a ground.","CKP sensors are most commonly of the electro magnetic, hall-effect variety. They are usually mounted to the exterior of the engine and placed in very close proximity (usually only several thousandths of an inch) to a circuit completing engine ground. The engine ground is typically a reluctor ring (with precisely machined teeth) affixed to either end of the crankshaft or integrated into the crankshaft itself. Some systems with multiple CKP sensors may use a reluctor ring on one end of the crankshaft and another machined into the center of the crankshaft. Others will simply mount sensors in multiple positions around one reluctor ring.","The CKP sensor is mounted so that the reluctor ring passes within several thousandths of an inch of its magnetic tip as the crankshaft rotates. Raised areas (teeth) of the reluctor ring complete an electromagnetic circuit with the sensor and the indentations between the raised areas interrupt the circuit briefly. The PCM recognizes these continual circuit completions and interruptions as a waveform pattern representing voltage fluctuations.","Input signals from the CKP sensors are constantly monitored by the PCM. If crankshaft position sensor input voltage is too low over a set period of time, a P0389 code will be stored and a MIL may be illuminated.","Other crankshaft position sensor B trouble codes include P0385, P0386, P0387, and P0388.\n"],"symptoms":["The engine will not start\nThe tachometer (if equipped) does not register RPM when the engine is cranked\nHesitation upon acceleration\nPoor engine performance\nDiminished fuel efficiency"],"causes":["Potential causes for this code to set are:","Defective CKP sensor\nOpen or shorted wiring to the CKP sensor\nCorroded or fluid soaked connector at the CKP sensor\nFaulty PCM or PCM programming error"],"type":"ERR"}