{"code":"P0391","description":"Camshaft Position Sensor \"B\" Circuit Range/Performance Bank 2","info":["This is a generic powertrain diagnostic trouble code (DTC), which means it covers all makes/models from 1996 and newer. Specific troubleshooting steps will vary depending on the vehicle.","This P0391 code basically means that the powertrain control module (PCM) detected a problem with the camshaft signal \"B\" for bank 2. Bank 2 refers to the bank of cylinders in the engine that does not contain cylinder #1.","\n ","Description and correlation of the crankshaft and camshaft position sensors","It's important in today's vehicles to understand what these sensors are and how they interact. All distributorless ignition vehicles use a crank and cam sensor to take the place of the module and trigger wheel found in an electronic distributor.","The crankshaft position sensor (CPS) signals the engine control module the location of the pistons relative to top dead center in preparation for injecting fuel and firing the spark plugs. The CMP signals the position of the camshaft intake lobe relative to the CPS signal and the opening of the intake valve for fuel injection on each cylinder.","Description and location of sensors","The crank and cam sensors provide an \"on and off\" signal. Both are either hall effect or magnetic in function.","A hall effect sensor uses an electro-magnetic sensor and a reluctor. The reluctor is shaped like small cups with squares cut out of the sides making it resemble a picket fence. The reluctor spins while the sensor is stationary and mounted very close to the reluctor. Every time a post passes in front of the sensor a signal is produced, and when the post passes, the signal is off.","A magnetic pickup uses a stationary sensor and a magnet attached to the rotating part. Every time the magnet passes in front of the sensor a signal is produced.","Locations","A hall effect crank sensor is located on the harmonic balancer in the front of the engine. The magnetic pickup can be in the side of the engine block where it uses the center of the crankshaft for a signal, or it can be in the bellhousing where it uses the flywheel as a trigger. The camshaft sensor mounts in the front or rear of the camshaft. P0391 specifically refers to bank 2 which is the bank of cylinders that does not contain cylinder #1."],"symptoms":["The car will likely run with this code set, as it is often intermittent and also because the PCM can often operate the vehicle in \"limp-in/limp-home\" mode even with a cam sensor signal problem. There may be no noticeable symptoms other than:","Malfunction Indicator Lamp (MIL) illumination (a.k.a. check engine light)\nLack of power\nPossible no start condition\nStalling"],"causes":["A code P0391 may mean that one or more of the following has happened:","Faulty camshaft position sensor (CMP) \"B\"\nPoor wiring connection at cam sensor \"B\"\nElectrical short or open condition in associated wiring\nLow/bad battery"],"type":"ERR"}