{"code":"P0394","description":"Camshaft Position Sensor \"B\" Circuit Intermittent (Bank 2)","info":["This is a generic powertrain diagnostic trouble code (DTC), which means it covers all makes/models starting around 2003. Specific troubleshooting steps will vary depending on the vehicle.","These vehicles can have a single camshaft in block, or a single (SOHC) or dual (DOHC) overhead camshafts, but this code is strictly concerned about the incoming signal from the camshaft position sensor(s) \"B\" from Bank 2 being missing at some point when it is not supposed to be. This is an electrical circuit fault, and it is intermittent in nature. It is not there all the time. Bank #2 is the bank of the engine that does not contain cylinder #1.","\n ","The PCM uses the Camshaft Position Sensor to tell it when the Crankshaft Sensor signal is correct, when a given Crankshaft Position Sensor signal is timed to Cylinder #1 for timing, and it is also used for fuel injector synchronization / start of injection.","Codes P0390 or P0391 may also be present at the same time as the P0394. The only difference between these 3 codes is how long the problem lasts and the type of electrical problem that the sensor/circuit/engine controller is having. Troubleshooting steps may vary depending upon manufacturer, type of camshaft position sensor and wire colors."],"symptoms":["Check Engine Light on\nIntermittent bucking or surging\nIntermittently Dies out, but will immediately restart"],"causes":["Typically the causes for this code are:","Intermittent open in the power supply circuit to the camshaft position sensor \"B\"\nIntermittent short to ground in the power supply circuit to the camshaft position sensor\n\"B\"\nIntermittent open in the ground circuit to the camshaft position sensor \"B\"\nIntermittent open in the signal circuit to the camshaft position sensor\nIntermittent short to 5 volts in the signal circuit to the camshaft position senso\nIntermittent short to ground in the signal circuit to the camshaft position sensor\nCamshaft Position Sensor tone ring damage\nOccasionally-Crankshaft Position Sensor producing intermittent signals"],"type":"ERR"}