{"code":"P0109","description":"Manifold Absolute Pressure/Barometric Pressure Circuit Intermittent","info":["This diagnostic trouble code (DTC) is a generic powertrain code, which means that it applies to all 1996-newer vehicles (Ford, Hyundai, Kia, Mazda, Mercedes Benz, etc.). Although generic, the specific repair steps may vary depending on make/model.","When I discover that a P0109 code has been stored, I know that it means that the powertrain control module (PCM) has detected an intermittent manifold absolute pressure/barometric pressure reading from the manifold absolute pressure sensor (MAP) or the barometric pressure sensor (BPS).","\n ","The MAP sensor is designed to enable the PCM to monitor variations in atmospheric pressure using absolute intake manifold pressure. Atmospheric pressure is directly related to the particular degree of altitude, as it applies to your vehicle. The MAP sensor is usually supplied with a reference voltage (5-volt) signal, a battery ground, and one (or more) output signal circuit/s.","MAP sensor resistance levels react to changes in absolute manifold pressure. Changing resistance levels in the MAP sensor create variations in sensor output voltage to the PCM. These varying voltage signals are not only used by the PCM to calaculate fuel delivery and ignition timing, but also compared with programmed specifications.","If input voltage fails to comply with programmed specifications, under certain circumstances for a set period of time, a P0109 will be stored and a malfunction indicator lamp (MIL) may be illuminated.","There are several different system of monitoring manifold absolute/barometric pressure. Consult your vehicle service manual or All Data (DIY) to determine the exact MAP sensor design of your vehicle.","\nAn example of a MAP sensor","Several manufacturers use a MAP sensor and a separate barometric pressure sensor. In this case, the MAP sensor is mounted away from the engine and has a vacuum hose connected to it. The degree of engine intake vacuum is gathered by the sensor and input to the PCM, where it is compared with the input signal from the barometric pressure sensor, intake air temperature, and other factors to determine actual altitude (elevation above sea level). If the MAP sensor and BPS input signals vary by more than the specified degree, a P0109 will be stored and a MIL illuminated.","Most automakers integrate the MAP sensor with the BPS. In this type of system, the sensor is mounted to the engine intake manifold. The scanner data stream may reflect only manifold absolute pressure instead of MAP and barometric pressure for this type of system.\n"],"symptoms":["Hesitation on acceleration\nGeneral lack of engine performance\nDiminished fuel efficiency\nBlack smoke from exhaust\nExcessively rich fuel exhaust fumes"],"causes":["Possible causes for this engine code include:","Defective MAP sensor\nOpen or shorted wiring for the MAP sensor and/or the BPS\nFaulty BPS\nCorroded connector face at the MAP/BPS sensor\nDefective PCM or PCM programming error"],"type":"ERR"}