{"code":"P011C","description":"Charge Air Temperature/Intake Air Temperature Correlation Bank 1","info":["This generic powertrain diagnostic trouble code (DTC) typically applies to all OBD-II vehicles. That may include but is not limited to vehicles from Nissan, Toyota, Chevrolet, GMC, Ford, Dodge, Vauxhall, etc. Although generic, the exact repair steps may vary depending on make/model.","A stored code P011C means that the powertrain control module (PCM) has detected a discrepancy in the correlating signals between the charge air temperature (CAT) sensor and the intake air temperature (IAT) sensor for engine bank number one.","\n ","Bank 1 refers to the engine bank that contains the number one cylinder. As you can probably tell by the code description, this code is used only in vehicles that are equipped with forced air induction devices and multiple intake air inlet sources. Intake air inlet sources are called throttle bodies. Forced air induction devices include turbochargers and superchargers.","CAT sensors are normally composed of a thermal resistor that protrudes from the housing on a wire pedestal. The resistor is positioned so that ambient air entering the engine intake, after leaving the intercooler (sometimes called the air charge cooler), may flow across it. The housing is normally designed to thread or bolt into a turbocharger/supercharger inlet pipe, near the intercooler). As charge air temperature increases, the level of resistance in the CAT resistor decreases; causing circuit voltage to move towards the reference maximum. The PCM sees these variations in CAT sensor voltage as changes in charge air temperature.","The CAT sensor/s provides data to the PCM for boost pressure solenoid operation and boost pressure release valve operation, as well as certain facets of fuel delivery and ignition timing calculation.","The IAT sensor acts in much the same manner as the CAT sensor; in fact, some early (pre OBD-II) computerized vehicle service manuals described the intake air temperature sensor as an air charge temperature sensor. The IAT sensor is positioned so that ambient intake air is drawn across it as it is enters the engine intake. The IAT sensor is located near the air filter housing or air inlet pipe.","A code P011C will be stored and a malfunction indicator lamp (MIL) may be illuminated if the PCM detects voltage signals from the CAT sensor and the IAT sensor which differ by more than a preprogrammed degree. Multiple ignition cycles, with a failure, may be required for MIL illumination."],"symptoms":["Decreased engine performance\nExcessive rich or lean exhaust\nDelayed engine start-up (especially when cold)\nDiminished fuel efficiency"],"causes":["Defective CAT/IAT sensor\nOpen or shorted CAT/IAT sensor wiring or connector\nRestricted intercooler\nPCM or PCM programming error"],"type":"ERR"}