{"code":"P013D","description":"O2 Sensor Slow Response - Lean to Rich (Bank 2 Sensor 2)","info":["This diagnostic trouble code (DTC) is a generic powertrain code, which means that it applies to OBD-II equipped vehicles (GMC, Chevrolet, Ford, Dodge, Chrysler, VW, Toyota, Honda, etc.). Although generic, the specific repair steps may vary depending on make/model.","When an OBD-II equipped vehicle has a stored P013D code, it means that the powertrain control module (PCM) has detected a slow response time from the downstream (or post catalytic converter) oxygen (O2) sensor or circuit for engine bank one. Bank 1 specifies the bank of the engine which contains the number one cylinder.","\n ","Automotive O2 / oxygen sensors are constructed using a zirconium dioxide sensing element which is protected by a specially designed, vented, steel housing. Platinum electrodes are used to attach the sensing element to wire leads in the O2 sensor wiring harness which is connected to the PCM through the controller area network (CAN). The PCM is supplied with an electrical signal according to the percentage of oxygen particles in the engine exhaust compared to the oxygen content of ambient air.","Exhaust gases are pushed into the exhaust manifold(s) and down pipe(s) where they flow over/through the upstream O2 sensor. Exhaust flows through the O2 sensor vent holes (in the steel housing) and across the sensing element and ambient air is drawn through the wire lead cavities where it is trapped in a small chamber in the center of the sensor. The trapped ambient air (in the chamber) is heated by the exhaust, forcing the oxygen ions to produce (energy) voltage.","Deviations between the concentration of oxygen molecules in ambient air (drawn into the center cavity of the O2 sensor) and the concentration of oxygen ions in the spent exhaust gases, cause the heated oxygen ions inside the O2 sensor to jump between platinum layers very rapidly and repetitiously. Fluctuations in voltage occur as the rushing oxygen ions jump between the layers of the platinum electrodes. These variations in voltage are identified by the PCM as changes in exhaust oxygen concentration which indicate that the engine is either running lean (too little fuel) or rich (too much fuel). When more oxygen is present in the exhaust (lean condition), the voltage signal from the O2 sensor is low and is higher when less oxygen is present in the exhaust (rich condition). This data is used by the PCM primarily to calculate fuel delivery and ignition timing strategy but also to monitor catalytic converter efficiency.","If the O2 sensor in question fails to cycle as rapidly and/or regularly as expected, over a set period of time and under certain predetermined circumstances, a P013D code will be stored and a malfunction indicator lamp may be illuminated.","Other O2 sensor slow response trouble codes include:","P013A O2 Sensor Slow Response - Rich to Lean (Bank 1 Sensor 2)\nP013B O2 Sensor Slow Response - Lean to Rich (Bank 1 Sensor 2)\nP013C O2 Sensor Slow Response - Rich to Lean (Bank 2 Sensor 2)\nP014C O2 Sensor Slow Response - Rich to Lean (Bank 1 Sensor 1)\nP014D O2 Sensor Slow Response - Lean to Rich (Bank 1 Sensor 1)\nP014E O2 Sensor Slow Response - Rich to Lean (Bank 2 Sensor 1)\nP014F O2 Sensor Slow Response - Lean to Rich (Bank 2 Sensor 1)"],"symptoms":["Lowered fuel efficiency\nA general lack engine performance\nOther related diagnostic trouble codes may also be stored\nService engine soon lamp illumination"],"causes":["Potential causes for this code to set are:","Defective O2 sensor(s)\nBurnt, broken, or disconnected wiring and/or connectors\nDefective catalytic converter\nEngine exhaust leaks"],"type":"ERR"}