{"code":"P0149","description":"Fuel Timing Error","info":["This diagnostic trouble code (DTC) is a generic powertrain code, which means that it applies to OBD-II equipped vehicles (Dodge, Ram, Ford, GMC, Chevrolet, VW, Audi, etc.). Although generic, the specific repair steps may vary depending on make/model.","If your OBD II equipped vehicle has presented a code P0149, it means that the powertrain control module (PCM) has detected a malfunction in the timing sequence of the fuel pump. I have never seen this code exhibited in a vehicle that was not propelled by a diesel engine.","\n ","Most of today’s clean burning, direct injection, diesel engines utilize a mechanical fuel pump that is driven directly off the crankshaft. In order to overcome the high compression ratios associated with diesel engines, this type of pump is timed in sequence with the position of the crankshaft to provide a high pressure injection pulse (up to 44,000 psi) at a precise point and interval, for each cylinder of the engine. The fuel pump is typically small enough to fit underneath the intake manifold and has the low pressure pump, the high pressure pump, the fuel timing solenoid, and the fuel pressure control actuator integrated within. There will likely be a fuel pressure sensor nearby as well.","The fuel pump is pulsed using a toothed sprocket which is aligned with a toothed sprocket on the front of the crankshaft. Timing of the two sprockets (using a steel chain) is critical to fuel pump timing and fuel delivery. If the two sprockets are misaligned by even a single tooth, a code P0149 may be stored.","The PCM uses inputs related to engine RPM and engine load to calculate fuel timing advance. The electronic fuel timing solenoid is controlled by the PCM and allows direct injection timing to be advanced according to engine speed and load.","The electronic fuel pressure regulator is also controlled by the PCM and is responsible for controlling fuel pump pressure. The fuel pressure sensor monitors fuel pressure, with the engine running, and provides the PCM with an actual reading so that it can continue to plot fuel pump timing and monitor fuel pressure requirements. If the PCM detects a fuel pressure input signal, indicating that there is a problem with fuel pump timing, a code P0149 will be stored and a malfunction indicator lamp may be illuminated.","NOTE: Please use extreme caution when attempting to service the high pressure fuel system. This type of system should be serviced only by trained personnel. Consult a reliable vehicle information source (such as All Data DIY) for more precautions.\n"],"symptoms":["No start condition\nDiminished engine performance\nAdditional fuel system codes\nIntense fuel odor\nThe vehicle may enter imp-in mode\nExcessive smoke from exhaust"],"causes":["Potential causes for this code to set are:","Defective fuel timing solenoid\nMisaligned timing marks on mechanical sprockets\nBad fuel pressure sensor\nMalfunctioning fuel pressure control actuator\nFuel system leaks\nFaulty PCM or a PCM programming error"],"type":"ERR"}