{"code":"P0143","description":"02 Sensor Circuit Low Voltage (Bank 1 Sensor 3)","info":["This diagnostic trouble code (DTC) is a generic powertrain code, which means that it applies to OBD-II equipped vehicles. Although generic, the specific repair steps may vary depending on make/model.","The Catalytic Converter is used to help control emissions. The PCM (Powertrain Control Module) uses the signal from the oxygen sensor to the rear of the catalyst to monitor the catalyst's efficiency.","\n ","This is the bank 1,3 sensor. It's a four wire sensor being supplied a 0.5 volt reference voltage as well as a power and ground circuit for the o2 sensor heater element. There is also a signal wire from the oxygen sensor to the PCM that can vary between about 0.1 volts to about 0.9 volts according to oxygen content of the exhaust. A properly working post-cat sensor will exhibit small changes at a slower rate than front o2 sensors.","To over simplify: a post-cat sensor's main job is to monitor catalyst efficiency, not control fuel management (although they can have a measure of influence over the front o2 sensor's operation). If the PCM determines that the post-cat o2 sensor signal voltage is below a certain threshold for too long, P0143 will set. PCM detected the HO2S signal was less than 156 mv for 28 seconds."],"symptoms":["Usually rear o2 sensor problems won't cause drivability issues since they are an input that measures catalyst efficiency (unlike front o2 sensors). However if you have other codes present, like lean codes or pre-o2 sensor codes, then they may cause drivability problems as well as P0143. The following symptoms may be present:","MIL (Malfunction Indicator Lamp) illumination\nEngine performance issues\nEngine running rough\nEngine running rich\nPoor idle"],"causes":["An engine that is running lean could set this code, however there will likely be other codes present.","Air leaks in exhaust in front of o2 sensor giving false reading\nO2 sensor connector damaged\nO2 sensor signal circuit is shorted to ground\nO2 sensor ground circuit is open\nO2 sensor has failed (it may be contaminated with fuel or coolant)\nPCM has failed"],"type":"WARN"}