{"code":"P0140","description":"02 Sensor Circuit No Activity Detected (Bank 1 Sensor 2)","info":["This diagnostic trouble code (DTC) is a generic powertrain code, which means that it applies to OBD-II equipped vehicles. Although generic, the specific repair steps may vary depending on make/model.","The Powertrain control module (PCM) will provide a .45 volt reference voltage to the Oxygen sensor. When the O2 sensor reaches operating temperature, it will generate a voltage that will vary depending on the oxygen content of the exhaust. Lean exhaust generates a low voltage (less than .45V) and rich exhaust generates a high voltage (greater than .45V).","\n ","O2 sensors on a specific bank marked as \"sensor 2\" (as this one is) are used to monitor emissions. A Three-Way Catalyst (TWC) system (catalytic converter) is used to control tailpipe emissions. The PCM uses the signal received from Oxygen sensor 2 (#2 indicates aft of catalytic converter, #1 indicates pre-converter) to read efficiency of TWC. Normally this sensor will switch between high and low voltage at a noticeably slower rate than the front sensor. This is normal. If the signal received from rear (#2) O2 sensor indicates that the voltage has \"stuck\" between .425V to .474 V, the PCM determines this sensor is inactive and this code will set."],"symptoms":["Your check engine light(CEL), or malfuction indicator lamp (MIL) will be illuminated. There will not likely be any noticeable drivability problems other than the MIL. The reason is this: The rear or post catalytic converter Oxygen sensor does not affect fuel deliver(this is an exception on Chryslers). It only MONITORS the efficiency of the catalytic converter. For this reason, you will likely not notice any engine trouble."],"causes":["The causes for a P0140 code are fairly few. They could be any of the following:","Shorted heater circuit in O2 sensor. (Usually requires replacement of heater circuit fuse in fuse block also)\nShorted signal circuit in O2 sensor\nMelting of harness connector or wiring due to contact with exhaust system\nWater intrusion in harness connector or PCM connector\nBad PCM"],"type":"ERR"}