{"code":"P0158","description":"O2 Sensor Circuit High Voltage (Bank 2 Sensor 2)","info":["This diagnostic trouble code (DTC) is a generic powertrain code, which means that it applies to OBD-II equipped vehicles. Although generic, the specific repair steps may vary depending on make/model.","The catalytic converter is used to lower harmful emissions. To ensure proper operation, there is an O2 sensor located behind the catalyst that monitors the oxygen content of the exhaust after the cat. The PCM (Powertrain Control Module) then compares the post-cat reading to the pre-cat readings to determine if the catalyst is working properly.","\n ","A P0158 refers to a fault at the post-cat o2 sensor on bank 2 (second sensor back on bank 2), indicating that the signal voltage is too high. The o2 sensor is a four wire sensor. Two wires are dedicated to the heating element and two wires are dedicated to the sensor. The heating element should have battery voltage on one wire with key on engine off and ground should be present on the other. The PCM supplies a reference voltage of 0.5 volts to the o2 sensor which the sensor varies according to oxygen content in the exhaust. The PCM also supplies a ground to the sensor. Changes in oxygen content cause resistance changes in the o2 sensor. This change in resistance affects the PCM-supplied 0.5 volts. It is capable of varying between approximately 0.1 and 0.9 volts. A reading of 0.1 indicates full lean and 0.9 indicates full rich. This variance in the voltage is monitored by the PCM.","A P0158 code means that the voltage was higher than normal on the signal circuit. NOTE: A post-catalyst o2 sensor will normally switch slower and fewer times than front (pre-cat) o2 sensors."],"symptoms":["MIL (Malfunction Indicator Lamp) on\nEngine loses power and misses intermittently\nMay exhibit loss of fuel efficiency\nEngine running rich"],"causes":["Potential causes of an P0158 code include:","Bad o2 sensor (Bank 2 Sensor 2)\nWiring in contact with exhaust components\nEngine running rich (If other codes are present)\nHoles in exhaust causing PCM to over-rich engine resulting in an abnormally high Bank 2, sensor 2 reading\nShort to voltage on signal circuit\nBad PCM"],"type":"WARN"}