{"code":"P0169","description":"Incorrect Fuel Composition","info":["This diagnostic trouble code (DTC) is a generic powertrain code, which means that it applies to OBD-II equipped vehicles (Dodge, Ram, Ford, GMC, Chevrolet, VW, Toyota, etc.). Although generic, the specific repair steps may vary depending on make/model.","A stored code P0169, means that the powertrain control module (PCM) has detected a voltage signal from the fuel composition sensor/fuel temperature sensor that indicates an abnormally high level of contaminants or ethanol in the fuel supply. Since flex fuel vehicles can function normally even with high concentrations of ethanol, unacceptable levels of ethanol would likely exceed eighty-five-percent.","\n ","The fuel composition sensor is usually integrated into a single housing with the fuel temperature sensor. Although it resembles a fuel filter, it is a small computerized device designed to provide the PCM with an accurate fuel composition and fuel temperature analysis.","As fuel passes through the inline sensor, it is electronically analyzed to determine the degree of ethanol, water, and unknown contaminants (non-fuel) found therein. The fuel composition sensor not only analyzes fuel composition but also fuel temperature. The information is input to the PCM as an electrical signal that reflects not only what contaminants are present (and to what degree the fuel has been contaminated) but also the temperature of the fuel. Fuel contamination is analyzed, according to the ratio of contaminants to fuel.","This generates a voltage signature in the fuel composition/temperature sensor which is input to the PCM as square waveforms of voltage. Waveform patterns vary in frequency contingent to the degree of contamination found in the fuel. The closer the waveform frequency, the greater the degree of fuel contamination; this constitutes the vertical portion of the waveform. The fuel composition sensor analyzes the amount of ethanol present in fuel independently of other contaminants.","If the PCM detects an input signal from the fuel composition sensor that indicates that fuel contamination exceeds a programmed limit, a P0169 code will be stored and a malfunction indicator lamp (MIL) may be illuminated. Multiple ignition cycles (with a failure) may be required for MIL illumination on some vehicles.\n"],"symptoms":["Usually no symptoms accompany a code P0169\nOther fuel composition codes may be present\nMIL illumination will eventually occur"],"causes":["Potential causes for this code to set are:","Excessive fuel contamination\nDefective fuel composition/temperature sensor\nOpen, shorted, or damaged wiring or connectors\nPCM or a PCM programing error"],"type":"ERR"}