{"code":"P0162","description":"O2 Sensor Circuit Malfunction (Bank 2 Sensor 3)","info":["This diagnostic trouble code (DTC) is a generic powertrain code, which means that it applies to OBD-II equipped vehicles. Although generic, the specific repair steps may vary depending on make/model.","The O2 (oxygen) sensors measure oxygen content in the exhaust, whether rich or lean. The PCM (powertrain control module) then uses this information to regulate fuel injector pulse in order to keep the proper air:fuel ratio. The O2 sensors are very important for the proper operation of the engine.","\n ","Fouled or faulty O2 sensors can cause the PCM to add or take away fuel based on the faulty O2 sensor data which can cause a false lean or rich condition. A P0162 code refers to the Bank 2,3 O2 sensor, or the third sensor downstream (post-cat) on Bank 2. It is a four wire sensor. The PCM supplies a ground circuit and a reference voltage circuit of about 0.5 volts or half a volt. Also for the O2 sensor heater element there is a battery voltage supply wire (usually from the power distribution center) and another ground circuit for that. The O2 sensor heater allows the O2 sensor to warm up faster, thus achieving closed loop in less time than it would normally take for the exhaust to warm the sensor up to operating temperature. This creates less exhaust emissions at cold startup. The O2 sensor varies the supplied reference voltage based on oxygen content in the exhaust. It is capable of varying from about 0.1 to 0.9 volts, 0.1 V indicating lean exhaust and 0.9 V indicating rich exhaust. This P0162 code indicates that the Bank 2, 3 O2 sensor is stuck low for too long or is inactive."],"symptoms":["Often post-cat O2 sensor problems present few drivability issues since they are inputs to the PCM to monitor catalytic converter quality and don't directly control fuel. Sometimes no symptoms are noticeable. However the following may be possible on some vehicles:","MIL (Malfunction Indicator Lamp) illumination\nDecrease in MPG\nIncrease in tailpipe emissions"],"causes":["Potential causes of a P0162 code include:","Bad O2 sensor\nSignal shorted to voltage\nWiring problems due to contact with exhaust components\nHoles in exhaust near O2 sensor"],"type":"ERR"}