{"code":"P0188","description":"Fuel Temperature Sensor B Circuit High Input","info":["This diagnostic trouble code (DTC) is a generic powertrain code, which means that it applies to OBD-II equipped vehicles (Nissan, Ford, Fiat, Chevrolet, Toyota, Dodge, etc.). Although generic, the specific repair steps may vary depending on make/model.","I have found that a stored code P0188 means that the powertrain control module (PCM) has detected a voltage signal from the fuel temperature sensor (or circuit) that is higher than expected. Fuel temperature sensors, in my experience, are typically integrated into the fuel composition sensor. \"B\" refers to an area of circuitry as opposed to a particular circuit or component.","\n ","The fuel composition sensor provides the PCM with an accurate fuel composition and fuel temperature analysis. The fuel composition sensor is computerized and is found in-line between the fuel tank and the fuel rail.","As fuel passes through the fuel composition sensor, the percentage of ethanol, water, and other contaminants are assessed. Square waveform voltage patterns are input to the PCM according to the level of contamination in the fuel. Shorter waveform frequencies indicate a high percentage of fuel contamination. Waveform frequency could also be illustrated as the vertical posting of the pattern. The amount of ethanol present in the fuel is typically categorized independently of other contaminants. Flex fuel vehicles function normally even if fuel composition levels are as high as eighty-five-percent ethanol.","Fuel temperature is recognized by the PCM as pulse width or the horizontal portion of the waveform. The thicker the pulse width signal, the higher the temperature of the fuel passing through the fuel composition sensor. One and five-milliseconds (hundredths-of-a-second) is the usual pulse width variation used in most vehicles.","If fuel temperature appears much higher than ambient temperature, a P0188 code will be stored and a malfunction indicator lamp (MIL) may be illuminated. Most OBD II equipped vehicles will require multiple ignition cycles (with a failure) for MIL illumination."],"symptoms":["Possible MIL illumination\nThere may be no obvious symptoms\nOther fuel composition codes may be present"],"causes":["Potential causes for this code to set are:","Faulty intake air temperature sensor\nA bad ambient temperature sensor\nDefective fuel temperature/composition sensor\nOpen, shorted, or damaged wiring or connectors\nPCM or a PCM programing error"],"type":"WARN"}