{"code":"P0184","description":"Fuel Temperature Sensor A Circuit Intermittent","info":["This diagnostic trouble code (DTC) is a generic powertrain code, which means that it applies to OBD-II equipped vehicles (Nissan, Ford, Fiat, Chevrolet, Toyota, Dodge, etc.). Although generic, the specific repair steps may vary depending on make/model.","Simply stated, a stored code P0184 means that the powertrain control module (PCM) has detected a voltage signal from the fuel temperature sensor (or circuit) that is intermittent or erratic. \"A\" refers to an area of circuitry as opposed to a particular circuit or component.","\n ","Fuel temperature sensors, in OBD II equipped vehicles, are typically integrated into the fuel composition sensor housing. The fuel composition sensor provides an accurate fuel composition and fuel temperature analysis to the PCM. A small, computerized mechanism, the fuel composition sensor is found in-line between the fuel tank and the fuel rail.","Fuel passing through the fuel composition sensor, is evaluated to determine the percentage of ethanol, water, and other contaminants. Square waveform patterns (representing voltage) are input to the PCM according to the level of contamination in the fuel. High concentrations of fuel contamination are indicated by shorter waveform frequencies. Waveform frequency could also be explained as the vertical posting of the pattern.","Flex fuel vehicles typically function well with fuel composition levels that are as high as eighty-five-percent ethanol. The horizontal portion of the waveform represents fuel temperature and is recognized by the PCM as pulse width. The broader the pulse width of the waveform, the higher the temperature of the fuel passing through the fuel composition sensor. Between one and five-milliseconds (hundredths-of-a-second) is the usual pulse width variation in OBD II vehicles.","If the fuel temperature signal appears intermittent or erratic, a P0184 code will be stored and a malfunction indicator lamp (MIL) may be illuminated. The majority of OBD II equipped vehicles will require multiple ignition cycles (with a failure) for MIL illumination."],"symptoms":["Other fuel composition codes may be present\nPossible MIL illumination\nThere may be no obvious symptoms"],"causes":["Potential causes for this code to set are:","pen, shorted, or damaged wiring or connectors\nDefective fuel temperature/composition sensor\nFaulty intake air temperature sensor\nA bad ambient temperature sensor\nPCM or a PCM programing error"],"type":"ERR"}