{"code":"P0180","description":"Fuel Temperature Sensor A Circuit Malfunction","info":["This diagnostic trouble code (DTC) is a generic powertrain code, which means that it applies to OBD-II equipped vehicles (Nissan, Ford, Fiat, Chevrolet, Mercedes, Dodge, etc.). Although generic, the specific repair steps may vary depending on make/model.","If your OBD II equipped vehicle has stored a code P0180; it simply means that the powertrain control module (PCM) has detected a voltage signal from the fuel temperature sensor/flex fuel sensor or circuit \"A\" that is not within a programmed range. \"A\" refers to an area of circuitry as opposed to a particular circuit or component.","\n ","The fuel temperature sensor is typically integrated into a single housing (along with the flex fuel sensor) known as a fuel composition sensor. It is actually a small computerized device designed to provide the PCM with an accurate fuel composition and fuel temperature reading.","Fuel which passes through the inline sensor is monitored to determine what degree of ethanol, water, and other contaminants is present. The fuel composition sensor calculates fuel composition and fuel temperature and inputs an electrical signal to the PCM that reflects not only what contaminants are present but also to what degree the fuel has been contaminated. The contamination is measured according to the percentage of contaminants to fuel and is received by the PCM as a square waveform of voltage. The waveform pattern varies in frequency depending upon the degree of contaminants present in the fuel; the closer the waveform frequency, the higher the degree of fuel contamination. This composes the vertical portion of the waveform. The fuel composition sensor monitors the amount of ethanol present in the fuel separately from other contaminants. Flex fuel vehicles are designed to function efficiently when fuel composition levels are as high as eighty-five-percent ethanol.","The horizontal portion of the waveform, or the pulse width, indicates fuel temperature. The greater the pulse width speed, the higher the temperature of the fuel passing through the fuel composition sensor. Pulse width modulation varies (on most applications) between one and five-milliseconds (hundredths-of-a-second).","If the PCM detects an input signal from the fuel composition sensor that indicates that the fuel temperature is not within a programmed range, or if the fuel temperature varies from ambient temperature (intake air temperature on some models) by a greater degree than expected, a P0180 code will be stored and a malfunction indicator lamp (MIL) may be illuminated. Some models may require multiple ignition cycles (with a failure) for MIL illumination."],"symptoms":["There will likely be no symptoms from the conditions for a P0180 being stored\nOther fuel composition codes may be present\nMIL illumination will eventually occur"],"causes":["Potential causes for this code to set are:","Defective fuel temperature/consumption sensor \"A\"\nA bad ambient temperature sensor\nFaulty intake air temperature sensor\nOpen, shorted, or damaged wiring or connectors\nPCM or a PCM programing error"],"type":"ERR"}